ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define DMAMUX1_CHANNEL0_BASE    (DMAMUX1_BASE)
#define DMAMUX1_CHANNEL1_BASE    (DMAMUX1_BASE + 0x00000004UL)
#define DMAMUX1_CHANNEL2_BASE    (DMAMUX1_BASE + 0x00000008UL)
#define DMAMUX1_CHANNEL3_BASE    (DMAMUX1_BASE + 0x0000000CUL)
#define DMAMUX1_CHANNEL4_BASE    (DMAMUX1_BASE + 0x00000010UL)
#define DMAMUX1_CHANNEL5_BASE    (DMAMUX1_BASE + 0x00000014UL)
#define DMAMUX1_CHANNEL6_BASE    (DMAMUX1_BASE + 0x00000018UL)
#define DMAMUX1_CHANNEL7_BASE    (DMAMUX1_BASE + 0x0000001CUL)
#define DMAMUX1_CHANNEL8_BASE    (DMAMUX1_BASE + 0x00000020UL)
#define DMAMUX1_CHANNEL9_BASE    (DMAMUX1_BASE + 0x00000024UL)
#define DMAMUX1_CHANNEL10_BASE   (DMAMUX1_BASE + 0x00000028UL)
#define DMAMUX1_CHANNEL11_BASE   (DMAMUX1_BASE + 0x0000002CUL)

#define DMAMUX1_REQUESTGENERATOR0_BASE  (DMAMUX1_BASE + 0x00000100UL)
#define DMAMUX1_REQUESTGENERATOR1_BASE  (DMAMUX1_BASE + 0x00000104UL)
#define DMAMUX1_REQUESTGENERATOR2_BASE  (DMAMUX1_BASE + 0x00000108UL)
#define DMAMUX1_REQUESTGENERATOR3_BASE  (DMAMUX1_BASE + 0x0000010CUL)

#define DMAMUX1_CHANNELSTATUS_BASE      (DMAMUX1_BASE + 0x00000080UL)
#define DMAMUX1_REQUESTGENSTATUS_BASE   (DMAMUX1_BASE + 0x00000140UL)

/*!< IOPORT */
#define GPIOA_BASE            (IOPORT_BASE + 0x00000000UL)
#define GPIOB_BASE            (IOPORT_BASE + 0x00000400UL)
#define GPIOC_BASE            (IOPORT_BASE + 0x00000800UL)
#define GPIOD_BASE            (IOPORT_BASE + 0x00000C00UL)
#define GPIOE_BASE            (IOPORT_BASE + 0x00001000UL)
#define GPIOF_BASE            (IOPORT_BASE + 0x00001400UL)






//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- INTERRUPTS CHANNEL -----------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------

//Interrupt vector table type
typedef void( *interruptfunc )( void );

typedef union
{
    interruptfunc __fun;
    void * __ptr;
} INTERRUPT_TABLE_TYPE;
/*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M0+ Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQ_CHANNEL         = -14,    /*!< 2 Non Maskable Interrupt                                          */
  HardFault_IRQ_CHANNEL              = -13,    /*!< 3 Cortex-M Hard Fault Interrupt                                   */
  SVC_IRQ_CHANNEL                    = -5,     /*!< 11 Cortex-M SV Call Interrupt                                     */
  PendSV_IRQ_CHANNEL                 = -2,     /*!< 14 Cortex-M Pend SV Interrupt                                     */
  SysTick_IRQ_CHANNEL                = -1,     /*!< 15 Cortex-M System Tick Interrupt                                 */
/******  STM32G0xxxx specific Interrupt Numbers ****************************************************************/
  WWDG_IRQ_CHANNEL                   = 0,      /*!< Window WatchDog Interrupt                                         */
  PVD_IRQ_CHANNEL                    = 1,      /*!< PVD through EXTI line 16, PVM (monit. VDDIO2) through EXTI line 34*/
  RTC_TAMP_IRQ_CHANNEL               = 2,      /*!< RTC interrupt through the EXTI line 19 & 21                       */
  FLASH_IRQ_CHANNEL                  = 3,      /*!< FLASH global Interrupt                                            */
  RCC_CRS_IRQ_CHANNEL                = 4,      /*!< RCC and CRS global Interrupt                                      */
  EXTI0_1_IRQ_CHANNEL                = 5,      /*!< EXTI 0 and 1 Interrupts                                           */
  EXTI2_3_IRQ_CHANNEL                = 6,      /*!< EXTI Line 2 and 3 Interrupts                                      */
  EXTI4_15_IRQ_CHANNEL               = 7,      /*!< EXTI Line 4 to 15 Interrupts                                      */
  USB_UCPD1_2_IRQ_CHANNEL            = 8,      /*!< USB, UCPD1 and UCPD2 global Interrupt                             */
  DMA1_Channel1_IRQ_CHANNEL          = 9,      /*!< DMA1 Channel 1 Interrupt                                          */
  DMA1_Channel2_3_IRQ_CHANNEL        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupts                           */
  DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQ_CHANNEL = 11, /*!< DMA1 Ch4 to Ch7, DMA2 Ch1 to Ch5 and DMAMUX1 Overrun Interrupts */
  ADC1_COMP_IRQ_CHANNEL              = 12,     /*!< ADC1, COMP1,COMP2, COMP3 Interrupts (combined with EXTI 17 & 18)  */
  TIM1_BRK_UP_TRG_COM_IRQ_CHANNEL    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupts            */
  TIM1_CC_IRQ_CHANNEL                = 14,     /*!< TIM1 Capture Compare Interrupt                                    */
  TIM2_IRQ_CHANNEL                   = 15,     /*!< TIM2 Interrupt                                                    */
  TIM3_TIM4_IRQ_CHANNEL              = 16,     /*!< TIM3, TIM4 global Interrupt                                       */
  TIM6_DAC_LPTIM1_IRQ_CHANNEL        = 17,     /*!< TIM6, DAC and LPTIM1 global Interrupts                            */
  TIM7_LPTIM2_IRQ_CHANNEL            = 18,     /*!< TIM7 and LPTIM2 global Interrupt                                  */
  TIM14_IRQ_CHANNEL                  = 19,     /*!< TIM14 global Interrupt                                            */
  TIM15_IRQ_CHANNEL                  = 20,     /*!< TIM15 global Interrupt                                            */
  TIM16_IRQ_CHANNEL                  = 21,     /*!< TIM16, FDCAN1_IT0 and FDCAN2_IT0 Interrupt                        */
  TIM17_IRQ_CHANNEL                  = 22,     /*!< TIM17, FDCAN1_IT1 and FDCAN2_IT1 Interrupt                        */
  I2C1_IRQ_CHANNEL                   = 23,     /*!< I2C1 Interrupt  (combined with EXTI 23)                           */
  I2C2_3_IRQ_CHANNEL                 = 24,     /*!< I2C2, I2C3 Interrupt (combined with EXTI 24 and EXTI 22)          */
  SPI1_IRQ_CHANNEL                   = 25,     /*!< SPI1/I2S1 Interrupt                                               */
  SPI2_3_IRQ_CHANNEL                 = 26,     /*!< SPI2/I2S2, SPI3/I2S3 Interrupt                                    */
  USART1_IRQ_CHANNEL                 = 27,     /*!< USART1 Interrupt                                                  */
  USART2_IRQ_CHANNEL                 = 28,     /*!< USART2 + LPUART2 Interrupt                                        */
  USART3_4_5_6_LPUART1_IRQ_CHANNEL   = 29,     /*!< USART3, USART4, USART5, USART6, LPUART1 globlal Interrupts (combined with EXTI 28) */
  CEC_IRQ_CHANNEL                    = 30,     /*!< CEC Interrupt(combined with EXTI 27)                               */
} IRQ_CHANNEL_TYPE;


