ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
typedef enum
{
    CSTACK_TOP_INDEX                        =   0,
    RESET_HANDLER_INDEX                     =   1,
    NMI_IRQEXCEPTION_INDEX                  =   2,
    HARDFAULT_IRQEXCEPTION_INDEX            =   3,
    SVCALL_IRQHANDLER_INDEX                 =   11,
    PENDSVC_IRQHANDLER_INDEX                =   14,
    SYSTICK_IRQHANDLER_INDEX                =   15,
    WWDG_IRQHANDLER_INDEX                   =   16,
    PVD_IRQHANDLER_INDEX                    =   17,
    RTC_IRQHANDLER_INDEX                    =   18,
    FLASH_IRQHANDLER_INDEX                  =   19,
    RCC_IRQHANDLER_INDEX                    =   20,
    EXTI0_1_IRQHANDLER_INDEX                =   21,
    EXTI2_3_IRQHANDLER_INDEX                =   22,
    EXTI4_15_IRQHANDLER_INDEX               =   23,
    USB_UCPD1_2_IRQHANDLER_INDEX            =   24,
    DMA1CHANNEL1_IRQHANDLER_INDEX           =   25,
    DMA1CHANNEL2_3_IRQHANDLER_INDEX         =   26,
    DMA1CHANNEL4_7_DMAMUX1_OVR_IRQHANDLER_INDEX =   27,
    ADC1_COMP_IRQHANDLER_INDEX              =   28,
    TIM1_BRK_UP_TRG_COM_IRQHANDLER_INDEX    =   29,
    TIM1_CC_IRQHANDLER_INDEX                =   30,
    TIM2_IRQHANDLER_INDEX                   =   31,
    TIM3_TIM4_IRQHANDLER_INDEX              =   32,
    TIM6_DAC_IRQHANDLER_INDEX               =   33,
    TIM7_DAC_IRQHANDLER_INDEX               =   34,
    TIM14_IRQHANDLER_INDEX                  =   35,
    TIM15_IRQHANDLER_INDEX                  =   36,
    TIM16_IRQHANDLER_INDEX                  =   37,
    TIM17_IRQHANDLER_INDEX                  =   38,
    I2C1_IRQHANDLER_INDEX                   =   39,
    I2C2_3_IRQHANDLER_INDEX                 =   40,
    SPI1_IRQHANDLER_INDEX                   =   41,
    SPI2_3_IRQHANDLER_INDEX                 =   42,
    USART1_IRQHANDLER_INDEX                 =   43,
    USART2_LPUART2_IRQHANDLER_INDEX         =   44,
    USART3_4_5_6_LPUART1_IRQHANDLER_INDEX   =   45,
    CEC_IRQHANDLER_INDEX                    =   46,
} IRQ_INDEX_TYPE;





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- GPIO -------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief General Purpose IO
 */
typedef struct
{
    volatile uint32 MODER;        //! GPIO port mode register,
    volatile uint16 OTYPER;      //! GPIO port output type register,
    volatile uint16 RESERVED0;   //! Reserved,
    volatile uint32 OSPEEDR;      //! GPIO port output speed register,
    volatile uint32 PUPDR;        //! GPIO port pull-up/pull-down register,
    volatile uint16 IDR;         //! GPIO port input data register,
    volatile uint16 RESERVED1;   //! Reserved,
    volatile uint16 ODR;         //! GPIO port output data register,
    volatile uint16 RESERVED2;   //! Reserved,
    volatile uint32 BSRR;         //! GPIO port bit set/reset registerBSRR,
    volatile uint32 LCKR;         //! GPIO port configuration lock register,
    volatile uint32 AFR[2];       //! GPIO alternate function low register,
    volatile uint16 BRR;         //! GPIO bit reset register,
    volatile uint16 RESERVED3;   //! Reserved,
} GPIO_DEF;

#define GPIO0    (*(GPIO_DEF *)GPIOA_BASE)
#define GPIO1    (*(GPIO_DEF *)GPIOB_BASE)
#define GPIO2    (*(GPIO_DEF *)GPIOC_BASE)
#define GPIO3    (*(GPIO_DEF *)GPIOD_BASE)
#define GPIO4    (*(GPIO_DEF *)GPIOE_BASE)
#define GPIO5    (*(GPIO_DEF *)GPIOF_BASE)


//#define PORT_DEF        GPIO_DEF *         //! This define is mandatory, it defines a GPIO register's type


#define GPIOA       (volatile GPIO_DEF *)GPIOA_BASE
#define GPIOB       (volatile GPIO_DEF *)GPIOB_BASE
#define GPIOC       (volatile GPIO_DEF *)GPIOC_BASE
#define GPIOD       (volatile GPIO_DEF *)GPIOD_BASE
#define GPIOE       (volatile GPIO_DEF *)GPIOE_BASE
#define GPIOF       (volatile GPIO_DEF *)GPIOF_BASE


typedef enum
{
    GPIO_AF_0 = 0,
    GPIO_AF_1,
    GPIO_AF_2,
    GPIO_AF_3,
    GPIO_AF_4,
    GPIO_AF_5,
    GPIO_AF_6,
    GPIO_AF_7,
    GPIO_AF_8,
    GPIO_AF_9,
    GPIO_AF_10,
}GPIO_AF_DEF;

//! ******************  Bit definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0          ((uint32)0x00000003)
#define GPIO_MODER_MODER0_0        ((uint32)0x00000001)
#define GPIO_MODER_MODER0_1        ((uint32)0x00000002)
#define GPIO_MODER_MODER1          ((uint32)0x0000000C)
#define GPIO_MODER_MODER1_0        ((uint32)0x00000004)
#define GPIO_MODER_MODER1_1        ((uint32)0x00000008)
#define GPIO_MODER_MODER2          ((uint32)0x00000030)
#define GPIO_MODER_MODER2_0        ((uint32)0x00000010)
#define GPIO_MODER_MODER2_1        ((uint32)0x00000020)
#define GPIO_MODER_MODER3          ((uint32)0x000000C0)
#define GPIO_MODER_MODER3_0        ((uint32)0x00000040)
#define GPIO_MODER_MODER3_1        ((uint32)0x00000080)
#define GPIO_MODER_MODER4          ((uint32)0x00000300)
#define GPIO_MODER_MODER4_0        ((uint32)0x00000100)
#define GPIO_MODER_MODER4_1        ((uint32)0x00000200)
#define GPIO_MODER_MODER5          ((uint32)0x00000C00)
#define GPIO_MODER_MODER5_0        ((uint32)0x00000400)
#define GPIO_MODER_MODER5_1        ((uint32)0x00000800)
#define GPIO_MODER_MODER6          ((uint32)0x00003000)
#define GPIO_MODER_MODER6_0        ((uint32)0x00001000)
#define GPIO_MODER_MODER6_1        ((uint32)0x00002000)
#define GPIO_MODER_MODER7          ((uint32)0x0000C000)
#define GPIO_MODER_MODER7_0        ((uint32)0x00004000)
#define GPIO_MODER_MODER7_1        ((uint32)0x00008000)
#define GPIO_MODER_MODER8          ((uint32)0x00030000)
#define GPIO_MODER_MODER8_0        ((uint32)0x00010000)
#define GPIO_MODER_MODER8_1        ((uint32)0x00020000)
#define GPIO_MODER_MODER9          ((uint32)0x000C0000)
#define GPIO_MODER_MODER9_0        ((uint32)0x00040000)
#define GPIO_MODER_MODER9_1        ((uint32)0x00080000)
#define GPIO_MODER_MODER10         ((uint32)0x00300000)
#define GPIO_MODER_MODER10_0       ((uint32)0x00100000)
#define GPIO_MODER_MODER10_1       ((uint32)0x00200000)
#define GPIO_MODER_MODER11         ((uint32)0x00C00000)
#define GPIO_MODER_MODER11_0       ((uint32)0x00400000)
#define GPIO_MODER_MODER11_1       ((uint32)0x00800000)
#define GPIO_MODER_MODER12         ((uint32)0x03000000)
#define GPIO_MODER_MODER12_0       ((uint32)0x01000000)
#define GPIO_MODER_MODER12_1       ((uint32)0x02000000)
#define GPIO_MODER_MODER13         ((uint32)0x0C000000)
#define GPIO_MODER_MODER13_0       ((uint32)0x04000000)
#define GPIO_MODER_MODER13_1       ((uint32)0x08000000)
#define GPIO_MODER_MODER14         ((uint32)0x30000000)
#define GPIO_MODER_MODER14_0       ((uint32)0x10000000)
#define GPIO_MODER_MODER14_1       ((uint32)0x20000000)
#define GPIO_MODER_MODER15         ((uint32)0xC0000000U)
#define GPIO_MODER_MODER15_0       ((uint32)0x40000000)
#define GPIO_MODER_MODER15_1       ((uint32)0x80000000U)

//! *****************  Bit definition for GPIO_OTYPER register  *****************/
#define GPIO_OTYPER_OT_0           ((uint32)0x00000001)
#define GPIO_OTYPER_OT_1           ((uint32)0x00000002)
#define GPIO_OTYPER_OT_2           ((uint32)0x00000004)
#define GPIO_OTYPER_OT_3           ((uint32)0x00000008)
#define GPIO_OTYPER_OT_4           ((uint32)0x00000010)
#define GPIO_OTYPER_OT_5           ((uint32)0x00000020)
#define GPIO_OTYPER_OT_6           ((uint32)0x00000040)
#define GPIO_OTYPER_OT_7           ((uint32)0x00000080)
#define GPIO_OTYPER_OT_8           ((uint32)0x00000100)
#define GPIO_OTYPER_OT_9           ((uint32)0x00000200)
#define GPIO_OTYPER_OT_10          ((uint32)0x00000400)
#define GPIO_OTYPER_OT_11          ((uint32)0x00000800)
#define GPIO_OTYPER_OT_12          ((uint32)0x00001000)
#define GPIO_OTYPER_OT_13          ((uint32)0x00002000)
#define GPIO_OTYPER_OT_14          ((uint32)0x00004000)
#define GPIO_OTYPER_OT_15          ((uint32)0x00008000)

//! ***************  Bit definition for GPIO_OSPEEDR register  ******************/
#define GPIO_OSPEEDER_50MHZ_SPEED_ALL  (uint32)0xFFFFFFFFU

#define GPIO_OSPEEDER_OSPEEDR0     ((uint32)0x00000003)
#define GPIO_OSPEEDER_OSPEEDR0_0   ((uint32)0x00000001)
#define GPIO_OSPEEDER_OSPEEDR0_1   ((uint32)0x00000002)
#define GPIO_OSPEEDER_OSPEEDR1     ((uint32)0x0000000C)
#define GPIO_OSPEEDER_OSPEEDR1_0   ((uint32)0x00000004)
#define GPIO_OSPEEDER_OSPEEDR1_1   ((uint32)0x00000008)
#define GPIO_OSPEEDER_OSPEEDR2     ((uint32)0x00000030)
#define GPIO_OSPEEDER_OSPEEDR2_0   ((uint32)0x00000010)
#define GPIO_OSPEEDER_OSPEEDR2_1   ((uint32)0x00000020)
#define GPIO_OSPEEDER_OSPEEDR3     ((uint32)0x000000C0)
#define GPIO_OSPEEDER_OSPEEDR3_0   ((uint32)0x00000040)
#define GPIO_OSPEEDER_OSPEEDR3_1   ((uint32)0x00000080)
#define GPIO_OSPEEDER_OSPEEDR4     ((uint32)0x00000300)
#define GPIO_OSPEEDER_OSPEEDR4_0   ((uint32)0x00000100)
#define GPIO_OSPEEDER_OSPEEDR4_1   ((uint32)0x00000200)
#define GPIO_OSPEEDER_OSPEEDR5     ((uint32)0x00000C00)
#define GPIO_OSPEEDER_OSPEEDR5_0   ((uint32)0x00000400)
#define GPIO_OSPEEDER_OSPEEDR5_1   ((uint32)0x00000800)
#define GPIO_OSPEEDER_OSPEEDR6     ((uint32)0x00003000)
#define GPIO_OSPEEDER_OSPEEDR6_0   ((uint32)0x00001000)
#define GPIO_OSPEEDER_OSPEEDR6_1   ((uint32)0x00002000)
#define GPIO_OSPEEDER_OSPEEDR7     ((uint32)0x0000C000)
#define GPIO_OSPEEDER_OSPEEDR7_0   ((uint32)0x00004000)
#define GPIO_OSPEEDER_OSPEEDR7_1   ((uint32)0x00008000)
#define GPIO_OSPEEDER_OSPEEDR8     ((uint32)0x00030000)
#define GPIO_OSPEEDER_OSPEEDR8_0   ((uint32)0x00010000)
#define GPIO_OSPEEDER_OSPEEDR8_1   ((uint32)0x00020000)
#define GPIO_OSPEEDER_OSPEEDR9     ((uint32)0x000C0000)
#define GPIO_OSPEEDER_OSPEEDR9_0   ((uint32)0x00040000)
#define GPIO_OSPEEDER_OSPEEDR9_1   ((uint32)0x00080000)
#define GPIO_OSPEEDER_OSPEEDR10    ((uint32)0x00300000)
#define GPIO_OSPEEDER_OSPEEDR10_0  ((uint32)0x00100000)
#define GPIO_OSPEEDER_OSPEEDR10_1  ((uint32)0x00200000)
#define GPIO_OSPEEDER_OSPEEDR11    ((uint32)0x00C00000)
#define GPIO_OSPEEDER_OSPEEDR11_0  ((uint32)0x00400000)
#define GPIO_OSPEEDER_OSPEEDR11_1  ((uint32)0x00800000)
#define GPIO_OSPEEDER_OSPEEDR12    ((uint32)0x03000000)
#define GPIO_OSPEEDER_OSPEEDR12_0  ((uint32)0x01000000)
#define GPIO_OSPEEDER_OSPEEDR12_1  ((uint32)0x02000000)
#define GPIO_OSPEEDER_OSPEEDR13    ((uint32)0x0C000000)
#define GPIO_OSPEEDER_OSPEEDR13_0  ((uint32)0x04000000)
#define GPIO_OSPEEDER_OSPEEDR13_1  ((uint32)0x08000000)
#define GPIO_OSPEEDER_OSPEEDR14    ((uint32)0x30000000)
#define GPIO_OSPEEDER_OSPEEDR14_0  ((uint32)0x10000000)
#define GPIO_OSPEEDER_OSPEEDR14_1  ((uint32)0x20000000)
#define GPIO_OSPEEDER_OSPEEDR15    ((uint32)0xC0000000U)
#define GPIO_OSPEEDER_OSPEEDR15_0  ((uint32)0x40000000)
#define GPIO_OSPEEDER_OSPEEDR15_1  ((uint32)0x80000000U)

