ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//! ******************  Bit definition for GPIO_PUPDR register ******************/
#define GPIO_PUPDR_PUPDR0          ((uint32)0x00000003)
#define GPIO_PUPDR_PUPDR0_0        ((uint32)0x00000001)
#define GPIO_PUPDR_PUPDR0_1        ((uint32)0x00000002)
#define GPIO_PUPDR_PUPDR1          ((uint32)0x0000000C)
#define GPIO_PUPDR_PUPDR1_0        ((uint32)0x00000004)
#define GPIO_PUPDR_PUPDR1_1        ((uint32)0x00000008)
#define GPIO_PUPDR_PUPDR2          ((uint32)0x00000030)
#define GPIO_PUPDR_PUPDR2_0        ((uint32)0x00000010)
#define GPIO_PUPDR_PUPDR2_1        ((uint32)0x00000020)
#define GPIO_PUPDR_PUPDR3          ((uint32)0x000000C0)
#define GPIO_PUPDR_PUPDR3_0        ((uint32)0x00000040)
#define GPIO_PUPDR_PUPDR3_1        ((uint32)0x00000080)
#define GPIO_PUPDR_PUPDR4          ((uint32)0x00000300)
#define GPIO_PUPDR_PUPDR4_0        ((uint32)0x00000100)
#define GPIO_PUPDR_PUPDR4_1        ((uint32)0x00000200)
#define GPIO_PUPDR_PUPDR5          ((uint32)0x00000C00)
#define GPIO_PUPDR_PUPDR5_0        ((uint32)0x00000400)
#define GPIO_PUPDR_PUPDR5_1        ((uint32)0x00000800)
#define GPIO_PUPDR_PUPDR6          ((uint32)0x00003000)
#define GPIO_PUPDR_PUPDR6_0        ((uint32)0x00001000)
#define GPIO_PUPDR_PUPDR6_1        ((uint32)0x00002000)
#define GPIO_PUPDR_PUPDR7          ((uint32)0x0000C000)
#define GPIO_PUPDR_PUPDR7_0        ((uint32)0x00004000)
#define GPIO_PUPDR_PUPDR7_1        ((uint32)0x00008000)
#define GPIO_PUPDR_PUPDR8          ((uint32)0x00030000)
#define GPIO_PUPDR_PUPDR8_0        ((uint32)0x00010000)
#define GPIO_PUPDR_PUPDR8_1        ((uint32)0x00020000)
#define GPIO_PUPDR_PUPDR9          ((uint32)0x000C0000)
#define GPIO_PUPDR_PUPDR9_0        ((uint32)0x00040000)
#define GPIO_PUPDR_PUPDR9_1        ((uint32)0x00080000)
#define GPIO_PUPDR_PUPDR10         ((uint32)0x00300000)
#define GPIO_PUPDR_PUPDR10_0       ((uint32)0x00100000)
#define GPIO_PUPDR_PUPDR10_1       ((uint32)0x00200000)
#define GPIO_PUPDR_PUPDR11         ((uint32)0x00C00000)
#define GPIO_PUPDR_PUPDR11_0       ((uint32)0x00400000)
#define GPIO_PUPDR_PUPDR11_1       ((uint32)0x00800000)
#define GPIO_PUPDR_PUPDR12         ((uint32)0x03000000)
#define GPIO_PUPDR_PUPDR12_0       ((uint32)0x01000000)
#define GPIO_PUPDR_PUPDR12_1       ((uint32)0x02000000)
#define GPIO_PUPDR_PUPDR13         ((uint32)0x0C000000)
#define GPIO_PUPDR_PUPDR13_0       ((uint32)0x04000000)
#define GPIO_PUPDR_PUPDR13_1       ((uint32)0x08000000)
#define GPIO_PUPDR_PUPDR14         ((uint32)0x30000000)
#define GPIO_PUPDR_PUPDR14_0       ((uint32)0x10000000)
#define GPIO_PUPDR_PUPDR14_1       ((uint32)0x20000000)
#define GPIO_PUPDR_PUPDR15         ((uint32)0xC0000000U)
#define GPIO_PUPDR_PUPDR15_0       ((uint32)0x40000000)
#define GPIO_PUPDR_PUPDR15_1       ((uint32)0x80000000U)

//! ******************  Bit definition for GPIO_IDR register  *******************/
#define GPIO_IDR_0                 ((uint32)0x00000001)
#define GPIO_IDR_1                 ((uint32)0x00000002)
#define GPIO_IDR_2                 ((uint32)0x00000004)
#define GPIO_IDR_3                 ((uint32)0x00000008)
#define GPIO_IDR_4                 ((uint32)0x00000010)
#define GPIO_IDR_5                 ((uint32)0x00000020)
#define GPIO_IDR_6                 ((uint32)0x00000040)
#define GPIO_IDR_7                 ((uint32)0x00000080)
#define GPIO_IDR_8                 ((uint32)0x00000100)
#define GPIO_IDR_9                 ((uint32)0x00000200)
#define GPIO_IDR_10                ((uint32)0x00000400)
#define GPIO_IDR_11                ((uint32)0x00000800)
#define GPIO_IDR_12                ((uint32)0x00001000)
#define GPIO_IDR_13                ((uint32)0x00002000)
#define GPIO_IDR_14                ((uint32)0x00004000)
#define GPIO_IDR_15                ((uint32)0x00008000)

//! *****************  Bit definition for GPIO_ODR register  ********************/
#define GPIO_ODR_0                 ((uint32)0x00000001)
#define GPIO_ODR_1                 ((uint32)0x00000002)
#define GPIO_ODR_2                 ((uint32)0x00000004)
#define GPIO_ODR_3                 ((uint32)0x00000008)
#define GPIO_ODR_4                 ((uint32)0x00000010)
#define GPIO_ODR_5                 ((uint32)0x00000020)
#define GPIO_ODR_6                 ((uint32)0x00000040)
#define GPIO_ODR_7                 ((uint32)0x00000080)
#define GPIO_ODR_8                 ((uint32)0x00000100)
#define GPIO_ODR_9                 ((uint32)0x00000200)
#define GPIO_ODR_10                ((uint32)0x00000400)
#define GPIO_ODR_11                ((uint32)0x00000800)
#define GPIO_ODR_12                ((uint32)0x00001000)
#define GPIO_ODR_13                ((uint32)0x00002000)
#define GPIO_ODR_14                ((uint32)0x00004000)
#define GPIO_ODR_15                ((uint32)0x00008000)

//! ***************** Bit definition for GPIO_BSRR register  ********************/
#define GPIO_BSRR_BS_0             ((uint32)0x00000001)
#define GPIO_BSRR_BS_1             ((uint32)0x00000002)
#define GPIO_BSRR_BS_2             ((uint32)0x00000004)
#define GPIO_BSRR_BS_3             ((uint32)0x00000008)
#define GPIO_BSRR_BS_4             ((uint32)0x00000010)
#define GPIO_BSRR_BS_5             ((uint32)0x00000020)
#define GPIO_BSRR_BS_6             ((uint32)0x00000040)
#define GPIO_BSRR_BS_7             ((uint32)0x00000080)
#define GPIO_BSRR_BS_8             ((uint32)0x00000100)
#define GPIO_BSRR_BS_9             ((uint32)0x00000200)
#define GPIO_BSRR_BS_10            ((uint32)0x00000400)
#define GPIO_BSRR_BS_11            ((uint32)0x00000800)
#define GPIO_BSRR_BS_12            ((uint32)0x00001000)
#define GPIO_BSRR_BS_13            ((uint32)0x00002000)
#define GPIO_BSRR_BS_14            ((uint32)0x00004000)
#define GPIO_BSRR_BS_15            ((uint32)0x00008000)
#define GPIO_BSRR_BR_0             ((uint32)0x00010000)
#define GPIO_BSRR_BR_1             ((uint32)0x00020000)
#define GPIO_BSRR_BR_2             ((uint32)0x00040000)
#define GPIO_BSRR_BR_3             ((uint32)0x00080000)
#define GPIO_BSRR_BR_4             ((uint32)0x00100000)
#define GPIO_BSRR_BR_5             ((uint32)0x00200000)
#define GPIO_BSRR_BR_6             ((uint32)0x00400000)
#define GPIO_BSRR_BR_7             ((uint32)0x00800000)
#define GPIO_BSRR_BR_8             ((uint32)0x01000000)
#define GPIO_BSRR_BR_9             ((uint32)0x02000000)
#define GPIO_BSRR_BR_10            ((uint32)0x04000000)
#define GPIO_BSRR_BR_11            ((uint32)0x08000000)
#define GPIO_BSRR_BR_12            ((uint32)0x10000000)
#define GPIO_BSRR_BR_13            ((uint32)0x20000000)
#define GPIO_BSRR_BR_14            ((uint32)0x40000000)
#define GPIO_BSRR_BR_15            ((uint32)0x80000000U)

//! ***************** Bit definition for GPIO_LCKR register  ********************/
#define GPIO_LCKR_LCK0             ((uint32)0x00000001)
#define GPIO_LCKR_LCK1             ((uint32)0x00000002)
#define GPIO_LCKR_LCK2             ((uint32)0x00000004)
#define GPIO_LCKR_LCK3             ((uint32)0x00000008)
#define GPIO_LCKR_LCK4             ((uint32)0x00000010)
#define GPIO_LCKR_LCK5             ((uint32)0x00000020)
#define GPIO_LCKR_LCK6             ((uint32)0x00000040)
#define GPIO_LCKR_LCK7             ((uint32)0x00000080)
#define GPIO_LCKR_LCK8             ((uint32)0x00000100)
#define GPIO_LCKR_LCK9             ((uint32)0x00000200)
#define GPIO_LCKR_LCK10            ((uint32)0x00000400)
#define GPIO_LCKR_LCK11            ((uint32)0x00000800)
#define GPIO_LCKR_LCK12            ((uint32)0x00001000)
#define GPIO_LCKR_LCK13            ((uint32)0x00002000)
#define GPIO_LCKR_LCK14            ((uint32)0x00004000)
#define GPIO_LCKR_LCK15            ((uint32)0x00008000)
#define GPIO_LCKR_LCKK             ((uint32)0x00010000)

//! ***************** Bit definition for GPIO_AFRL register  ********************/
#define GPIO_AFRL_AFRL0            ((uint32)0x0000000F)
#define GPIO_AFRL_AFRL1            ((uint32)0x000000F0)
#define GPIO_AFRL_AFRL2            ((uint32)0x00000F00)
#define GPIO_AFRL_AFRL3            ((uint32)0x0000F000)
#define GPIO_AFRL_AFRL4            ((uint32)0x000F0000)
#define GPIO_AFRL_AFRL5            ((uint32)0x00F00000)
#define GPIO_AFRL_AFRL6            ((uint32)0x0F000000)
#define GPIO_AFRL_AFRL7            ((uint32)0xF0000000U)

//! ***************** Bit definition for GPIO_AFRH register  ********************/
#define GPIO_AFRH_AFRH0            ((uint32)0x0000000F)
#define GPIO_AFRH_AFRH1            ((uint32)0x000000F0)
#define GPIO_AFRH_AFRH2            ((uint32)0x00000F00)
#define GPIO_AFRH_AFRH3            ((uint32)0x0000F000)
#define GPIO_AFRH_AFRH4            ((uint32)0x000F0000)
#define GPIO_AFRH_AFRH5            ((uint32)0x00F00000)
#define GPIO_AFRH_AFRH6            ((uint32)0x0F000000)
#define GPIO_AFRH_AFRH7            ((uint32)0xF0000000U)

//! ***************** Bit definition for GPIO_BRR register  *********************/
#define GPIO_BRR_BR_0              ((uint32)0x00000001)
#define GPIO_BRR_BR_1              ((uint32)0x00000002)
#define GPIO_BRR_BR_2              ((uint32)0x00000004)
#define GPIO_BRR_BR_3              ((uint32)0x00000008)
#define GPIO_BRR_BR_4              ((uint32)0x00000010)
#define GPIO_BRR_BR_5              ((uint32)0x00000020)
#define GPIO_BRR_BR_6              ((uint32)0x00000040)
#define GPIO_BRR_BR_7              ((uint32)0x00000080)
#define GPIO_BRR_BR_8              ((uint32)0x00000100)
#define GPIO_BRR_BR_9              ((uint32)0x00000200)
#define GPIO_BRR_BR_10             ((uint32)0x00000400)
#define GPIO_BRR_BR_11             ((uint32)0x00000800)
#define GPIO_BRR_BR_12             ((uint32)0x00001000)
#define GPIO_BRR_BR_13             ((uint32)0x00002000)
#define GPIO_BRR_BR_14             ((uint32)0x00004000)
#define GPIO_BRR_BR_15             ((uint32)0x00008000)





