ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- ADC --------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------

/**
 * @brief Analog to Digital Converter (ADC)
 */
typedef struct
{
  volatile uint32 ISR;          /*!< ADC interrupt and status register,             Address offset: 0x00 */
  volatile uint32 IER;          /*!< ADC interrupt enable register,                 Address offset: 0x04 */
  volatile uint32 CR;           /*!< ADC control register,                          Address offset: 0x08 */
  volatile uint32 CFGR1;        /*!< ADC configuration register 1,                  Address offset: 0x0C */
  volatile uint32 CFGR2;        /*!< ADC configuration register 2,                  Address offset: 0x10 */
  volatile uint32 SMPR;         /*!< ADC sampling time register,                    Address offset: 0x14 */
       uint32 RESERVED1;    /*!< Reserved,                                                      0x18 */
       uint32 RESERVED2;    /*!< Reserved,                                                      0x1C */
  volatile uint32 TR1;          /*!< ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
  volatile uint32 TR2;          /*!< ADC analog watchdog 2 threshold register,      Address offset: 0x24 */
  volatile uint32 CHSELR;       /*!< ADC group regular sequencer register,          Address offset: 0x28 */
  volatile uint32 TR3;          /*!< ADC analog watchdog 3 threshold register,      Address offset: 0x2C */
       uint32 RESERVED3[4]; /*!< Reserved,                                               0x30 - 0x3C */
  volatile uint32 DR;           /*!< ADC group regular data register,               Address offset: 0x40 */
       uint32 RESERVED4[23];/*!< Reserved,                                               0x44 - 0x9C */
  volatile uint32 AWD2CR;       /*!< ADC analog watchdog 2 configuration register,  Address offset: 0xA0 */
  volatile uint32 AWD3CR;       /*!< ADC analog watchdog 3 configuration register,  Address offset: 0xA4 */
       uint32 RESERVED5[3]; /*!< Reserved,                                               0xA8 - 0xB0 */
  volatile uint32 CALFACT;      /*!< ADC Calibration factor register,               Address offset: 0xB4 */
} ADC_TYPEDEF;

typedef struct
{
  volatile uint32 CCR;          /*!< ADC common configuration register,             Address offset: ADC1 base address + 0x308 */
} ADC_COMMON_TYPEDEF;

#define ADC1_COMMON         (*(ADC_COMMON_TYPEDEF *) ADC1_COMMON_BASE)
#define ADC                 (ADC1_COMMON) /* Kept for legacy purpose */
#define ADC1                (*(ADC_TYPEDEF *) ADC1_BASE)


/********************  Bit definition for ADC_ISR register  *******************/
#define ADC_ISR_ADRDY_POS              (0U)
#define ADC_ISR_ADRDY_MSK              (0x1UL << ADC_ISR_ADRDY_POS)            /*!< 0x00000001 */
#define ADC_ISR_ADRDY                  ADC_ISR_ADRDY_MSK                       /*!< ADC ready flag */
#define ADC_ISR_EOSMP_POS              (1U)
#define ADC_ISR_EOSMP_MSK              (0x1UL << ADC_ISR_EOSMP_POS)            /*!< 0x00000002 */
#define ADC_ISR_EOSMP                  ADC_ISR_EOSMP_MSK                       /*!< ADC group regular end of sampling flag */
#define ADC_ISR_EOC_POS                (2U)
#define ADC_ISR_EOC_MSK                (0x1UL << ADC_ISR_EOC_POS)              /*!< 0x00000004 */
#define ADC_ISR_EOC                    ADC_ISR_EOC_MSK                         /*!< ADC group regular end of unitary conversion flag */
#define ADC_ISR_EOS_POS                (3U)
#define ADC_ISR_EOS_MSK                (0x1UL << ADC_ISR_EOS_POS)              /*!< 0x00000008 */
#define ADC_ISR_EOS                    ADC_ISR_EOS_MSK                         /*!< ADC group regular end of sequence conversions flag */
#define ADC_ISR_OVR_POS                (4U)
#define ADC_ISR_OVR_MSK                (0x1UL << ADC_ISR_OVR_POS)              /*!< 0x00000010 */
#define ADC_ISR_OVR                    ADC_ISR_OVR_MSK                         /*!< ADC group regular overrun flag */
#define ADC_ISR_AWD1_POS               (7U)
#define ADC_ISR_AWD1_MSK               (0x1UL << ADC_ISR_AWD1_POS)             /*!< 0x00000080 */
#define ADC_ISR_AWD1                   ADC_ISR_AWD1_MSK                        /*!< ADC analog watchdog 1 flag */
#define ADC_ISR_AWD2_POS               (8U)
#define ADC_ISR_AWD2_MSK               (0x1UL << ADC_ISR_AWD2_POS)             /*!< 0x00000100 */
#define ADC_ISR_AWD2                   ADC_ISR_AWD2_MSK                        /*!< ADC analog watchdog 2 flag */
#define ADC_ISR_AWD3_POS               (9U)
#define ADC_ISR_AWD3_MSK               (0x1UL << ADC_ISR_AWD3_POS)             /*!< 0x00000200 */
#define ADC_ISR_AWD3                   ADC_ISR_AWD3_MSK                        /*!< ADC analog watchdog 3 flag */
#define ADC_ISR_EOCAL_POS              (11U)
#define ADC_ISR_EOCAL_MSK              (0x1UL << ADC_ISR_EOCAL_POS)            /*!< 0x00000800 */
#define ADC_ISR_EOCAL                  ADC_ISR_EOCAL_MSK                       /*!< ADC end of calibration flag */
#define ADC_ISR_CCRDY_POS              (13U)
#define ADC_ISR_CCRDY_MSK              (0x1UL << ADC_ISR_CCRDY_POS)            /*!< 0x00002000 */
#define ADC_ISR_CCRDY                  ADC_ISR_CCRDY_MSK                       /*!< ADC channel configuration ready flag */

/* Legacy defines */
#define ADC_ISR_EOSEQ           (ADC_ISR_EOS)

/********************  Bit definition for ADC_IER register  *******************/
#define ADC_IER_ADRDYIE_POS            (0U)
#define ADC_IER_ADRDYIE_MSK            (0x1UL << ADC_IER_ADRDYIE_POS)          /*!< 0x00000001 */
#define ADC_IER_ADRDYIE                ADC_IER_ADRDYIE_MSK                     /*!< ADC ready interrupt */
#define ADC_IER_EOSMPIE_POS            (1U)
#define ADC_IER_EOSMPIE_MSK            (0x1UL << ADC_IER_EOSMPIE_POS)          /*!< 0x00000002 */
#define ADC_IER_EOSMPIE                ADC_IER_EOSMPIE_MSK                     /*!< ADC group regular end of sampling interrupt */
#define ADC_IER_EOCIE_POS              (2U)
#define ADC_IER_EOCIE_MSK              (0x1UL << ADC_IER_EOCIE_POS)            /*!< 0x00000004 */
#define ADC_IER_EOCIE                  ADC_IER_EOCIE_MSK                       /*!< ADC group regular end of unitary conversion interrupt */
#define ADC_IER_EOSIE_POS              (3U)
#define ADC_IER_EOSIE_MSK              (0x1UL << ADC_IER_EOSIE_POS)            /*!< 0x00000008 */
#define ADC_IER_EOSIE                  ADC_IER_EOSIE_MSK                       /*!< ADC group regular end of sequence conversions interrupt */
#define ADC_IER_OVRIE_POS              (4U)
#define ADC_IER_OVRIE_MSK              (0x1UL << ADC_IER_OVRIE_POS)            /*!< 0x00000010 */
#define ADC_IER_OVRIE                  ADC_IER_OVRIE_MSK                       /*!< ADC group regular overrun interrupt */
#define ADC_IER_AWD1IE_POS             (7U)
#define ADC_IER_AWD1IE_MSK             (0x1UL << ADC_IER_AWD1IE_POS)           /*!< 0x00000080 */
#define ADC_IER_AWD1IE                 ADC_IER_AWD1IE_MSK                      /*!< ADC analog watchdog 1 interrupt */
#define ADC_IER_AWD2IE_POS             (8U)
#define ADC_IER_AWD2IE_MSK             (0x1UL << ADC_IER_AWD2IE_POS)           /*!< 0x00000100 */
#define ADC_IER_AWD2IE                 ADC_IER_AWD2IE_MSK                      /*!< ADC analog watchdog 2 interrupt */
#define ADC_IER_AWD3IE_POS             (9U)
#define ADC_IER_AWD3IE_MSK             (0x1UL << ADC_IER_AWD3IE_POS)           /*!< 0x00000200 */
#define ADC_IER_AWD3IE                 ADC_IER_AWD3IE_MSK                      /*!< ADC analog watchdog 3 interrupt */
#define ADC_IER_EOCALIE_POS            (11U)
#define ADC_IER_EOCALIE_MSK            (0x1UL << ADC_IER_EOCALIE_POS)          /*!< 0x00000800 */
#define ADC_IER_EOCALIE                ADC_IER_EOCALIE_MSK                     /*!< ADC end of calibration interrupt */
#define ADC_IER_CCRDYIE_POS            (13U)
#define ADC_IER_CCRDYIE_MSK            (0x1UL << ADC_IER_CCRDYIE_POS)          /*!< 0x00002000 */
#define ADC_IER_CCRDYIE                ADC_IER_CCRDYIE_MSK                     /*!< ADC channel configuration ready interrupt */

