ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/* Legacy defines */
#define ADC_IER_EOSEQIE           (ADC_IER_EOSIE)

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN_POS                (0U)
#define ADC_CR_ADEN_MSK                (0x1UL << ADC_CR_ADEN_POS)              /*!< 0x00000001 */
#define ADC_CR_ADEN                    ADC_CR_ADEN_MSK                         /*!< ADC enable */
#define ADC_CR_ADDIS_POS               (1U)
#define ADC_CR_ADDIS_MSK               (0x1UL << ADC_CR_ADDIS_POS)             /*!< 0x00000002 */
#define ADC_CR_ADDIS                   ADC_CR_ADDIS_MSK                        /*!< ADC disable */
#define ADC_CR_ADSTART_POS             (2U)
#define ADC_CR_ADSTART_MSK             (0x1UL << ADC_CR_ADSTART_POS)           /*!< 0x00000004 */
#define ADC_CR_ADSTART                 ADC_CR_ADSTART_MSK                      /*!< ADC group regular conversion start */
#define ADC_CR_ADSTP_POS               (4U)
#define ADC_CR_ADSTP_MSK               (0x1UL << ADC_CR_ADSTP_POS)             /*!< 0x00000010 */
#define ADC_CR_ADSTP                   ADC_CR_ADSTP_MSK                        /*!< ADC group regular conversion stop */
#define ADC_CR_ADVREGEN_POS            (28U)
#define ADC_CR_ADVREGEN_MSK            (0x1UL << ADC_CR_ADVREGEN_POS)          /*!< 0x10000000 */
#define ADC_CR_ADVREGEN                ADC_CR_ADVREGEN_MSK                     /*!< ADC voltage regulator enable */
#define ADC_CR_ADCAL_POS               (31U)
#define ADC_CR_ADCAL_MSK               (0x1UL << ADC_CR_ADCAL_POS)             /*!< 0x80000000 */
#define ADC_CR_ADCAL                   ADC_CR_ADCAL_MSK                        /*!< ADC calibration */

/********************  Bit definition for ADC_CFGR1 register  *****************/
#define ADC_CFGR1_DMAEN_POS            (0U)
#define ADC_CFGR1_DMAEN_MSK            (0x1UL << ADC_CFGR1_DMAEN_POS)          /*!< 0x00000001 */
#define ADC_CFGR1_DMAEN                ADC_CFGR1_DMAEN_MSK                     /*!< ADC DMA transfer enable */
#define ADC_CFGR1_DMACFG_POS           (1U)
#define ADC_CFGR1_DMACFG_MSK           (0x1UL << ADC_CFGR1_DMACFG_POS)         /*!< 0x00000002 */
#define ADC_CFGR1_DMACFG               ADC_CFGR1_DMACFG_MSK                    /*!< ADC DMA transfer configuration */

#define ADC_CFGR1_SCANDIR_POS          (2U)
#define ADC_CFGR1_SCANDIR_MSK          (0x1UL << ADC_CFGR1_SCANDIR_POS)        /*!< 0x00000004 */
#define ADC_CFGR1_SCANDIR              ADC_CFGR1_SCANDIR_MSK                   /*!< ADC group regular sequencer scan direction */

#define ADC_CFGR1_RES_POS              (3U)
#define ADC_CFGR1_RES_MSK              (0x3UL << ADC_CFGR1_RES_POS)            /*!< 0x00000018 */
#define ADC_CFGR1_RES                  ADC_CFGR1_RES_MSK                       /*!< ADC data resolution */
#define ADC_CFGR1_RES_0                (0x1U << ADC_CFGR1_RES_POS)             /*!< 0x00000008 */
#define ADC_CFGR1_RES_1                (0x2U << ADC_CFGR1_RES_POS)             /*!< 0x00000010 */

#define ADC_CFGR1_ALIGN_POS            (5U)
#define ADC_CFGR1_ALIGN_MSK            (0x1UL << ADC_CFGR1_ALIGN_POS)          /*!< 0x00000020 */
#define ADC_CFGR1_ALIGN                ADC_CFGR1_ALIGN_MSK                     /*!< ADC data alignement */

#define ADC_CFGR1_EXTSEL_POS           (6U)
#define ADC_CFGR1_EXTSEL_MSK           (0x7UL << ADC_CFGR1_EXTSEL_POS)         /*!< 0x000001C0 */
#define ADC_CFGR1_EXTSEL               ADC_CFGR1_EXTSEL_MSK                    /*!< ADC group regular external trigger source */
#define ADC_CFGR1_EXTSEL_0             (0x1UL << ADC_CFGR1_EXTSEL_POS)         /*!< 0x00000040 */
#define ADC_CFGR1_EXTSEL_1             (0x2UL << ADC_CFGR1_EXTSEL_POS)         /*!< 0x00000080 */
#define ADC_CFGR1_EXTSEL_2             (0x4UL << ADC_CFGR1_EXTSEL_POS)         /*!< 0x00000100 */

#define ADC_CFGR1_EXTEN_POS            (10U)
#define ADC_CFGR1_EXTEN_MSK            (0x3UL << ADC_CFGR1_EXTEN_POS)          /*!< 0x00000C00 */
#define ADC_CFGR1_EXTEN                ADC_CFGR1_EXTEN_MSK                     /*!< ADC group regular external trigger polarity */
#define ADC_CFGR1_EXTEN_0              (0x1UL << ADC_CFGR1_EXTEN_POS)          /*!< 0x00000400 */
#define ADC_CFGR1_EXTEN_1              (0x2UL << ADC_CFGR1_EXTEN_POS)          /*!< 0x00000800 */

#define ADC_CFGR1_OVRMOD_POS           (12U)
#define ADC_CFGR1_OVRMOD_MSK           (0x1UL << ADC_CFGR1_OVRMOD_POS)         /*!< 0x00001000 */
#define ADC_CFGR1_OVRMOD               ADC_CFGR1_OVRMOD_MSK                    /*!< ADC group regular overrun configuration */
#define ADC_CFGR1_CONT_POS             (13U)
#define ADC_CFGR1_CONT_MSK             (0x1UL << ADC_CFGR1_CONT_POS)           /*!< 0x00002000 */
#define ADC_CFGR1_CONT                 ADC_CFGR1_CONT_MSK                      /*!< ADC group regular continuous conversion mode */
#define ADC_CFGR1_WAIT_POS             (14U)
#define ADC_CFGR1_WAIT_MSK             (0x1UL << ADC_CFGR1_WAIT_POS)           /*!< 0x00004000 */
#define ADC_CFGR1_WAIT                 ADC_CFGR1_WAIT_MSK                      /*!< ADC low power auto wait */
#define ADC_CFGR1_AUTOFF_POS           (15U)
#define ADC_CFGR1_AUTOFF_MSK           (0x1UL << ADC_CFGR1_AUTOFF_POS)         /*!< 0x00008000 */
#define ADC_CFGR1_AUTOFF               ADC_CFGR1_AUTOFF_MSK                    /*!< ADC low power auto power off */
#define ADC_CFGR1_DISCEN_POS           (16U)
#define ADC_CFGR1_DISCEN_MSK           (0x1UL << ADC_CFGR1_DISCEN_POS)         /*!< 0x00010000 */
#define ADC_CFGR1_DISCEN               ADC_CFGR1_DISCEN_MSK                    /*!< ADC group regular sequencer discontinuous mode */
#define ADC_CFGR1_CHSELRMOD_POS        (21U)
#define ADC_CFGR1_CHSELRMOD_MSK        (0x1UL << ADC_CFGR1_CHSELRMOD_POS)      /*!< 0x00200000 */
#define ADC_CFGR1_CHSELRMOD            ADC_CFGR1_CHSELRMOD_MSK                 /*!< ADC group regular sequencer mode */

#define ADC_CFGR1_AWD1SGL_POS          (22U)
#define ADC_CFGR1_AWD1SGL_MSK          (0x1UL << ADC_CFGR1_AWD1SGL_POS)        /*!< 0x00400000 */
#define ADC_CFGR1_AWD1SGL              ADC_CFGR1_AWD1SGL_MSK                   /*!< ADC analog watchdog 1 monitoring a single channel or all channels */
#define ADC_CFGR1_AWD1EN_POS           (23U)
#define ADC_CFGR1_AWD1EN_MSK           (0x1UL << ADC_CFGR1_AWD1EN_POS)         /*!< 0x00800000 */
#define ADC_CFGR1_AWD1EN               ADC_CFGR1_AWD1EN_MSK                    /*!< ADC analog watchdog 1 enable on scope ADC group regular */

#define ADC_CFGR1_AWD1CH_POS           (26U)
#define ADC_CFGR1_AWD1CH_MSK           (0x1FUL << ADC_CFGR1_AWD1CH_POS)        /*!< 0x7C000000 */
#define ADC_CFGR1_AWD1CH               ADC_CFGR1_AWD1CH_MSK                    /*!< ADC analog watchdog 1 monitored channel selection */
#define ADC_CFGR1_AWD1CH_0             (0x01UL << ADC_CFGR1_AWD1CH_POS)        /*!< 0x04000000 */
#define ADC_CFGR1_AWD1CH_1             (0x02UL << ADC_CFGR1_AWD1CH_POS)        /*!< 0x08000000 */
#define ADC_CFGR1_AWD1CH_2             (0x04UL << ADC_CFGR1_AWD1CH_POS)        /*!< 0x10000000 */
#define ADC_CFGR1_AWD1CH_3             (0x08UL << ADC_CFGR1_AWD1CH_POS)        /*!< 0x20000000 */
#define ADC_CFGR1_AWD1CH_4             (0x10UL << ADC_CFGR1_AWD1CH_POS)        /*!< 0x40000000 */

