ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/* Legacy defines */
#define ADC_CFGR1_AUTDLY          (ADC_CFGR1_WAIT)

/********************  Bit definition for ADC_CFGR2 register  *****************/
#define ADC_CFGR2_OVSE_POS             (0U)
#define ADC_CFGR2_OVSE_MSK             (0x1UL << ADC_CFGR2_OVSE_POS)           /*!< 0x00000001 */
#define ADC_CFGR2_OVSE                 ADC_CFGR2_OVSE_MSK                      /*!< ADC oversampler enable on scope ADC group regular */

#define ADC_CFGR2_OVSR_POS             (2U)
#define ADC_CFGR2_OVSR_MSK             (0x7UL << ADC_CFGR2_OVSR_POS)           /*!< 0x0000001C */
#define ADC_CFGR2_OVSR                 ADC_CFGR2_OVSR_MSK                      /*!< ADC oversampling ratio */
#define ADC_CFGR2_OVSR_0               (0x1UL << ADC_CFGR2_OVSR_POS)           /*!< 0x00000004 */
#define ADC_CFGR2_OVSR_1               (0x2UL << ADC_CFGR2_OVSR_POS)           /*!< 0x00000008 */
#define ADC_CFGR2_OVSR_2               (0x4UL << ADC_CFGR2_OVSR_POS)           /*!< 0x00000010 */

#define ADC_CFGR2_OVSS_POS             (5U)
#define ADC_CFGR2_OVSS_MSK             (0xFUL << ADC_CFGR2_OVSS_POS)           /*!< 0x000001E0 */
#define ADC_CFGR2_OVSS                 ADC_CFGR2_OVSS_MSK                      /*!< ADC oversampling shift */
#define ADC_CFGR2_OVSS_0               (0x1UL << ADC_CFGR2_OVSS_POS)           /*!< 0x00000020 */
#define ADC_CFGR2_OVSS_1               (0x2UL << ADC_CFGR2_OVSS_POS)           /*!< 0x00000040 */
#define ADC_CFGR2_OVSS_2               (0x4UL << ADC_CFGR2_OVSS_POS)           /*!< 0x00000080 */
#define ADC_CFGR2_OVSS_3               (0x8UL << ADC_CFGR2_OVSS_POS)           /*!< 0x00000100 */

#define ADC_CFGR2_TOVS_POS             (9U)
#define ADC_CFGR2_TOVS_MSK             (0x1UL << ADC_CFGR2_TOVS_POS)           /*!< 0x00000200 */
#define ADC_CFGR2_TOVS                 ADC_CFGR2_TOVS_MSK                      /*!< ADC oversampling discontinuous mode (triggered mode) for ADC group regular */

#define ADC_CFGR2_LFTRIG_POS           (29U)
#define ADC_CFGR2_LFTRIG_MSK           (0x1UL << ADC_CFGR2_LFTRIG_POS)         /*!< 0x20000000 */
#define ADC_CFGR2_LFTRIG               ADC_CFGR2_LFTRIG_MSK                    /*!< ADC low frequency trigger mode */

#define ADC_CFGR2_CKMODE_POS           (30U)
#define ADC_CFGR2_CKMODE_MSK           (0x3UL << ADC_CFGR2_CKMODE_POS)         /*!< 0xC0000000 */
#define ADC_CFGR2_CKMODE               ADC_CFGR2_CKMODE_MSK                    /*!< ADC clock source and prescaler (prescaler only for clock source synchronous) */
#define ADC_CFGR2_CKMODE_1             (0x2UL << ADC_CFGR2_CKMODE_POS)         /*!< 0x80000000 */
#define ADC_CFGR2_CKMODE_0             (0x1UL << ADC_CFGR2_CKMODE_POS)         /*!< 0x40000000 */

/********************  Bit definition for ADC_SMPR register  ******************/
#define ADC_SMPR_SMP1_POS              (0U)
#define ADC_SMPR_SMP1_MSK              (0x7UL << ADC_SMPR_SMP1_POS)            /*!< 0x00000007 */
#define ADC_SMPR_SMP1                  ADC_SMPR_SMP1_MSK                       /*!< ADC group of channels sampling time 1 */
#define ADC_SMPR_SMP1_0                (0x1UL << ADC_SMPR_SMP1_POS)            /*!< 0x00000001 */
#define ADC_SMPR_SMP1_1                (0x2UL << ADC_SMPR_SMP1_POS)            /*!< 0x00000002 */
#define ADC_SMPR_SMP1_2                (0x4UL << ADC_SMPR_SMP1_POS)            /*!< 0x00000004 */

#define ADC_SMPR_SMP2_POS              (4U)
#define ADC_SMPR_SMP2_MSK              (0x7UL << ADC_SMPR_SMP2_POS)            /*!< 0x00000070 */
#define ADC_SMPR_SMP2                  ADC_SMPR_SMP2_MSK                       /*!< ADC group of channels sampling time 2 */
#define ADC_SMPR_SMP2_0                (0x1UL << ADC_SMPR_SMP2_POS)            /*!< 0x00000010 */
#define ADC_SMPR_SMP2_1                (0x2UL << ADC_SMPR_SMP2_POS)            /*!< 0x00000020 */
#define ADC_SMPR_SMP2_2                (0x4UL << ADC_SMPR_SMP2_POS)            /*!< 0x00000040 */

#define ADC_SMPR_SMPSEL_POS            (8U)
#define ADC_SMPR_SMPSEL_MSK            (0x7FFFFUL << ADC_SMPR_SMPSEL_POS)      /*!< 0x07FFFF00 */
#define ADC_SMPR_SMPSEL                ADC_SMPR_SMPSEL_MSK                     /*!< ADC all channels sampling time selection */
#define ADC_SMPR_SMPSEL0_POS           (8U)
#define ADC_SMPR_SMPSEL0_MSK           (0x1UL << ADC_SMPR_SMPSEL0_POS)         /*!< 0x00000100 */
#define ADC_SMPR_SMPSEL0               ADC_SMPR_SMPSEL0_MSK                    /*!< ADC channel 0 sampling time selection */
#define ADC_SMPR_SMPSEL1_POS           (9U)
#define ADC_SMPR_SMPSEL1_MSK           (0x1UL << ADC_SMPR_SMPSEL1_POS)         /*!< 0x00000200 */
#define ADC_SMPR_SMPSEL1               ADC_SMPR_SMPSEL1_MSK                    /*!< ADC channel 1 sampling time selection */
#define ADC_SMPR_SMPSEL2_POS           (10U)
#define ADC_SMPR_SMPSEL2_MSK           (0x1UL << ADC_SMPR_SMPSEL2_POS)         /*!< 0x00000400 */
#define ADC_SMPR_SMPSEL2               ADC_SMPR_SMPSEL2_MSK                    /*!< ADC channel 2 sampling time selection */
#define ADC_SMPR_SMPSEL3_POS           (11U)
#define ADC_SMPR_SMPSEL3_MSK           (0x1UL << ADC_SMPR_SMPSEL3_POS)         /*!< 0x00000800 */
#define ADC_SMPR_SMPSEL3               ADC_SMPR_SMPSEL3_MSK                    /*!< ADC channel 3 sampling time selection */
#define ADC_SMPR_SMPSEL4_POS           (12U)
#define ADC_SMPR_SMPSEL4_MSK           (0x1UL << ADC_SMPR_SMPSEL4_POS)         /*!< 0x00001000 */
#define ADC_SMPR_SMPSEL4               ADC_SMPR_SMPSEL4_MSK                    /*!< ADC channel 4 sampling time selection */
#define ADC_SMPR_SMPSEL5_POS           (13U)
#define ADC_SMPR_SMPSEL5_MSK           (0x1UL << ADC_SMPR_SMPSEL5_POS)         /*!< 0x00002000 */
#define ADC_SMPR_SMPSEL5               ADC_SMPR_SMPSEL5_MSK                    /*!< ADC channel 5 sampling time selection */
#define ADC_SMPR_SMPSEL6_POS           (14U)
#define ADC_SMPR_SMPSEL6_MSK           (0x1UL << ADC_SMPR_SMPSEL6_POS)         /*!< 0x00004000 */
#define ADC_SMPR_SMPSEL6               ADC_SMPR_SMPSEL6_MSK                    /*!< ADC channel 6 sampling time selection */
#define ADC_SMPR_SMPSEL7_POS           (15U)
#define ADC_SMPR_SMPSEL7_MSK           (0x1UL << ADC_SMPR_SMPSEL7_POS)         /*!< 0x00008000 */
#define ADC_SMPR_SMPSEL7               ADC_SMPR_SMPSEL7_MSK                    /*!< ADC channel 7 sampling time selection */
#define ADC_SMPR_SMPSEL8_POS           (16U)
#define ADC_SMPR_SMPSEL8_MSK           (0x1UL << ADC_SMPR_SMPSEL8_POS)         /*!< 0x00010000 */
#define ADC_SMPR_SMPSEL8               ADC_SMPR_SMPSEL8_MSK                    /*!< ADC channel 8 sampling time selection */
#define ADC_SMPR_SMPSEL9_POS           (17U)
#define ADC_SMPR_SMPSEL9_MSK           (0x1UL << ADC_SMPR_SMPSEL9_POS)         /*!< 0x00020000 */
#define ADC_SMPR_SMPSEL9               ADC_SMPR_SMPSEL9_MSK                    /*!< ADC channel 9 sampling time selection */
#define ADC_SMPR_SMPSEL10_POS          (18U)
#define ADC_SMPR_SMPSEL10_MSK          (0x1UL << ADC_SMPR_SMPSEL10_POS)        /*!< 0x00040000 */
#define ADC_SMPR_SMPSEL10              ADC_SMPR_SMPSEL10_MSK                   /*!< ADC channel 10 sampling time selection */
#define ADC_SMPR_SMPSEL11_POS          (19U)
#define ADC_SMPR_SMPSEL11_MSK          (0x1UL << ADC_SMPR_SMPSEL11_POS)        /*!< 0x00080000 */
#define ADC_SMPR_SMPSEL11              ADC_SMPR_SMPSEL11_MSK                   /*!< ADC channel 11 sampling time selection */
#define ADC_SMPR_SMPSEL12_POS          (20U)
#define ADC_SMPR_SMPSEL12_MSK          (0x1UL << ADC_SMPR_SMPSEL12_POS)        /*!< 0x00100000 */
#define ADC_SMPR_SMPSEL12              ADC_SMPR_SMPSEL12_MSK                   /*!< ADC channel 12 sampling time selection */
#define ADC_SMPR_SMPSEL13_POS          (21U)
#define ADC_SMPR_SMPSEL13_MSK          (0x1UL << ADC_SMPR_SMPSEL13_POS)        /*!< 0x00200000 */
#define ADC_SMPR_SMPSEL13              ADC_SMPR_SMPSEL13_MSK                   /*!< ADC channel 13 sampling time selection */
#define ADC_SMPR_SMPSEL14_POS          (22U)
#define ADC_SMPR_SMPSEL14_MSK          (0x1UL << ADC_SMPR_SMPSEL14_POS)        /*!< 0x00400000 */
#define ADC_SMPR_SMPSEL14              ADC_SMPR_SMPSEL14_MSK                   /*!< ADC channel 14 sampling time selection */
#define ADC_SMPR_SMPSEL15_POS          (23U)
#define ADC_SMPR_SMPSEL15_MSK          (0x1UL << ADC_SMPR_SMPSEL15_POS)        /*!< 0x00800000 */
#define ADC_SMPR_SMPSEL15              ADC_SMPR_SMPSEL15_MSK                   /*!< ADC channel 15 sampling time selection */
#define ADC_SMPR_SMPSEL16_POS          (24U)
#define ADC_SMPR_SMPSEL16_MSK          (0x1UL << ADC_SMPR_SMPSEL16_POS)        /*!< 0x01000000 */
#define ADC_SMPR_SMPSEL16              ADC_SMPR_SMPSEL16_MSK                   /*!< ADC channel 16 sampling time selection */
#define ADC_SMPR_SMPSEL17_POS          (25U)
#define ADC_SMPR_SMPSEL17_MSK          (0x1UL << ADC_SMPR_SMPSEL17_POS)        /*!< 0x02000000 */
#define ADC_SMPR_SMPSEL17              ADC_SMPR_SMPSEL17_MSK                   /*!< ADC channel 17 sampling time selection */
#define ADC_SMPR_SMPSEL18_POS          (26U)
#define ADC_SMPR_SMPSEL18_MSK          (0x1UL << ADC_SMPR_SMPSEL18_POS)        /*!< 0x04000000 */
#define ADC_SMPR_SMPSEL18              ADC_SMPR_SMPSEL18_MSK                   /*!< ADC channel 18 sampling time selection */

/********************  Bit definition for ADC_TR1 register  *******************/
#define ADC_TR1_LT1_POS                (0U)
#define ADC_TR1_LT1_MSK                (0xFFFUL << ADC_TR1_LT1_POS)            /*!< 0x00000FFF */
#define ADC_TR1_LT1                    ADC_TR1_LT1_MSK                         /*!< ADC analog watchdog 1 threshold low */
#define ADC_TR1_LT1_0                  (0x001UL << ADC_TR1_LT1_POS)            /*!< 0x00000001 */
#define ADC_TR1_LT1_1                  (0x002UL << ADC_TR1_LT1_POS)            /*!< 0x00000002 */
#define ADC_TR1_LT1_2                  (0x004UL << ADC_TR1_LT1_POS)            /*!< 0x00000004 */
#define ADC_TR1_LT1_3                  (0x008UL << ADC_TR1_LT1_POS)            /*!< 0x00000008 */
#define ADC_TR1_LT1_4                  (0x010UL << ADC_TR1_LT1_POS)            /*!< 0x00000010 */
#define ADC_TR1_LT1_5                  (0x020UL << ADC_TR1_LT1_POS)            /*!< 0x00000020 */
#define ADC_TR1_LT1_6                  (0x040UL << ADC_TR1_LT1_POS)            /*!< 0x00000040 */
#define ADC_TR1_LT1_7                  (0x080UL << ADC_TR1_LT1_POS)            /*!< 0x00000080 */
#define ADC_TR1_LT1_8                  (0x100UL << ADC_TR1_LT1_POS)            /*!< 0x00000100 */
#define ADC_TR1_LT1_9                  (0x200UL << ADC_TR1_LT1_POS)            /*!< 0x00000200 */
#define ADC_TR1_LT1_10                 (0x400UL << ADC_TR1_LT1_POS)            /*!< 0x00000400 */
#define ADC_TR1_LT1_11                 (0x800UL << ADC_TR1_LT1_POS)            /*!< 0x00000800 */

#define ADC_TR1_HT1_POS                (16U)
#define ADC_TR1_HT1_MSK                (0xFFFUL << ADC_TR1_HT1_POS)            /*!< 0x0FFF0000 */
#define ADC_TR1_HT1                    ADC_TR1_HT1_MSK                         /*!< ADC Analog watchdog 1 threshold high */
#define ADC_TR1_HT1_0                  (0x001UL << ADC_TR1_HT1_POS)            /*!< 0x00010000 */
#define ADC_TR1_HT1_1                  (0x002UL << ADC_TR1_HT1_POS)            /*!< 0x00020000 */
#define ADC_TR1_HT1_2                  (0x004UL << ADC_TR1_HT1_POS)            /*!< 0x00040000 */
#define ADC_TR1_HT1_3                  (0x008UL << ADC_TR1_HT1_POS)            /*!< 0x00080000 */
#define ADC_TR1_HT1_4                  (0x010UL << ADC_TR1_HT1_POS)            /*!< 0x00100000 */
#define ADC_TR1_HT1_5                  (0x020UL << ADC_TR1_HT1_POS)            /*!< 0x00200000 */
#define ADC_TR1_HT1_6                  (0x040UL << ADC_TR1_HT1_POS)            /*!< 0x00400000 */
#define ADC_TR1_HT1_7                  (0x080UL << ADC_TR1_HT1_POS)            /*!< 0x00800000 */
#define ADC_TR1_HT1_8                  (0x100UL << ADC_TR1_HT1_POS)            /*!< 0x01000000 */
#define ADC_TR1_HT1_9                  (0x200UL << ADC_TR1_HT1_POS)            /*!< 0x02000000 */
#define ADC_TR1_HT1_10                 (0x400UL << ADC_TR1_HT1_POS)            /*!< 0x04000000 */
#define ADC_TR1_HT1_11                 (0x800UL << ADC_TR1_HT1_POS)            /*!< 0x08000000 */

