ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/* Delay for ADC stabilization time (ADC voltage regulator start-up time)     */
/* Delay set to maximum value (refer to device datasheet,                     */
/* parameter "tADCVREG_STUP").                                                */
/* Unit: us                                                                   */
#define LL_ADC_DELAY_INTERNAL_REGUL_STAB_US ( 20UL)  /*!< Delay for ADC stabilization time (ADC voltage regulator start-up time) */

/* Delay for internal voltage reference stabilization time.                   */
/* Delay set to maximum value (refer to device datasheet,                     */
/* parameter "tstart_vrefint").                                               */
/* Unit: us                                                                   */
#define LL_ADC_DELAY_VREFINT_STAB_US           ( 12UL)  /*!< Delay for internal voltage reference stabilization time */

/* Delay for temperature sensor stabilization time.                           */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART").                                                       */
/* Unit: us                                                                   */
#define LL_ADC_DELAY_TEMPSENSOR_STAB_US        (120UL)  /*!< Delay for temperature sensor stabilization time (starting from temperature sensor enable, refer to @ref LL_ADC_SetCommonPathInternalCh()) */
#define LL_ADC_DELAY_TEMPSENSOR_BUFFER_STAB_US ( 15UL)  /*!< Delay for temperature sensor buffer stabilization time (starting from ADC enable, refer to @ref LL_ADC_Enable()) */

/* Delay required between ADC end of calibration and ADC enable.              */
/* Note: On this STM32 series, a minimum number of ADC clock cycles           */
/*       are required between ADC end of calibration and ADC enable.          */
/*       Wait time can be computed in user application by waiting for the     */
/*       equivalent number of CPU cycles, by taking into account              */
/*       ratio of CPU clock versus ADC clock prescalers.                      */
/* Unit: ADC clock cycles.                                                    */
#define LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES   (  2UL)  /*!< Delay required between ADC end of calibration and ADC enable */
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- FLASH REGISTER ---------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief FLASH Registers
 */
typedef struct
{
  volatile uint32 ACR;          /*!< FLASH Access Control register,                     Address offset: 0x00 */
       uint32 RESERVED1;    /*!< Reserved1,                                         Address offset: 0x04 */
  volatile uint32 KEYR;         /*!< FLASH Key register,                                Address offset: 0x08 */
  volatile uint32 OPTKEYR;      /*!< FLASH Option Key register,                         Address offset: 0x0C */
  volatile uint32 SR;           /*!< FLASH Status register,                             Address offset: 0x10 */
  volatile uint32 CR;           /*!< FLASH Control register,                            Address offset: 0x14 */
  volatile uint32 ECCR;          /*!< FLASH ECC bank 1 register,                        Address offset: 0x18 */
  volatile uint32 ECC2R;         /*!< FLASH ECC bank 2 register,                        Address offset: 0x1C */
  volatile uint32 OPTR;         /*!< FLASH Option register,                             Address offset: 0x20 */
  volatile uint32 PCROP1ASR;    /*!< FLASH Bank PCROP area A Start address register,    Address offset: 0x24 */
  volatile uint32 PCROP1AER;    /*!< FLASH Bank PCROP area A End address register,      Address offset: 0x28 */
  volatile uint32 WRP1AR;       /*!< FLASH Bank WRP area A address register,            Address offset: 0x2C */
  volatile uint32 WRP1BR;       /*!< FLASH Bank WRP area B address register,            Address offset: 0x30 */
  volatile uint32 PCROP1BSR;    /*!< FLASH Bank PCROP area B Start address register,    Address offset: 0x34 */
  volatile uint32 PCROP1BER;    /*!< FLASH Bank PCROP area B End address register,      Address offset: 0x38 */
       uint32 RESERVED5[2]; /*!< Reserved5,                                         Address offset: 0x3C--0x40 */
  volatile uint32 PCROP2ASR;    /*!< FLASH Bank2 PCROP area A Start address register,   Address offset: 0x44 */
  volatile uint32 PCROP2AER;    /*!< FLASH Bank2 PCROP area A End address register,     Address offset: 0x48 */
  volatile uint32 WRP2AR;       /*!< FLASH Bank2 WRP area A address register,           Address offset: 0x4C */
  volatile uint32 WRP2BR;       /*!< FLASH Bank2 WRP area B address register,           Address offset: 0x50 */
  volatile uint32 PCROP2BSR;    /*!< FLASH Bank2 PCROP area B Start address register,   Address offset: 0x54 */
  volatile uint32 PCROP2BER;    /*!< FLASH Bank2 PCROP area B End address register,     Address offset: 0x58 */
       uint32 RESERVED7[9]; /*!< Reserved7,                                         Address offset: 0x5C--0x7C */
  volatile uint32 SECR;         /*!< FLASH security register ,                          Address offset: 0x80 */
} FLASH_TYPEDEF;

#define FLASH               (*(FLASH_TYPEDEF *) FLASH_R_BASE)

#define FLASH_LATENCY_0                 0x00000000UL        /*!< FLASH Zero wait state */
#define FLASH_LATENCY_1                 FLASH_ACR_LATENCY_0 /*!< FLASH One wait state */
#define FLASH_LATENCY_2                 FLASH_ACR_LATENCY_1 /*!< FLASH Two wait states */

#define FLASH_FKEY1                          ((uint32)0x45670123)        //! Flash program erase key1
#define FLASH_FKEY2                          ((uint32)0xCDEF89ABU)        //! Flash program erase key2: used with FLASH_PEKEY1

#define FLASH_SR_ERRORS                 (FLASH_SR_OPERR  | FLASH_SR_PROGERR | FLASH_SR_WRPERR | \
                                        FLASH_SR_PGAERR | FLASH_SR_SIZERR  | FLASH_SR_PGSERR |  \
                                        FLASH_SR_MISERR | FLASH_SR_FASTERR | FLASH_SR_RDERR |   \
                                        FLASH_SR_OPTVERR) /*!< All SR error flags */

#define FLASH_SR_CLEAR                  (FLASH_SR_ERRORS | FLASH_SR_EOP | FLASH_SR_PESD)

#define FLASH_BANK_1                    FLASH_CR_MER1   /*!< Bank 1 */
#define FLASH_BANK_2                    FLASH_CR_MER2   /*!< Bank 2 */


/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY_POS                  (0U)
#define FLASH_ACR_LATENCY_MSK                  (0x7UL << FLASH_ACR_LATENCY_POS) /*!< 0x00000007 */
#define FLASH_ACR_LATENCY                      FLASH_ACR_LATENCY_MSK
#define FLASH_ACR_LATENCY_0                    (0x1UL << FLASH_ACR_LATENCY_POS) /*!< 0x00000001 */
#define FLASH_ACR_LATENCY_1                    (0x2UL << FLASH_ACR_LATENCY_POS) /*!< 0x00000002 */
#define FLASH_ACR_LATENCY_2                    (0x4UL << FLASH_ACR_LATENCY_POS) /*!< 0x00000004 */
#define FLASH_ACR_PRFTEN_POS                   (8U)
#define FLASH_ACR_PRFTEN_MSK                   (0x1UL << FLASH_ACR_PRFTEN_POS)  /*!< 0x00000100 */
#define FLASH_ACR_PRFTEN                       FLASH_ACR_PRFTEN_MSK
#define FLASH_ACR_ICEN_POS                     (9U)
#define FLASH_ACR_ICEN_MSK                     (0x1UL << FLASH_ACR_ICEN_POS)    /*!< 0x00000200 */
#define FLASH_ACR_ICEN                         FLASH_ACR_ICEN_MSK
#define FLASH_ACR_ICRST_POS                    (11U)
#define FLASH_ACR_ICRST_MSK                    (0x1UL << FLASH_ACR_ICRST_POS)   /*!< 0x00000800 */
#define FLASH_ACR_ICRST                        FLASH_ACR_ICRST_MSK
#define FLASH_ACR_PROGEMPTY_POS                (16U)
#define FLASH_ACR_PROGEMPTY_MSK                (0x1UL << FLASH_ACR_PROGEMPTY_POS) /*!< 0x00010000 */
#define FLASH_ACR_PROGEMPTY                    FLASH_ACR_PROGEMPTY_MSK
#define FLASH_ACR_DBG_SWEN_POS                 (18U)
#define FLASH_ACR_DBG_SWEN_MSK                 (0x1UL << FLASH_ACR_DBG_SWEN_POS) /*!< 0x00040000 */
#define FLASH_ACR_DBG_SWEN                     FLASH_ACR_DBG_SWEN_MSK

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP_POS                       (0U)
#define FLASH_SR_EOP_MSK                       (0x1UL << FLASH_SR_EOP_POS)      /*!< 0x00000001 */
#define FLASH_SR_EOP                           FLASH_SR_EOP_MSK
#define FLASH_SR_OPERR_POS                     (1U)
#define FLASH_SR_OPERR_MSK                     (0x1UL << FLASH_SR_OPERR_POS)    /*!< 0x00000002 */
#define FLASH_SR_OPERR                         FLASH_SR_OPERR_MSK
#define FLASH_SR_PROGERR_POS                   (3U)
#define FLASH_SR_PROGERR_MSK                   (0x1UL << FLASH_SR_PROGERR_POS)  /*!< 0x00000008 */
#define FLASH_SR_PROGERR                       FLASH_SR_PROGERR_MSK
#define FLASH_SR_WRPERR_POS                    (4U)
#define FLASH_SR_WRPERR_MSK                    (0x1UL << FLASH_SR_WRPERR_POS)   /*!< 0x00000010 */
#define FLASH_SR_WRPERR                        FLASH_SR_WRPERR_MSK
#define FLASH_SR_PGAERR_POS                    (5U)
#define FLASH_SR_PGAERR_MSK                    (0x1UL << FLASH_SR_PGAERR_POS)   /*!< 0x00000020 */
#define FLASH_SR_PGAERR                        FLASH_SR_PGAERR_MSK
#define FLASH_SR_SIZERR_POS                    (6U)
#define FLASH_SR_SIZERR_MSK                    (0x1UL << FLASH_SR_SIZERR_POS)   /*!< 0x00000040 */
#define FLASH_SR_SIZERR                        FLASH_SR_SIZERR_MSK
#define FLASH_SR_PGSERR_POS                    (7U)
#define FLASH_SR_PGSERR_MSK                    (0x1UL << FLASH_SR_PGSERR_POS)   /*!< 0x00000080 */
#define FLASH_SR_PGSERR                        FLASH_SR_PGSERR_MSK
#define FLASH_SR_MISERR_POS                    (8U)
#define FLASH_SR_MISERR_MSK                    (0x1UL << FLASH_SR_MISERR_POS)   /*!< 0x00000100 */
#define FLASH_SR_MISERR                        FLASH_SR_MISERR_MSK
#define FLASH_SR_FASTERR_POS                   (9U)
#define FLASH_SR_FASTERR_MSK                   (0x1UL << FLASH_SR_FASTERR_POS)  /*!< 0x00000200 */
#define FLASH_SR_FASTERR                       FLASH_SR_FASTERR_MSK
#define FLASH_SR_RDERR_POS                     (14U)
#define FLASH_SR_RDERR_MSK                     (0x1UL << FLASH_SR_RDERR_POS)    /*!< 0x00004000 */
#define FLASH_SR_RDERR                         FLASH_SR_RDERR_MSK
#define FLASH_SR_OPTVERR_POS                   (15U)
#define FLASH_SR_OPTVERR_MSK                   (0x1UL << FLASH_SR_OPTVERR_POS)  /*!< 0x00008000 */
#define FLASH_SR_OPTVERR                       FLASH_SR_OPTVERR_MSK
#define FLASH_SR_BSY1_POS                      (16U)
#define FLASH_SR_BSY1_MSK                      (0x1UL << FLASH_SR_BSY1_POS)     /*!< 0x00010000 */
#define FLASH_SR_BSY1                          FLASH_SR_BSY1_MSK
#define FLASH_SR_BSY2_POS                      (17U)
#define FLASH_SR_BSY2_MSK                      (0x1UL << FLASH_SR_BSY2_POS)     /*!< 0x00020000 */
#define FLASH_SR_BSY2                          FLASH_SR_BSY2_MSK
#define FLASH_SR_CFGBSY_POS                    (18U)
#define FLASH_SR_CFGBSY_MSK                    (0x1UL << FLASH_SR_CFGBSY_POS)   /*!< 0x00040000 */
#define FLASH_SR_CFGBSY                        FLASH_SR_CFGBSY_MSK
#define FLASH_SR_PESD_POS                      (19U)
#define FLASH_SR_PESD_MSK                      (0x1UL << FLASH_SR_PESD_POS)   /*!< 0x00080000 */
#define FLASH_SR_PESD                          FLASH_SR_PESD_MSK

