ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG_POS                        (0U)
#define FLASH_CR_PG_MSK                        (0x1UL << FLASH_CR_PG_POS)         /*!< 0x00000001 */
#define FLASH_CR_PG                            FLASH_CR_PG_MSK
#define FLASH_CR_PER_POS                       (1U)
#define FLASH_CR_PER_MSK                       (0x1UL << FLASH_CR_PER_POS)        /*!< 0x00000002 */
#define FLASH_CR_PER                           FLASH_CR_PER_MSK
#define FLASH_CR_MER1_POS                      (2U)
#define FLASH_CR_MER1_MSK                      (0x1UL << FLASH_CR_MER1_POS)       /*!< 0x00000004 */
#define FLASH_CR_MER1                          FLASH_CR_MER1_MSK
#define FLASH_CR_PNB_POS                       (3U)
#define FLASH_CR_PNB_MSK                       (0x7FUL << FLASH_CR_PNB_POS)       /*!< 0x000003F8 */
#define FLASH_CR_PNB                           FLASH_CR_PNB_MSK
#define FLASH_CR_BKER_POS                      (13U)
#define FLASH_CR_BKER_MSK                      (0x1UL << FLASH_CR_BKER_POS)       /*!< 0x00002000 */
#define FLASH_CR_BKER                          FLASH_CR_BKER_MSK
#define FLASH_CR_MER2_POS                      (15U)
#define FLASH_CR_MER2_MSK                      (0x1UL << FLASH_CR_MER2_POS)       /*!< 0x00008000 */
#define FLASH_CR_MER2                          FLASH_CR_MER2_MSK
#define FLASH_CR_STRT_POS                      (16U)
#define FLASH_CR_STRT_MSK                      (0x1UL << FLASH_CR_STRT_POS)       /*!< 0x00010000 */
#define FLASH_CR_STRT                          FLASH_CR_STRT_MSK
#define FLASH_CR_OPTSTRT_POS                   (17U)
#define FLASH_CR_OPTSTRT_MSK                   (0x1UL << FLASH_CR_OPTSTRT_POS)    /*!< 0x00020000 */
#define FLASH_CR_OPTSTRT                       FLASH_CR_OPTSTRT_MSK
#define FLASH_CR_FSTPG_POS                     (18U)
#define FLASH_CR_FSTPG_MSK                     (0x1UL << FLASH_CR_FSTPG_POS)      /*!< 0x00040000 */
#define FLASH_CR_FSTPG                         FLASH_CR_FSTPG_MSK
#define FLASH_CR_EOPIE_POS                     (24U)
#define FLASH_CR_EOPIE_MSK                     (0x1UL << FLASH_CR_EOPIE_POS)      /*!< 0x01000000 */
#define FLASH_CR_EOPIE                         FLASH_CR_EOPIE_MSK
#define FLASH_CR_ERRIE_POS                     (25U)
#define FLASH_CR_ERRIE_MSK                     (0x1UL << FLASH_CR_ERRIE_POS)      /*!< 0x02000000 */
#define FLASH_CR_ERRIE                         FLASH_CR_ERRIE_MSK
#define FLASH_CR_RDERRIE_POS                   (26U)
#define FLASH_CR_RDERRIE_MSK                   (0x1UL << FLASH_CR_RDERRIE_POS)    /*!< 0x04000000 */
#define FLASH_CR_RDERRIE                       FLASH_CR_RDERRIE_MSK
#define FLASH_CR_OBL_LAUNCH_POS                (27U)
#define FLASH_CR_OBL_LAUNCH_MSK                (0x1UL << FLASH_CR_OBL_LAUNCH_POS) /*!< 0x08000000 */
#define FLASH_CR_OBL_LAUNCH                    FLASH_CR_OBL_LAUNCH_MSK
#define FLASH_CR_SEC_PROT_POS                  (28U)
#define FLASH_CR_SEC_PROT_MSK                  (0x1UL << FLASH_CR_SEC_PROT_POS)   /*!< 0x10000000 */
#define FLASH_CR_SEC_PROT                      FLASH_CR_SEC_PROT_MSK
#define FLASH_CR_SEC_PROT2_POS                 (29U)
#define FLASH_CR_SEC_PROT2_MSK                 (0x1UL << FLASH_CR_SEC_PROT2_POS)  /*!< 0x20000000 */
#define FLASH_CR_SEC_PROT2                     FLASH_CR_SEC_PROT2_MSK
#define FLASH_CR_OPTLOCK_POS                   (30U)
#define FLASH_CR_OPTLOCK_MSK                   (0x1UL << FLASH_CR_OPTLOCK_POS)    /*!< 0x40000000 */
#define FLASH_CR_OPTLOCK                       FLASH_CR_OPTLOCK_MSK
#define FLASH_CR_LOCK_POS                      (31U)
#define FLASH_CR_LOCK_MSK                      (0x1UL << FLASH_CR_LOCK_POS)       /*!< 0x80000000 */
#define FLASH_CR_LOCK                          FLASH_CR_LOCK_MSK

/*******************  Bits definition for FLASH_ECCR register  ****************/
#define FLASH_ECCR_ADDR_ECC_POS                (0U)
#define FLASH_ECCR_ADDR_ECC_MSK                (0x7FFFUL << FLASH_ECCR_ADDR_ECC_POS)  /*!< 0x00007FFF */
#define FLASH_ECCR_ADDR_ECC                    FLASH_ECCR_ADDR_ECC_MSK
#define FLASH_ECCR_SYSF_ECC_POS                (20U)
#define FLASH_ECCR_SYSF_ECC_MSK                (0x1UL << FLASH_ECCR_SYSF_ECC_POS)     /*!< 0x00100000 */
#define FLASH_ECCR_SYSF_ECC                    FLASH_ECCR_SYSF_ECC_MSK
#define FLASH_ECCR_ECCCIE_POS                  (24U)
#define FLASH_ECCR_ECCCIE_MSK                  (0x1UL << FLASH_ECCR_ECCCIE_POS)       /*!< 0x01000000 */
#define FLASH_ECCR_ECCCIE                      FLASH_ECCR_ECCCIE_MSK
#define FLASH_ECCR_ECCC_POS                    (30U)
#define FLASH_ECCR_ECCC_MSK                    (0x1UL << FLASH_ECCR_ECCC_POS)         /*!< 0x40000000 */
#define FLASH_ECCR_ECCC                        FLASH_ECCR_ECCC_MSK
#define FLASH_ECCR_ECCD_POS                    (31U)
#define FLASH_ECCR_ECCD_MSK                    (0x1UL << FLASH_ECCR_ECCD_POS)         /*!< 0x80000000 */
#define FLASH_ECCR_ECCD                        FLASH_ECCR_ECCD_MSK

/*******************  Bits definition for FLASH_ECC2R register  ****************/
#define FLASH_ECC2R_ADDR_ECC_POS                (0U)
#define FLASH_ECC2R_ADDR_ECC_MSK                (0x7FFFUL << FLASH_ECC2R_ADDR_ECC_POS)  /*!< 0x00007FFF */
#define FLASH_ECC2R_ADDR_ECC                    FLASH_ECC2R_ADDR_ECC_MSK
#define FLASH_ECC2R_SYSF_ECC_POS                (20U)
#define FLASH_ECC2R_SYSF_ECC_MSK                (0x1UL << FLASH_ECC2R_SYSF_ECC_POS)     /*!< 0x00100000 */
#define FLASH_ECC2R_SYSF_ECC                    FLASH_ECC2R_SYSF_ECC_MSK
#define FLASH_ECC2R_ECCCIE_POS                  (24U)
#define FLASH_ECC2R_ECCCIE_MSK                  (0x1UL << FLASH_ECC2R_ECCCIE_POS)       /*!< 0x01000000 */
#define FLASH_ECC2R_ECCCIE                      FLASH_ECC2R_ECCCIE_MSK
#define FLASH_ECC2R_ECCC_POS                    (30U)
#define FLASH_ECC2R_ECCC_MSK                    (0x1UL << FLASH_ECC2R_ECCC_POS)         /*!< 0x40000000 */
#define FLASH_ECC2R_ECCC                        FLASH_ECC2R_ECCC_MSK
#define FLASH_ECC2R_ECCD_POS                    (31U)
#define FLASH_ECC2R_ECCD_MSK                    (0x1UL << FLASH_ECC2R_ECCD_POS)         /*!< 0x80000000 */
#define FLASH_ECC2R_ECCD                        FLASH_ECC2R_ECCD_MSK

/*******************  Bits definition for FLASH_OPTR register  ****************/
#define FLASH_OPTR_RDP_POS                     (0U)
#define FLASH_OPTR_RDP_MSK                     (0xFFUL << FLASH_OPTR_RDP_POS)             /*!< 0x000000FF */
#define FLASH_OPTR_RDP                         FLASH_OPTR_RDP_MSK
#define FLASH_OPTR_BOR_EN_POS                  (8U)
#define FLASH_OPTR_BOR_EN_MSK                  (0x1UL << FLASH_OPTR_BOR_EN_POS)           /*!< 0x00000100 */
#define FLASH_OPTR_BOR_EN                      FLASH_OPTR_BOR_EN_MSK
#define FLASH_OPTR_BORR_LEV_POS                (9U)
#define FLASH_OPTR_BORR_LEV_MSK                (0x3UL << FLASH_OPTR_BORR_LEV_POS)         /*!< 0x00000600 */
#define FLASH_OPTR_BORR_LEV                    FLASH_OPTR_BORR_LEV_MSK
#define FLASH_OPTR_BORR_LEV_0                  (0x1UL << FLASH_OPTR_BORR_LEV_POS)         /*!< 0x00000200 */
#define FLASH_OPTR_BORR_LEV_1                  (0x2UL << FLASH_OPTR_BORR_LEV_POS)         /*!< 0x00000400 */
#define FLASH_OPTR_BORF_LEV_POS                (11U)
#define FLASH_OPTR_BORF_LEV_MSK                (0x3UL << FLASH_OPTR_BORF_LEV_POS)         /*!< 0x00001800 */
#define FLASH_OPTR_BORF_LEV                    FLASH_OPTR_BORF_LEV_MSK
#define FLASH_OPTR_BORF_LEV_0                  (0x1UL << FLASH_OPTR_BORF_LEV_POS)         /*!< 0x00000800 */
#define FLASH_OPTR_BORF_LEV_1                  (0x2UL << FLASH_OPTR_BORF_LEV_POS)         /*!< 0x00001000 */
#define FLASH_OPTR_nRST_STOP_POS               (13U)
#define FLASH_OPTR_nRST_STOP_MSK               (0x1UL << FLASH_OPTR_nRST_STOP_POS)        /*!< 0x00002000 */
#define FLASH_OPTR_nRST_STOP                   FLASH_OPTR_nRST_STOP_MSK
#define FLASH_OPTR_nRST_STDBY_POS              (14U)
#define FLASH_OPTR_nRST_STDBY_MSK              (0x1UL << FLASH_OPTR_nRST_STDBY_POS)       /*!< 0x00004000 */
#define FLASH_OPTR_nRST_STDBY                  FLASH_OPTR_nRST_STDBY_MSK
#define FLASH_OPTR_nRST_SHDW_POS               (15U)
#define FLASH_OPTR_nRST_SHDW_MSK               (0x1UL << FLASH_OPTR_nRST_SHDW_POS)        /*!< 0x00008000 */
#define FLASH_OPTR_nRST_SHDW                   FLASH_OPTR_nRST_SHDW_MSK
#define FLASH_OPTR_IWDG_SW_POS                 (16U)
#define FLASH_OPTR_IWDG_SW_MSK                 (0x1UL << FLASH_OPTR_IWDG_SW_POS)          /*!< 0x00010000 */
#define FLASH_OPTR_IWDG_SW                     FLASH_OPTR_IWDG_SW_MSK
#define FLASH_OPTR_IWDG_STOP_POS               (17U)
#define FLASH_OPTR_IWDG_STOP_MSK               (0x1UL << FLASH_OPTR_IWDG_STOP_POS)        /*!< 0x00020000 */
#define FLASH_OPTR_IWDG_STOP                   FLASH_OPTR_IWDG_STOP_MSK
#define FLASH_OPTR_IWDG_STDBY_POS              (18U)
#define FLASH_OPTR_IWDG_STDBY_MSK              (0x1UL << FLASH_OPTR_IWDG_STDBY_POS)       /*!< 0x00040000 */
#define FLASH_OPTR_IWDG_STDBY                  FLASH_OPTR_IWDG_STDBY_MSK
#define FLASH_OPTR_WWDG_SW_POS                 (19U)
#define FLASH_OPTR_WWDG_SW_MSK                 (0x1UL << FLASH_OPTR_WWDG_SW_POS)          /*!< 0x00080000 */
#define FLASH_OPTR_WWDG_SW                     FLASH_OPTR_WWDG_SW_MSK
#define FLASH_OPTR_nSWAP_BANK_POS              (20U)
#define FLASH_OPTR_nSWAP_BANK_MSK              (0x1UL << FLASH_OPTR_nSWAP_BANK_POS)        /*!< 0x00100000 */
#define FLASH_OPTR_nSWAP_BANK                  FLASH_OPTR_nSWAP_BANK_MSK
#define FLASH_OPTR_DUAL_BANK_POS               (21U)
#define FLASH_OPTR_DUAL_BANK_MSK               (0x1UL << FLASH_OPTR_DUAL_BANK_POS)        /*!< 0x00200000 */
#define FLASH_OPTR_DUAL_BANK                   FLASH_OPTR_DUAL_BANK_MSK
#define FLASH_OPTR_RAM_PARITY_CHECK_POS        (22U)
#define FLASH_OPTR_RAM_PARITY_CHECK_MSK        (0x1UL << FLASH_OPTR_RAM_PARITY_CHECK_POS) /*!< 0x00400000 */
#define FLASH_OPTR_RAM_PARITY_CHECK            FLASH_OPTR_RAM_PARITY_CHECK_MSK
#define FLASH_OPTR_nBOOT_SEL_POS               (24U)
#define FLASH_OPTR_nBOOT_SEL_MSK               (0x1UL << FLASH_OPTR_nBOOT_SEL_POS)        /*!< 0x01000000 */
#define FLASH_OPTR_nBOOT_SEL                   FLASH_OPTR_nBOOT_SEL_MSK
#define FLASH_OPTR_nBOOT1_POS                  (25U)
#define FLASH_OPTR_nBOOT1_MSK                  (0x1UL << FLASH_OPTR_nBOOT1_POS)           /*!< 0x02000000 */
#define FLASH_OPTR_nBOOT1                      FLASH_OPTR_nBOOT1_MSK
#define FLASH_OPTR_nBOOT0_POS                  (26U)
#define FLASH_OPTR_nBOOT0_MSK                  (0x1UL << FLASH_OPTR_nBOOT0_POS)           /*!< 0x04000000 */
#define FLASH_OPTR_nBOOT0                      FLASH_OPTR_nBOOT0_MSK
#define FLASH_OPTR_NRST_MODE_POS               (27U)
#define FLASH_OPTR_NRST_MODE_MSK               (0x3UL << FLASH_OPTR_NRST_MODE_POS)        /*!< 0x18000000 */
#define FLASH_OPTR_NRST_MODE                   FLASH_OPTR_NRST_MODE_MSK
#define FLASH_OPTR_NRST_MODE_0                 (0x1UL << FLASH_OPTR_NRST_MODE_POS)        /*!< 0x08000000 */
#define FLASH_OPTR_NRST_MODE_1                 (0x2UL << FLASH_OPTR_NRST_MODE_POS)        /*!< 0x10000000 */
#define FLASH_OPTR_IRHEN_POS                   (29U)
#define FLASH_OPTR_IRHEN_MSK                   (0x1UL << FLASH_OPTR_IRHEN_POS)            /*!< 0x20000000 */
#define FLASH_OPTR_IRHEN                       FLASH_OPTR_IRHEN_MSK

/******************  Bits definition for FLASH_PCROP1ASR register  ************/
#define FLASH_PCROP1ASR_PCROP1A_STRT_POS       (0U)
#define FLASH_PCROP1ASR_PCROP1A_STRT_MSK       (0x1FFUL << FLASH_PCROP1ASR_PCROP1A_STRT_POS)  /*!< 0x0000001FF */
#define FLASH_PCROP1ASR_PCROP1A_STRT           FLASH_PCROP1ASR_PCROP1A_STRT_MSK

