ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bits definition for FLASH_PCROP1AER register  ************/
#define FLASH_PCROP1AER_PCROP1A_END_POS        (0U)
#define FLASH_PCROP1AER_PCROP1A_END_MSK        (0x1FFUL << FLASH_PCROP1AER_PCROP1A_END_POS)   /*!< 0x0000001FF */
#define FLASH_PCROP1AER_PCROP1A_END            FLASH_PCROP1AER_PCROP1A_END_MSK
#define FLASH_PCROP1AER_PCROP_RDP_POS          (31U)
#define FLASH_PCROP1AER_PCROP_RDP_MSK          (0x1UL << FLASH_PCROP1AER_PCROP_RDP_POS)       /*!< 0x80000000 */
#define FLASH_PCROP1AER_PCROP_RDP              FLASH_PCROP1AER_PCROP_RDP_MSK

/******************  Bits definition for FLASH_WRP1AR register  ***************/
#define FLASH_WRP1AR_WRP1A_STRT_POS            (0U)
#define FLASH_WRP1AR_WRP1A_STRT_MSK            (0x7FUL << FLASH_WRP1AR_WRP1A_STRT_POS) /*!< 0x0000007F */
#define FLASH_WRP1AR_WRP1A_STRT                FLASH_WRP1AR_WRP1A_STRT_MSK
#define FLASH_WRP1AR_WRP1A_END_POS             (16U)
#define FLASH_WRP1AR_WRP1A_END_MSK             (0x7FUL << FLASH_WRP1AR_WRP1A_END_POS) /*!< 0x007F0000 */
#define FLASH_WRP1AR_WRP1A_END                 FLASH_WRP1AR_WRP1A_END_MSK

/******************  Bits definition for FLASH_WRP1BR register  ***************/
#define FLASH_WRP1BR_WRP1B_STRT_POS            (0U)
#define FLASH_WRP1BR_WRP1B_STRT_MSK            (0x7FUL << FLASH_WRP1BR_WRP1B_STRT_POS) /*!< 0x0000007F */
#define FLASH_WRP1BR_WRP1B_STRT                FLASH_WRP1BR_WRP1B_STRT_MSK
#define FLASH_WRP1BR_WRP1B_END_POS             (16U)
#define FLASH_WRP1BR_WRP1B_END_MSK             (0x7FUL << FLASH_WRP1BR_WRP1B_END_POS) /*!< 0x007F0000 */
#define FLASH_WRP1BR_WRP1B_END                 FLASH_WRP1BR_WRP1B_END_MSK

/******************  Bits definition for FLASH_PCROP1BSR register  ************/
#define FLASH_PCROP1BSR_PCROP1B_STRT_POS       (0U)
#define FLASH_PCROP1BSR_PCROP1B_STRT_MSK       (0x1FFUL << FLASH_PCROP1BSR_PCROP1B_STRT_POS)  /*!< 0x0000001FF */
#define FLASH_PCROP1BSR_PCROP1B_STRT           FLASH_PCROP1BSR_PCROP1B_STRT_MSK

/******************  Bits definition for FLASH_PCROP1BER register  ************/
#define FLASH_PCROP1BER_PCROP1B_END_POS        (0U)
#define FLASH_PCROP1BER_PCROP1B_END_MSK        (0x1FFUL << FLASH_PCROP1BER_PCROP1B_END_POS)   /*!< 0x0000001FF */
#define FLASH_PCROP1BER_PCROP1B_END            FLASH_PCROP1BER_PCROP1B_END_MSK

/******************  Bits definition for FLASH_PCROP2ASR register  ************/
#define FLASH_PCROP2ASR_PCROP2A_STRT_POS       (0U)
#define FLASH_PCROP2ASR_PCROP2A_STRT_MSK       (0x1FFUL << FLASH_PCROP2ASR_PCROP2A_STRT_POS) /*!< 0x0000001FF */
#define FLASH_PCROP2ASR_PCROP2A_STRT           FLASH_PCROP2ASR_PCROP2A_STRT_MSK

/******************  Bits definition for FLASH_PCROP2AER register  ************/
#define FLASH_PCROP2AER_PCROP2A_END_POS        (0U)
#define FLASH_PCROP2AER_PCROP2A_END_MSK        (0x1FFUL << FLASH_PCROP2AER_PCROP2A_END_POS)  /*!< 0x0000001FF */
#define FLASH_PCROP2AER_PCROP2A_END            FLASH_PCROP2AER_PCROP2A_END_MSK


/******************  Bits definition for FLASH_WRP2AR register  ***************/
#define FLASH_WRP2AR_WRP2A_STRT_POS            (0U)
#define FLASH_WRP2AR_WRP2A_STRT_MSK            (0x7FUL << FLASH_WRP2AR_WRP2A_STRT_POS)  /*!< 0x0000007F */
#define FLASH_WRP2AR_WRP2A_STRT                FLASH_WRP2AR_WRP2A_STRT_MSK
#define FLASH_WRP2AR_WRP2A_END_POS             (16U)
#define FLASH_WRP2AR_WRP2A_END_MSK             (0x7FUL << FLASH_WRP2AR_WRP2A_END_POS)   /*!< 0x007F0000 */
#define FLASH_WRP2AR_WRP2A_END                 FLASH_WRP2AR_WRP2A_END_MSK

/******************  Bits definition for FLASH_WRP2BSR register  ***************/
#define FLASH_WRP2BR_WRP2B_STRT_POS            (0U)
#define FLASH_WRP2BR_WRP2B_STRT_MSK            (0x7FUL << FLASH_WRP2BR_WRP2B_STRT_POS)  /*!< 0x0000007F */
#define FLASH_WRP2BR_WRP2B_STRT                FLASH_WRP2BR_WRP2B_STRT_MSK
#define FLASH_WRP2BR_WRP2B_END_POS             (16U)
#define FLASH_WRP2BR_WRP2B_END_MSK             (0x7FUL << FLASH_WRP2BR_WRP2B_END_POS)   /*!< 0x007F0000 */
#define FLASH_WRP2BR_WRP2B_END                 FLASH_WRP2BR_WRP2B_END_MSK

/******************  Bits definition for FLASH_PCROP2BSR register  ************/
#define FLASH_PCROP2BSR_PCROP2B_STRT_POS       (0U)
#define FLASH_PCROP2BSR_PCROP2B_STRT_MSK       (0x1FFUL << FLASH_PCROP2BSR_PCROP2B_STRT_POS) /*!< 0x0000001FF */
#define FLASH_PCROP2BSR_PCROP2B_STRT           FLASH_PCROP2BSR_PCROP2B_STRT_MSK

/******************  Bits definition for FLASH_PCROP2BER register  ************/
#define FLASH_PCROP2BER_PCROP2B_END_POS        (0U)
#define FLASH_PCROP2BER_PCROP2B_END_MSK        (0x1FFUL << FLASH_PCROP2BER_PCROP2B_END_POS)  /*!< 0x0000001FF */
#define FLASH_PCROP2BER_PCROP2B_END            FLASH_PCROP2BER_PCROP2B_END_MSK

/******************  Bits definition for FLASH_SECR register  *****************/
#define FLASH_SECR_SEC_SIZE_POS                (0U)
#define FLASH_SECR_SEC_SIZE_MSK                (0xFFUL << FLASH_SECR_SEC_SIZE_POS) /*!< 0x000000FF */
#define FLASH_SECR_SEC_SIZE                    FLASH_SECR_SEC_SIZE_MSK
#define FLASH_SECR_BOOT_LOCK_POS               (16U)
#define FLASH_SECR_BOOT_LOCK_MSK               (0x1UL << FLASH_SECR_BOOT_LOCK_POS) /*!< 0x00010000 */
#define FLASH_SECR_BOOT_LOCK                   FLASH_SECR_BOOT_LOCK_MSK
#define FLASH_SECR_SEC_SIZE2_POS               (20U)
#define FLASH_SECR_SEC_SIZE2_MSK               (0xFFUL << FLASH_SECR_SEC_SIZE2_POS) /*!< 0x0FF00000 */
#define FLASH_SECR_SEC_SIZE2                   FLASH_SECR_SEC_SIZE2_MSK




//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- POWER CONTROL REGISTERS ------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief Power Control
  */
typedef struct
{
  volatile uint32 CR1;          /*!< PWR Power Control Register 1,                     Address offset: 0x00 */
  volatile uint32 CR2;          /*!< PWR Power Control Register 2,                     Address offset: 0x04 */
  volatile uint32 CR3;          /*!< PWR Power Control Register 3,                     Address offset: 0x08 */
  volatile uint32 CR4;          /*!< PWR Power Control Register 4,                     Address offset: 0x0C */
  volatile uint32 SR1;          /*!< PWR Power Status Register 1,                      Address offset: 0x10 */
  volatile uint32 SR2;          /*!< PWR Power Status Register 2,                      Address offset: 0x14 */
  volatile uint32 SCR;          /*!< PWR Power Status Clear Register,                  Address offset: 0x18 */
       uint32 RESERVED1;    /*!< Reserved,                                         Address offset: 0x1C */
  volatile uint32 PUCRA;        /*!< PWR Pull-Up Control Register of port A,           Address offset: 0x20 */
  volatile uint32 PDCRA;        /*!< PWR Pull-Down Control Register of port A,         Address offset: 0x24 */
  volatile uint32 PUCRB;        /*!< PWR Pull-Up Control Register of port B,           Address offset: 0x28 */
  volatile uint32 PDCRB;        /*!< PWR Pull-Down Control Register of port B,         Address offset: 0x2C */
  volatile uint32 PUCRC;        /*!< PWR Pull-Up Control Register of port C,           Address offset: 0x30 */
  volatile uint32 PDCRC;        /*!< PWR Pull-Down Control Register of port C,         Address offset: 0x34 */
  volatile uint32 PUCRD;        /*!< PWR Pull-Up Control Register of port D,           Address offset: 0x38 */
  volatile uint32 PDCRD;        /*!< PWR Pull-Down Control Register of port D,         Address offset: 0x3C */
  volatile uint32 PUCRE;        /*!< PWR Pull-Up Control Register of port E,           Address offset: 0x40 */
  volatile uint32 PDCRE;        /*!< PWR Pull-Down Control Register of port E,         Address offset: 0x44 */
  volatile uint32 PUCRF;        /*!< PWR Pull-Up Control Register of port F,           Address offset: 0x48 */
  volatile uint32 PDCRF;        /*!< PWR Pull-Down Control Register of port F,         Address offset: 0x4C */
} PWR_TYPEDEF;


#define PWR                 (*(PWR_TYPEDEF *) PWR_BASE)

/********************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_LPMS_POS          (0U)
#define PWR_CR1_LPMS_MSK          (0x7UL << PWR_CR1_LPMS_POS)                  /*!< 0x00000007 */
#define PWR_CR1_LPMS              PWR_CR1_LPMS_MSK                             /*!< Low Power Mode Selection */
#define PWR_CR1_LPMS_0            (0x1UL << PWR_CR1_LPMS_POS)                  /*!< 0x00000001 */
#define PWR_CR1_LPMS_1            (0x2UL << PWR_CR1_LPMS_POS)                  /*!< 0x00000002 */
#define PWR_CR1_LPMS_2            (0x4UL << PWR_CR1_LPMS_POS)                   /*!< 0x00000004 */
#define PWR_CR1_FPD_STOP_POS      (3U)
#define PWR_CR1_FPD_STOP_MSK      (0x1UL << PWR_CR1_FPD_STOP_POS)              /*!< 0x00000008 */
#define PWR_CR1_FPD_STOP          PWR_CR1_FPD_STOP_MSK                         /*!< Flash power down mode during stop */
#define PWR_CR1_FPD_LPRUN_POS     (4U)
#define PWR_CR1_FPD_LPRUN_MSK     (0x1UL << PWR_CR1_FPD_LPRUN_POS)             /*!< 0x00000010 */
#define PWR_CR1_FPD_LPRUN         PWR_CR1_FPD_LPRUN_MSK                        /*!< Flash power down mode during run */
#define PWR_CR1_FPD_LPSLP_POS     (5U)
#define PWR_CR1_FPD_LPSLP_MSK     (0x1UL << PWR_CR1_FPD_LPSLP_POS)             /*!< 0x00000020 */
#define PWR_CR1_FPD_LPSLP         PWR_CR1_FPD_LPSLP_MSK                        /*!< Flash power down mode during sleep */
#define PWR_CR1_DBP_POS           (8U)
#define PWR_CR1_DBP_MSK           (0x1UL << PWR_CR1_DBP_POS)                   /*!< 0x00000100 */
#define PWR_CR1_DBP               PWR_CR1_DBP_MSK                              /*!< Disable Backup Domain write protection */
#define PWR_CR1_VOS_POS           (9U)
#define PWR_CR1_VOS_MSK           (0x3UL << PWR_CR1_VOS_POS)                   /*!< 0x00000600 */
#define PWR_CR1_VOS               PWR_CR1_VOS_MSK                              /*!< Voltage scaling */
#define PWR_CR1_VOS_0             (0x1UL << PWR_CR1_VOS_POS)                   /*!< Voltage scaling bit 0 */
#define PWR_CR1_VOS_1             (0x2UL << PWR_CR1_VOS_POS)                   /*!< Voltage scaling bit 1 */
#define PWR_CR1_LPR_POS           (14U)
#define PWR_CR1_LPR_MSK           (0x1UL << PWR_CR1_LPR_POS)                   /*!< 0x00004000 */
#define PWR_CR1_LPR               PWR_CR1_LPR_MSK                              /*!< Regulator Low-Power Run mode */

/********************  Bit definition for PWR_CR2 register  ********************/
#define PWR_CR2_PVDE_POS          (0U)
#define PWR_CR2_PVDE_MSK          (0x1UL << PWR_CR2_PVDE_POS)                  /*!< 0x00000001 */
#define PWR_CR2_PVDE              PWR_CR2_PVDE_MSK                             /*!< Programmable Voltage Detector Enable */
#define PWR_CR2_PVDFT_POS         (1U)
#define PWR_CR2_PVDFT_MSK         (0x7UL << PWR_CR2_PVDFT_POS)                 /*!< 0x0000000E */
#define PWR_CR2_PVDFT             PWR_CR2_PVDFT_MSK                            /*!< PVD Falling Threshold Selection bit field */
#define PWR_CR2_PVDFT_0           (0x1UL << PWR_CR2_PVDFT_POS)                 /*!< 0x00000002 */
#define PWR_CR2_PVDFT_1           (0x2UL << PWR_CR2_PVDFT_POS)                 /*!< 0x00000004 */
#define PWR_CR2_PVDFT_2           (0x4UL << PWR_CR2_PVDFT_POS)                 /*!< 0x00000008 */
#define PWR_CR2_PVDRT_POS         (4U)
#define PWR_CR2_PVDRT_MSK         (0x7UL << PWR_CR2_PVDRT_POS)                 /*!< 0x00000070 */
#define PWR_CR2_PVDRT             PWR_CR2_PVDRT_MSK                            /*!< PVD Rising Threshold Selection bit field */
#define PWR_CR2_PVDRT_0           (0x1UL << PWR_CR2_PVDRT_POS)                 /*!< 0x00000010 */
#define PWR_CR2_PVDRT_1           (0x2UL << PWR_CR2_PVDRT_POS)                 /*!< 0x00000020 */
#define PWR_CR2_PVDRT_2           (0x4UL << PWR_CR2_PVDRT_POS)                 /*!< 0x00000040 */
#define PWR_CR2_PVMEN_USB_POS     (8U)
#define PWR_CR2_PVMEN_USB_MSK     (0x1UL << PWR_CR2_PVMEN_USB_POS)             /*!< 0x00000100 */
#define PWR_CR2_PVMEN_USB         PWR_CR2_PVMEN_USB_MSK                        /*!< USB Peripheral Voltage Monitor Enable */
#define PWR_CR2_IOSV_POS          (9U)
#define PWR_CR2_IOSV_MSK          (0x1UL << PWR_CR2_IOSV_POS)                  /*!< 0x00000200 */
#define PWR_CR2_IOSV              PWR_CR2_IOSV_MSK                             /*!< VDDIO2 independent I/Os Supply Valid */
#define PWR_CR2_USV_POS           (10U)
#define PWR_CR2_USV_MSK           (0x1UL << PWR_CR2_USV_POS)                   /*!< 0x00000400 */
#define PWR_CR2_USV               PWR_CR2_USV_MSK                              /*!< VDD USB Supply Valid */

