ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for PWR_CR3 register  ********************/
#define PWR_CR3_EWUP_POS          (0U)
#define PWR_CR3_EWUP_MSK          (0x3FUL << PWR_CR3_EWUP_POS)                 /*!< 0x0000003F */
#define PWR_CR3_EWUP              PWR_CR3_EWUP_MSK                             /*!< Enable all Wake-Up Pins  */
#define PWR_CR3_EWUP1_POS         (0U)
#define PWR_CR3_EWUP1_MSK         (0x1UL << PWR_CR3_EWUP1_POS)                 /*!< 0x00000001 */
#define PWR_CR3_EWUP1             PWR_CR3_EWUP1_MSK                            /*!< Enable WKUP pin 1 */
#define PWR_CR3_EWUP2_POS         (1U)
#define PWR_CR3_EWUP2_MSK         (0x1UL << PWR_CR3_EWUP2_POS)                 /*!< 0x00000002 */
#define PWR_CR3_EWUP2             PWR_CR3_EWUP2_MSK                            /*!< Enable WKUP pin 2 */
#define PWR_CR3_EWUP3_POS         (2U)
#define PWR_CR3_EWUP3_MSK         (0x1UL << PWR_CR3_EWUP3_POS)                 /*!< 0x00000004 */
#define PWR_CR3_EWUP3             PWR_CR3_EWUP3_MSK                            /*!< Enable WKUP pin 3 */
#define PWR_CR3_EWUP4_POS         (3U)
#define PWR_CR3_EWUP4_MSK         (0x1UL << PWR_CR3_EWUP4_POS)                 /*!< 0x00000008 */
#define PWR_CR3_EWUP4             PWR_CR3_EWUP4_MSK                            /*!< Enable WKUP pin 4 */
#define PWR_CR3_EWUP5_POS         (4U)
#define PWR_CR3_EWUP5_MSK         (0x1UL << PWR_CR3_EWUP5_POS)                 /*!< 0x00000010 */
#define PWR_CR3_EWUP5             PWR_CR3_EWUP5_MSK                            /*!< Enable WKUP pin 5 */
#define PWR_CR3_EWUP6_POS         (5U)
#define PWR_CR3_EWUP6_MSK         (0x1UL << PWR_CR3_EWUP6_POS)                 /*!< 0x00000020 */
#define PWR_CR3_EWUP6             PWR_CR3_EWUP6_MSK                            /*!< Enable WKUP pin 6 */
#define PWR_CR3_RRS_POS           (8U)
#define PWR_CR3_RRS_MSK           (0x1UL << PWR_CR3_RRS_POS)                   /*!< 0x00000100 */
#define PWR_CR3_RRS               PWR_CR3_RRS_MSK                              /*!< RAM retention in Standby mode */
#define PWR_CR3_ENB_ULP_POS       (9U)
#define PWR_CR3_ENB_ULP_MSK       (0x1UL << PWR_CR3_ENB_ULP_POS)               /*!< 0x00000200 */
#define PWR_CR3_ENB_ULP           PWR_CR3_ENB_ULP_MSK                          /*!< Enable sampling resistor bridge in the LPMU_RESET block */
#define PWR_CR3_APC_POS           (10U)
#define PWR_CR3_APC_MSK           (0x1UL << PWR_CR3_APC_POS)                   /*!< 0x00000400 */
#define PWR_CR3_APC               PWR_CR3_APC_MSK                              /*!< Apply pull-up and pull-down configuration */
#define PWR_CR3_EIWUL_POS         (15U)
#define PWR_CR3_EIWUL_MSK         (0x1UL << PWR_CR3_EIWUL_POS)                 /*!< 0x00008000 */
#define PWR_CR3_EIWUL             PWR_CR3_EIWUL_MSK                            /*!< Enable Internal Wake-up line */

/********************  Bit definition for PWR_CR4 register  ********************/
#define PWR_CR4_WP_POS            (0U)
#define PWR_CR4_WP_MSK            (0x3FUL << PWR_CR4_WP_POS)                   /*!< 0x0000003F */
#define PWR_CR4_WP                PWR_CR4_WP_MSK                               /*!< all Wake-Up Pin polarity */
#define PWR_CR4_WP1_POS           (0U)
#define PWR_CR4_WP1_MSK           (0x1UL << PWR_CR4_WP1_POS)                   /*!< 0x00000001 */
#define PWR_CR4_WP1               PWR_CR4_WP1_MSK                              /*!< Wake-Up Pin 1 polarity */
#define PWR_CR4_WP2_POS           (1U)
#define PWR_CR4_WP2_MSK           (0x1UL << PWR_CR4_WP2_POS)                   /*!< 0x00000002 */
#define PWR_CR4_WP2               PWR_CR4_WP2_MSK                              /*!< Wake-Up Pin 2 polarity */
#define PWR_CR4_WP3_POS           (2U)
#define PWR_CR4_WP3_MSK           (0x1UL << PWR_CR4_WP3_POS)                   /*!< 0x00000004 */
#define PWR_CR4_WP3               PWR_CR4_WP3_MSK                              /*!< Wake-Up Pin 3 polarity */
#define PWR_CR4_WP4_POS           (3U)
#define PWR_CR4_WP4_MSK           (0x1UL << PWR_CR4_WP4_POS)                   /*!< 0x00000008 */
#define PWR_CR4_WP4               PWR_CR4_WP4_MSK                              /*!< Wake-Up Pin 4 polarity */
#define PWR_CR4_WP5_POS           (4U)
#define PWR_CR4_WP5_MSK           (0x1UL << PWR_CR4_WP5_POS)                   /*!< 0x00000010 */
#define PWR_CR4_WP5               PWR_CR4_WP5_MSK                              /*!< Wake-Up Pin 5 polarity */
#define PWR_CR4_WP6_POS           (5U)
#define PWR_CR4_WP6_MSK           (0x1UL << PWR_CR4_WP6_POS)                   /*!< 0x00000020 */
#define PWR_CR4_WP6               PWR_CR4_WP6_MSK                              /*!< Wake-Up Pin 6 polarity */
#define PWR_CR4_VBE_POS           (8U)
#define PWR_CR4_VBE_MSK           (0x1UL << PWR_CR4_VBE_POS)                   /*!< 0x00000100 */
#define PWR_CR4_VBE               PWR_CR4_VBE_MSK                              /*!< VBAT Battery charging Enable  */
#define PWR_CR4_VBRS_POS          (9U)
#define PWR_CR4_VBRS_MSK          (0x1UL << PWR_CR4_VBRS_POS)                  /*!< 0x00000200 */
#define PWR_CR4_VBRS              PWR_CR4_VBRS_MSK                             /*!< VBAT Battery charging Resistor Selection */

/********************  Bit definition for PWR_SR1 register  ********************/
#define PWR_SR1_WUF_POS           (0U)
#define PWR_SR1_WUF_MSK           (0x3FUL << PWR_SR1_WUF_POS)                  /*!< 0x0000003F */
#define PWR_SR1_WUF               PWR_SR1_WUF_MSK                              /*!< Wakeup Flags  */
#define PWR_SR1_WUF1_POS          (0U)
#define PWR_SR1_WUF1_MSK          (0x1UL << PWR_SR1_WUF1_POS)                  /*!< 0x00000001 */
#define PWR_SR1_WUF1              PWR_SR1_WUF1_MSK                             /*!< Wakeup Flag 1 */
#define PWR_SR1_WUF2_POS          (1U)
#define PWR_SR1_WUF2_MSK          (0x1UL << PWR_SR1_WUF2_POS)                  /*!< 0x00000002 */
#define PWR_SR1_WUF2              PWR_SR1_WUF2_MSK                             /*!< Wakeup Flag 2 */
#define PWR_SR1_WUF3_POS          (2U)
#define PWR_SR1_WUF3_MSK          (0x1UL << PWR_SR1_WUF3_POS)                  /*!< 0x00000004 */
#define PWR_SR1_WUF3              PWR_SR1_WUF3_MSK                             /*!< Wakeup Flag 3 */
#define PWR_SR1_WUF4_POS          (3U)
#define PWR_SR1_WUF4_MSK          (0x1UL << PWR_SR1_WUF4_POS)                  /*!< 0x00000008 */
#define PWR_SR1_WUF4              PWR_SR1_WUF4_MSK                             /*!< Wakeup Flag 4 */
#define PWR_SR1_WUF5_POS          (4U)
#define PWR_SR1_WUF5_MSK          (0x1UL << PWR_SR1_WUF5_POS)                  /*!< 0x00000010 */
#define PWR_SR1_WUF5              PWR_SR1_WUF5_MSK                             /*!< Wakeup Flag 5 */
#define PWR_SR1_WUF6_POS          (5U)
#define PWR_SR1_WUF6_MSK          (0x1UL << PWR_SR1_WUF6_POS)                  /*!< 0x00000020 */
#define PWR_SR1_WUF6              PWR_SR1_WUF6_MSK                             /*!< Wakeup Flag 6 */
#define PWR_SR1_SBF_POS           (8U)
#define PWR_SR1_SBF_MSK           (0x1UL << PWR_SR1_SBF_POS)                   /*!< 0x00000100 */
#define PWR_SR1_SBF               PWR_SR1_SBF_MSK                              /*!< Standby Flag  */
#define PWR_SR1_WUFI_POS          (15U)
#define PWR_SR1_WUFI_MSK          (0x1UL << PWR_SR1_WUFI_POS)                  /*!< 0x00008000 */
#define PWR_SR1_WUFI              PWR_SR1_WUFI_MSK                             /*!< Wakeup Flag Internal */

