ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for PWR_SR2 register  ********************/
#define PWR_SR2_FLASH_RDY_POS     (7U)
#define PWR_SR2_FLASH_RDY_MSK     (0x1UL << PWR_SR2_FLASH_RDY_POS)             /*!< 0x00000080 */
#define PWR_SR2_FLASH_RDY         PWR_SR2_FLASH_RDY_MSK                        /*!< Flash Ready */
#define PWR_SR2_REGLPS_POS        (8U)
#define PWR_SR2_REGLPS_MSK        (0x1UL << PWR_SR2_REGLPS_POS)                /*!< 0x00000100 */
#define PWR_SR2_REGLPS            PWR_SR2_REGLPS_MSK                           /*!< Regulator Low Power started */
#define PWR_SR2_REGLPF_POS        (9U)
#define PWR_SR2_REGLPF_MSK        (0x1UL << PWR_SR2_REGLPF_POS)                /*!< 0x00000200 */
#define PWR_SR2_REGLPF            PWR_SR2_REGLPF_MSK                           /*!< Regulator Low Power flag    */
#define PWR_SR2_VOSF_POS          (10U)
#define PWR_SR2_VOSF_MSK          (0x1UL << PWR_SR2_VOSF_POS)                  /*!< 0x00000400 */
#define PWR_SR2_VOSF              PWR_SR2_VOSF_MSK                             /*!< Voltage Scaling Flag */
#define PWR_SR2_PVDO_POS          (11U)
#define PWR_SR2_PVDO_MSK          (0x1UL << PWR_SR2_PVDO_POS)                  /*!< 0x00000800 */
#define PWR_SR2_PVDO              PWR_SR2_PVDO_MSK                             /*!< Power voltage detector output */
#define PWR_SR2_PVMO_USB_POS      (13U)
#define PWR_SR2_PVMO_USB_MSK      (0x1UL << PWR_SR2_PVMO_USB_POS)              /*!< 0x00002000 */
#define PWR_SR2_PVMO_USB          PWR_SR2_PVMO_USB_MSK                         /*!< USB Peripheral Voltage Monitoring Output */

/********************  Bit definition for PWR_SCR register  ********************/
#define PWR_SCR_CWUF_POS          (0U)
#define PWR_SCR_CWUF_MSK          (0x3FUL << PWR_SCR_CWUF_POS)                 /*!< 0x0000003F */
#define PWR_SCR_CWUF              PWR_SCR_CWUF_MSK                             /*!< Clear Wake-up Flags  */
#define PWR_SCR_CWUF1_POS         (0U)
#define PWR_SCR_CWUF1_MSK         (0x1UL << PWR_SCR_CWUF1_POS)                 /*!< 0x00000001 */
#define PWR_SCR_CWUF1             PWR_SCR_CWUF1_MSK                            /*!< Clear Wake-up Flag 1 */
#define PWR_SCR_CWUF2_POS         (1U)
#define PWR_SCR_CWUF2_MSK         (0x1UL << PWR_SCR_CWUF2_POS)                 /*!< 0x00000002 */
#define PWR_SCR_CWUF2             PWR_SCR_CWUF2_MSK                            /*!< Clear Wake-up Flag 2 */
#define PWR_SCR_CWUF3_POS         (2U)
#define PWR_SCR_CWUF3_MSK         (0x1UL << PWR_SCR_CWUF3_POS)                 /*!< 0x00000004 */
#define PWR_SCR_CWUF3             PWR_SCR_CWUF3_MSK                            /*!< Clear Wake-up Flag 3 */
#define PWR_SCR_CWUF4_POS         (3U)
#define PWR_SCR_CWUF4_MSK         (0x1UL << PWR_SCR_CWUF4_POS)                 /*!< 0x00000008 */
#define PWR_SCR_CWUF4             PWR_SCR_CWUF4_MSK                            /*!< Clear Wake-up Flag 4 */
#define PWR_SCR_CWUF5_POS         (4U)
#define PWR_SCR_CWUF5_MSK         (0x1UL << PWR_SCR_CWUF5_POS)                 /*!< 0x00000010 */
#define PWR_SCR_CWUF5             PWR_SCR_CWUF5_MSK                            /*!< Clear Wake-up Flag 5 */
#define PWR_SCR_CWUF6_POS         (5U)
#define PWR_SCR_CWUF6_MSK         (0x1UL << PWR_SCR_CWUF6_POS)                 /*!< 0x00000020 */
#define PWR_SCR_CWUF6             PWR_SCR_CWUF6_MSK                            /*!< Clear Wake-up Flag 6 */
#define PWR_SCR_CSBF_POS          (8U)
#define PWR_SCR_CSBF_MSK          (0x1UL << PWR_SCR_CSBF_POS)                  /*!< 0x00000100 */
#define PWR_SCR_CSBF              PWR_SCR_CSBF_MSK                             /*!< Clear Standby Flag  */

/********************  Bit definition for PWR_PUCRA register  *****************/
#define PWR_PUCRA_PU0_POS         (0U)
#define PWR_PUCRA_PU0_MSK         (0x1UL << PWR_PUCRA_PU0_POS)                 /*!< 0x00000001 */
#define PWR_PUCRA_PU0             PWR_PUCRA_PU0_MSK                            /*!< Pin PA0 Pull-Up set */
#define PWR_PUCRA_PU1_POS         (1U)
#define PWR_PUCRA_PU1_MSK         (0x1UL << PWR_PUCRA_PU1_POS)                 /*!< 0x00000002 */
#define PWR_PUCRA_PU1             PWR_PUCRA_PU1_MSK                            /*!< Pin PA1 Pull-Up set */
#define PWR_PUCRA_PU2_POS         (2U)
#define PWR_PUCRA_PU2_MSK         (0x1UL << PWR_PUCRA_PU2_POS)                 /*!< 0x00000004 */
#define PWR_PUCRA_PU2             PWR_PUCRA_PU2_MSK                            /*!< Pin PA2 Pull-Up set */
#define PWR_PUCRA_PU3_POS         (3U)
#define PWR_PUCRA_PU3_MSK         (0x1UL << PWR_PUCRA_PU3_POS)                 /*!< 0x00000008 */
#define PWR_PUCRA_PU3             PWR_PUCRA_PU3_MSK                            /*!< Pin PA3 Pull-Up set */
#define PWR_PUCRA_PU4_POS         (4U)
#define PWR_PUCRA_PU4_MSK         (0x1UL << PWR_PUCRA_PU4_POS)                 /*!< 0x00000010 */
#define PWR_PUCRA_PU4             PWR_PUCRA_PU4_MSK                            /*!< Pin PA4 Pull-Up set */
#define PWR_PUCRA_PU5_POS         (5U)
#define PWR_PUCRA_PU5_MSK         (0x1UL << PWR_PUCRA_PU5_POS)                 /*!< 0x00000020 */
#define PWR_PUCRA_PU5             PWR_PUCRA_PU5_MSK                            /*!< Pin PA5 Pull-Up set */
#define PWR_PUCRA_PU6_POS         (6U)
#define PWR_PUCRA_PU6_MSK         (0x1UL << PWR_PUCRA_PU6_POS)                 /*!< 0x00000040 */
#define PWR_PUCRA_PU6             PWR_PUCRA_PU6_MSK                            /*!< Pin PA6 Pull-Up set */
#define PWR_PUCRA_PU7_POS         (7U)
#define PWR_PUCRA_PU7_MSK         (0x1UL << PWR_PUCRA_PU7_POS)                 /*!< 0x00000080 */
#define PWR_PUCRA_PU7             PWR_PUCRA_PU7_MSK                            /*!< Pin PA7 Pull-Up set */
#define PWR_PUCRA_PU8_POS         (8U)
#define PWR_PUCRA_PU8_MSK         (0x1UL << PWR_PUCRA_PU8_POS)                 /*!< 0x00000100 */
#define PWR_PUCRA_PU8             PWR_PUCRA_PU8_MSK                            /*!< Pin PA8 Pull-Up set */
#define PWR_PUCRA_PU9_POS         (9U)
#define PWR_PUCRA_PU9_MSK         (0x1UL << PWR_PUCRA_PU9_POS)                 /*!< 0x00000200 */
#define PWR_PUCRA_PU9             PWR_PUCRA_PU9_MSK                            /*!< Pin PA9 Pull-Up set */
#define PWR_PUCRA_PU10_POS        (10U)
#define PWR_PUCRA_PU10_MSK        (0x1UL << PWR_PUCRA_PU10_POS)                /*!< 0x00000400 */
#define PWR_PUCRA_PU10            PWR_PUCRA_PU10_MSK                           /*!< Pin PA10 Pull-Up set */
#define PWR_PUCRA_PU11_POS        (11U)
#define PWR_PUCRA_PU11_MSK        (0x1UL << PWR_PUCRA_PU11_POS)                /*!< 0x00000800 */
#define PWR_PUCRA_PU11            PWR_PUCRA_PU11_MSK                           /*!< Pin PA11 Pull-Up set */
#define PWR_PUCRA_PU12_POS        (12U)
#define PWR_PUCRA_PU12_MSK        (0x1UL << PWR_PUCRA_PU12_POS)                /*!< 0x00001000 */
#define PWR_PUCRA_PU12            PWR_PUCRA_PU12_MSK                           /*!< Pin PA12 Pull-Up set */
#define PWR_PUCRA_PU13_POS        (13U)
#define PWR_PUCRA_PU13_MSK        (0x1UL << PWR_PUCRA_PU13_POS)                /*!< 0x00002000 */
#define PWR_PUCRA_PU13            PWR_PUCRA_PU13_MSK                           /*!< Pin PA13 Pull-Up set */
#define PWR_PUCRA_PU14_POS        (14U)
#define PWR_PUCRA_PU14_MSK        (0x1UL << PWR_PUCRA_PU14_POS)                /*!< 0x00004000 */
#define PWR_PUCRA_PU14            PWR_PUCRA_PU14_MSK                           /*!< Pin PA14 Pull-Up set */
#define PWR_PUCRA_PU15_POS        (15U)
#define PWR_PUCRA_PU15_MSK        (0x1UL << PWR_PUCRA_PU15_POS)                /*!< 0x00008000 */
#define PWR_PUCRA_PU15            PWR_PUCRA_PU15_MSK                           /*!< Pin PA15 Pull-Up set */

/********************  Bit definition for PWR_PDCRA register  *****************/
#define PWR_PDCRA_PD0_POS         (0U)
#define PWR_PDCRA_PD0_MSK         (0x1UL << PWR_PDCRA_PD0_POS)                 /*!< 0x00000001 */
#define PWR_PDCRA_PD0             PWR_PDCRA_PD0_MSK                            /*!< Pin PA0 Pull-Down set */
#define PWR_PDCRA_PD1_POS         (1U)
#define PWR_PDCRA_PD1_MSK         (0x1UL << PWR_PDCRA_PD1_POS)                 /*!< 0x00000002 */
#define PWR_PDCRA_PD1             PWR_PDCRA_PD1_MSK                            /*!< Pin PA1 Pull-Down set */
#define PWR_PDCRA_PD2_POS         (2U)
#define PWR_PDCRA_PD2_MSK         (0x1UL << PWR_PDCRA_PD2_POS)                 /*!< 0x00000004 */
#define PWR_PDCRA_PD2             PWR_PDCRA_PD2_MSK                            /*!< Pin PA2 Pull-Down set */
#define PWR_PDCRA_PD3_POS         (3U)
#define PWR_PDCRA_PD3_MSK         (0x1UL << PWR_PDCRA_PD3_POS)                 /*!< 0x00000008 */
#define PWR_PDCRA_PD3             PWR_PDCRA_PD3_MSK                            /*!< Pin PA3 Pull-Down set */
#define PWR_PDCRA_PD4_POS         (4U)
#define PWR_PDCRA_PD4_MSK         (0x1UL << PWR_PDCRA_PD4_POS)                 /*!< 0x00000010 */
#define PWR_PDCRA_PD4             PWR_PDCRA_PD4_MSK                            /*!< Pin PA4 Pull-Down set */
#define PWR_PDCRA_PD5_POS         (5U)
#define PWR_PDCRA_PD5_MSK         (0x1UL << PWR_PDCRA_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PDCRA_PD5             PWR_PDCRA_PD5_MSK                            /*!< Pin PA5 Pull-Down set */
#define PWR_PDCRA_PD6_POS         (6U)
#define PWR_PDCRA_PD6_MSK         (0x1UL << PWR_PDCRA_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PDCRA_PD6             PWR_PDCRA_PD6_MSK                            /*!< Pin PA6 Pull-Down set */
#define PWR_PDCRA_PD7_POS         (7U)
#define PWR_PDCRA_PD7_MSK         (0x1UL << PWR_PDCRA_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PDCRA_PD7             PWR_PDCRA_PD7_MSK                            /*!< Pin PA7 Pull-Down set */
#define PWR_PDCRA_PD8_POS         (8U)
#define PWR_PDCRA_PD8_MSK         (0x1UL << PWR_PDCRA_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PDCRA_PD8             PWR_PDCRA_PD8_MSK                            /*!< Pin PA8 Pull-Down set */
#define PWR_PDCRA_PD9_POS         (9U)
#define PWR_PDCRA_PD9_MSK         (0x1UL << PWR_PDCRA_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PDCRA_PD9             PWR_PDCRA_PD9_MSK                            /*!< Pin PA9 Pull-Down set */
#define PWR_PDCRA_PD10_POS        (10U)
#define PWR_PDCRA_PD10_MSK        (0x1UL << PWR_PDCRA_PD10_POS)                /*!< 0x00000400 */
#define PWR_PDCRA_PD10            PWR_PDCRA_PD10_MSK                           /*!< Pin PA10 Pull-Down set */
#define PWR_PDCRA_PD11_POS        (11U)
#define PWR_PDCRA_PD11_MSK        (0x1UL << PWR_PDCRA_PD11_POS)                /*!< 0x00000800 */
#define PWR_PDCRA_PD11            PWR_PDCRA_PD11_MSK                           /*!< Pin PA11 Pull-Down set */
#define PWR_PDCRA_PD12_POS        (12U)
#define PWR_PDCRA_PD12_MSK        (0x1UL << PWR_PDCRA_PD12_POS)                /*!< 0x00001000 */
#define PWR_PDCRA_PD12            PWR_PDCRA_PD12_MSK                           /*!< Pin PA12 Pull-Down set */
#define PWR_PDCRA_PD13_POS        (13U)
#define PWR_PDCRA_PD13_MSK        (0x1UL << PWR_PDCRA_PD13_POS)                /*!< 0x00002000 */
#define PWR_PDCRA_PD13            PWR_PDCRA_PD13_MSK                           /*!< Pin PA13 Pull-Down set */
#define PWR_PDCRA_PD14_POS        (14U)
#define PWR_PDCRA_PD14_MSK        (0x1UL << PWR_PDCRA_PD14_POS)                /*!< 0x00004000 */
#define PWR_PDCRA_PD14            PWR_PDCRA_PD14_MSK                           /*!< Pin PA14 Pull-Down set */
#define PWR_PDCRA_PD15_POS        (15U)
#define PWR_PDCRA_PD15_MSK        (0x1UL << PWR_PDCRA_PD15_POS)                /*!< 0x00008000 */
#define PWR_PDCRA_PD15            PWR_PDCRA_PD15_MSK                           /*!< Pin PA15 Pull-Down set */

