ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for PWR_PUCRB register  *****************/
#define PWR_PUCRB_PU0_POS         (0U)
#define PWR_PUCRB_PU0_MSK         (0x1UL << PWR_PUCRB_PU0_POS)                 /*!< 0x00000001 */
#define PWR_PUCRB_PU0             PWR_PUCRB_PU0_MSK                            /*!< Pin PB0 Pull-Up set */
#define PWR_PUCRB_PU1_POS         (1U)
#define PWR_PUCRB_PU1_MSK         (0x1UL << PWR_PUCRB_PU1_POS)                 /*!< 0x00000002 */
#define PWR_PUCRB_PU1             PWR_PUCRB_PU1_MSK                            /*!< Pin PB1 Pull-Up set */
#define PWR_PUCRB_PU2_POS         (2U)
#define PWR_PUCRB_PU2_MSK         (0x1UL << PWR_PUCRB_PU2_POS)                 /*!< 0x00000004 */
#define PWR_PUCRB_PU2             PWR_PUCRB_PU2_MSK                            /*!< Pin PB2 Pull-Up set */
#define PWR_PUCRB_PU3_POS         (3U)
#define PWR_PUCRB_PU3_MSK         (0x1UL << PWR_PUCRB_PU3_POS)                 /*!< 0x00000008 */
#define PWR_PUCRB_PU3             PWR_PUCRB_PU3_MSK                            /*!< Pin PB3 Pull-Up set */
#define PWR_PUCRB_PU4_POS         (4U)
#define PWR_PUCRB_PU4_MSK         (0x1UL << PWR_PUCRB_PU4_POS)                 /*!< 0x00000010 */
#define PWR_PUCRB_PU4             PWR_PUCRB_PU4_MSK                            /*!< Pin PB4 Pull-Up set */
#define PWR_PUCRB_PU5_POS         (5U)
#define PWR_PUCRB_PU5_MSK         (0x1UL << PWR_PUCRB_PU5_POS)                 /*!< 0x00000020 */
#define PWR_PUCRB_PU5             PWR_PUCRB_PU5_MSK                            /*!< Pin PB5 Pull-Up set */
#define PWR_PUCRB_PU6_POS         (6U)
#define PWR_PUCRB_PU6_MSK         (0x1UL << PWR_PUCRB_PU6_POS)                 /*!< 0x00000040 */
#define PWR_PUCRB_PU6             PWR_PUCRB_PU6_MSK                            /*!< Pin PB6 Pull-Up set */
#define PWR_PUCRB_PU7_POS         (7U)
#define PWR_PUCRB_PU7_MSK         (0x1UL << PWR_PUCRB_PU7_POS)                 /*!< 0x00000080 */
#define PWR_PUCRB_PU7             PWR_PUCRB_PU7_MSK                            /*!< Pin PB7 Pull-Up set */
#define PWR_PUCRB_PU8_POS         (8U)
#define PWR_PUCRB_PU8_MSK         (0x1UL << PWR_PUCRB_PU8_POS)                 /*!< 0x00000100 */
#define PWR_PUCRB_PU8             PWR_PUCRB_PU8_MSK                            /*!< Pin PB8 Pull-Up set */
#define PWR_PUCRB_PU9_POS         (9U)
#define PWR_PUCRB_PU9_MSK         (0x1UL << PWR_PUCRB_PU9_POS)                 /*!< 0x00000200 */
#define PWR_PUCRB_PU9             PWR_PUCRB_PU9_MSK                            /*!< Pin PB9 Pull-Up set */
#define PWR_PUCRB_PU10_POS        (10U)
#define PWR_PUCRB_PU10_MSK        (0x1UL << PWR_PUCRB_PU10_POS)                /*!< 0x00000400 */
#define PWR_PUCRB_PU10            PWR_PUCRB_PU10_MSK                           /*!< Pin PB10 Pull-Up set */
#define PWR_PUCRB_PU11_POS        (11U)
#define PWR_PUCRB_PU11_MSK        (0x1UL << PWR_PUCRB_PU11_POS)                /*!< 0x00000800 */
#define PWR_PUCRB_PU11            PWR_PUCRB_PU11_MSK                           /*!< Pin PB11 Pull-Up set */
#define PWR_PUCRB_PU12_POS        (12U)
#define PWR_PUCRB_PU12_MSK        (0x1UL << PWR_PUCRB_PU12_POS)                /*!< 0x00001000 */
#define PWR_PUCRB_PU12            PWR_PUCRB_PU12_MSK                           /*!< Pin PB12 Pull-Up set */
#define PWR_PUCRB_PU13_POS        (13U)
#define PWR_PUCRB_PU13_MSK        (0x1UL << PWR_PUCRB_PU13_POS)                /*!< 0x00002000 */
#define PWR_PUCRB_PU13            PWR_PUCRB_PU13_MSK                           /*!< Pin PB13 Pull-Up set */
#define PWR_PUCRB_PU14_POS        (14U)
#define PWR_PUCRB_PU14_MSK        (0x1UL << PWR_PUCRB_PU14_POS)                /*!< 0x00004000 */
#define PWR_PUCRB_PU14            PWR_PUCRB_PU14_MSK                           /*!< Pin PB14 Pull-Up set */
#define PWR_PUCRB_PU15_POS        (15U)
#define PWR_PUCRB_PU15_MSK        (0x1UL << PWR_PUCRB_PU15_POS)                /*!< 0x00008000 */
#define PWR_PUCRB_PU15            PWR_PUCRB_PU15_MSK                           /*!< Pin PB15 Pull-Up set */

/********************  Bit definition for PWR_PDCRB register  *****************/
#define PWR_PDCRB_PD0_POS         (0U)
#define PWR_PDCRB_PD0_MSK         (0x1UL << PWR_PDCRB_PD0_POS)                 /*!< 0x00000001 */
#define PWR_PDCRB_PD0             PWR_PDCRB_PD0_MSK                            /*!< Pin PB0 Pull-Down set */
#define PWR_PDCRB_PD1_POS         (1U)
#define PWR_PDCRB_PD1_MSK         (0x1UL << PWR_PDCRB_PD1_POS)                 /*!< 0x00000002 */
#define PWR_PDCRB_PD1             PWR_PDCRB_PD1_MSK                            /*!< Pin PB1 Pull-Down set */
#define PWR_PDCRB_PD2_POS         (2U)
#define PWR_PDCRB_PD2_MSK         (0x1UL << PWR_PDCRB_PD2_POS)                 /*!< 0x00000004 */
#define PWR_PDCRB_PD2             PWR_PDCRB_PD2_MSK                            /*!< Pin PB2 Pull-Down set */
#define PWR_PDCRB_PD3_POS         (3U)
#define PWR_PDCRB_PD3_MSK         (0x1UL << PWR_PDCRB_PD3_POS)                 /*!< 0x00000008 */
#define PWR_PDCRB_PD3             PWR_PDCRB_PD3_MSK                            /*!< Pin PB3 Pull-Down set */
#define PWR_PDCRB_PD4_POS         (4U)
#define PWR_PDCRB_PD4_MSK         (0x1UL << PWR_PDCRB_PD4_POS)                 /*!< 0x00000010 */
#define PWR_PDCRB_PD4             PWR_PDCRB_PD4_MSK                            /*!< Pin PB4 Pull-Down set */
#define PWR_PDCRB_PD5_POS         (5U)
#define PWR_PDCRB_PD5_MSK         (0x1UL << PWR_PDCRB_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PDCRB_PD5             PWR_PDCRB_PD5_MSK                            /*!< Pin PB5 Pull-Down set */
#define PWR_PDCRB_PD6_POS         (6U)
#define PWR_PDCRB_PD6_MSK         (0x1UL << PWR_PDCRB_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PDCRB_PD6             PWR_PDCRB_PD6_MSK                            /*!< Pin PB6 Pull-Down set */
#define PWR_PDCRB_PD7_POS         (7U)
#define PWR_PDCRB_PD7_MSK         (0x1UL << PWR_PDCRB_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PDCRB_PD7             PWR_PDCRB_PD7_MSK                            /*!< Pin PB7 Pull-Down set */
#define PWR_PDCRB_PD8_POS         (8U)
#define PWR_PDCRB_PD8_MSK         (0x1UL << PWR_PDCRB_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PDCRB_PD8             PWR_PDCRB_PD8_MSK                            /*!< Pin PB8 Pull-Down set */
#define PWR_PDCRB_PD9_POS         (9U)
#define PWR_PDCRB_PD9_MSK         (0x1UL << PWR_PDCRB_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PDCRB_PD9             PWR_PDCRB_PD9_MSK                            /*!< Pin PB9 Pull-Down set */
#define PWR_PDCRB_PD10_POS        (10U)
#define PWR_PDCRB_PD10_MSK        (0x1UL << PWR_PDCRB_PD10_POS)                /*!< 0x00000400 */
#define PWR_PDCRB_PD10            PWR_PDCRB_PD10_MSK                           /*!< Pin PB10 Pull-Down set */
#define PWR_PDCRB_PD11_POS        (11U)
#define PWR_PDCRB_PD11_MSK        (0x1UL << PWR_PDCRB_PD11_POS)                /*!< 0x00000800 */
#define PWR_PDCRB_PD11            PWR_PDCRB_PD11_MSK                           /*!< Pin PB11 Pull-Down set */
#define PWR_PDCRB_PD12_POS        (12U)
#define PWR_PDCRB_PD12_MSK        (0x1UL << PWR_PDCRB_PD12_POS)                /*!< 0x00001000 */
#define PWR_PDCRB_PD12            PWR_PDCRB_PD12_MSK                           /*!< Pin PB12 Pull-Down set */
#define PWR_PDCRB_PD13_POS        (13U)
#define PWR_PDCRB_PD13_MSK        (0x1UL << PWR_PDCRB_PD13_POS)                /*!< 0x00002000 */
#define PWR_PDCRB_PD13            PWR_PDCRB_PD13_MSK                           /*!< Pin PB13 Pull-Down set */
#define PWR_PDCRB_PD14_POS        (14U)
#define PWR_PDCRB_PD14_MSK        (0x1UL << PWR_PDCRB_PD14_POS)                /*!< 0x00004000 */
#define PWR_PDCRB_PD14            PWR_PDCRB_PD14_MSK                           /*!< Pin PB14 Pull-Down set */
#define PWR_PDCRB_PD15_POS        (15U)
#define PWR_PDCRB_PD15_MSK        (0x1UL << PWR_PDCRB_PD15_POS)                /*!< 0x00008000 */
#define PWR_PDCRB_PD15            PWR_PDCRB_PD15_MSK                           /*!< Pin PB15 Pull-Down set */

