ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for PWR_PUCRC register  *****************/
#define PWR_PUCRC_PU0_POS         (0U)
#define PWR_PUCRC_PU0_MSK         (0x1UL << PWR_PUCRC_PU0_POS)                 /*!< 0x00000001 */
#define PWR_PUCRC_PU0             PWR_PUCRC_PU0_MSK                            /*!< Pin PC0 Pull-Up set */
#define PWR_PUCRC_PU1_POS         (1U)
#define PWR_PUCRC_PU1_MSK         (0x1UL << PWR_PUCRC_PU1_POS)                 /*!< 0x00000002 */
#define PWR_PUCRC_PU1             PWR_PUCRC_PU1_MSK                            /*!< Pin PC1 Pull-Up set */
#define PWR_PUCRC_PU2_POS         (2U)
#define PWR_PUCRC_PU2_MSK         (0x1UL << PWR_PUCRC_PU2_POS)                 /*!< 0x00000004 */
#define PWR_PUCRC_PU2             PWR_PUCRC_PU2_MSK                            /*!< Pin PC2 Pull-Up set */
#define PWR_PUCRC_PU3_POS         (3U)
#define PWR_PUCRC_PU3_MSK         (0x1UL << PWR_PUCRC_PU3_POS)                 /*!< 0x00000008 */
#define PWR_PUCRC_PU3             PWR_PUCRC_PU3_MSK                            /*!< Pin PC3 Pull-Up set */
#define PWR_PUCRC_PU4_POS         (4U)
#define PWR_PUCRC_PU4_MSK         (0x1UL << PWR_PUCRC_PU4_POS)                 /*!< 0x00000010 */
#define PWR_PUCRC_PU4             PWR_PUCRC_PU4_MSK                            /*!< Pin PC4 Pull-Up set */
#define PWR_PUCRC_PU5_POS         (5U)
#define PWR_PUCRC_PU5_MSK         (0x1UL << PWR_PUCRC_PU5_POS)                 /*!< 0x00000020 */
#define PWR_PUCRC_PU5             PWR_PUCRC_PU5_MSK                            /*!< Pin PC5 Pull-Up set */
#define PWR_PUCRC_PU6_POS         (6U)
#define PWR_PUCRC_PU6_MSK         (0x1UL << PWR_PUCRC_PU6_POS)                 /*!< 0x00000040 */
#define PWR_PUCRC_PU6             PWR_PUCRC_PU6_MSK                            /*!< Pin PC6 Pull-Up set */
#define PWR_PUCRC_PU7_POS         (7U)
#define PWR_PUCRC_PU7_MSK         (0x1UL << PWR_PUCRC_PU7_POS)                 /*!< 0x00000080 */
#define PWR_PUCRC_PU7             PWR_PUCRC_PU7_MSK                            /*!< Pin PC7 Pull-Up set */
#define PWR_PUCRC_PU8_POS         (8U)
#define PWR_PUCRC_PU8_MSK         (0x1UL << PWR_PUCRC_PU8_POS)                 /*!< 0x00000100 */
#define PWR_PUCRC_PU8             PWR_PUCRC_PU8_MSK                            /*!< Pin PC8 Pull-Up set */
#define PWR_PUCRC_PU9_POS         (9U)
#define PWR_PUCRC_PU9_MSK         (0x1UL << PWR_PUCRC_PU9_POS)                 /*!< 0x00000200 */
#define PWR_PUCRC_PU9             PWR_PUCRC_PU9_MSK                            /*!< Pin PC9 Pull-Up set */
#define PWR_PUCRC_PU10_POS        (10U)
#define PWR_PUCRC_PU10_MSK        (0x1UL << PWR_PUCRC_PU10_POS)                /*!< 0x00000400 */
#define PWR_PUCRC_PU10            PWR_PUCRC_PU10_MSK                           /*!< Pin PC10 Pull-Up set */
#define PWR_PUCRC_PU11_POS        (11U)
#define PWR_PUCRC_PU11_MSK        (0x1UL << PWR_PUCRC_PU11_POS)                /*!< 0x00000800 */
#define PWR_PUCRC_PU11            PWR_PUCRC_PU11_MSK                           /*!< Pin PC11 Pull-Up set */
#define PWR_PUCRC_PU12_POS        (12U)
#define PWR_PUCRC_PU12_MSK        (0x1UL << PWR_PUCRC_PU12_POS)                /*!< 0x00001000 */
#define PWR_PUCRC_PU12            PWR_PUCRC_PU12_MSK                           /*!< Pin PC12 Pull-Up set */
#define PWR_PUCRC_PU13_POS        (13U)
#define PWR_PUCRC_PU13_MSK        (0x1UL << PWR_PUCRC_PU13_POS)                /*!< 0x00002000 */
#define PWR_PUCRC_PU13            PWR_PUCRC_PU13_MSK                           /*!< Pin PC13 Pull-Up set */
#define PWR_PUCRC_PU14_POS        (14U)
#define PWR_PUCRC_PU14_MSK        (0x1UL << PWR_PUCRC_PU14_POS)                /*!< 0x00004000 */
#define PWR_PUCRC_PU14            PWR_PUCRC_PU14_MSK                           /*!< Pin PC14 Pull-Up set */
#define PWR_PUCRC_PU15_POS        (15U)
#define PWR_PUCRC_PU15_MSK        (0x1UL << PWR_PUCRC_PU15_POS)                /*!< 0x00008000 */
#define PWR_PUCRC_PU15            PWR_PUCRC_PU15_MSK                           /*!< Pin PC15 Pull-Up set */

/********************  Bit definition for PWR_PDCRC register  *****************/
#define PWR_PDCRC_PD0_POS         (0U)
#define PWR_PDCRC_PD0_MSK         (0x1UL << PWR_PDCRC_PD0_POS)                 /*!< 0x00000001 */
#define PWR_PDCRC_PD0             PWR_PDCRC_PD0_MSK                            /*!< Pin PC0 Pull-Down set */
#define PWR_PDCRC_PD1_POS         (1U)
#define PWR_PDCRC_PD1_MSK         (0x1UL << PWR_PDCRC_PD1_POS)                 /*!< 0x00000002 */
#define PWR_PDCRC_PD1             PWR_PDCRC_PD1_MSK                            /*!< Pin PC1 Pull-Down set */
#define PWR_PDCRC_PD2_POS         (2U)
#define PWR_PDCRC_PD2_MSK         (0x1UL << PWR_PDCRC_PD2_POS)                 /*!< 0x00000004 */
#define PWR_PDCRC_PD2             PWR_PDCRC_PD2_MSK                            /*!< Pin PC2 Pull-Down set */
#define PWR_PDCRC_PD3_POS         (3U)
#define PWR_PDCRC_PD3_MSK         (0x1UL << PWR_PDCRC_PD3_POS)                 /*!< 0x00000008 */
#define PWR_PDCRC_PD3             PWR_PDCRC_PD3_MSK                            /*!< Pin PC3 Pull-Down set */
#define PWR_PDCRC_PD4_POS         (4U)
#define PWR_PDCRC_PD4_MSK         (0x1UL << PWR_PDCRC_PD4_POS)                 /*!< 0x00000010 */
#define PWR_PDCRC_PD4             PWR_PDCRC_PD4_MSK                            /*!< Pin PC4 Pull-Down set */
#define PWR_PDCRC_PD5_POS         (5U)
#define PWR_PDCRC_PD5_MSK         (0x1UL << PWR_PDCRC_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PDCRC_PD5             PWR_PDCRC_PD5_MSK                            /*!< Pin PC5 Pull-Down set */
#define PWR_PDCRC_PD6_POS         (6U)
#define PWR_PDCRC_PD6_MSK         (0x1UL << PWR_PDCRC_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PDCRC_PD6             PWR_PDCRC_PD6_MSK                            /*!< Pin PC6 Pull-Down set */
#define PWR_PDCRC_PD7_POS         (7U)
#define PWR_PDCRC_PD7_MSK         (0x1UL << PWR_PDCRC_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PDCRC_PD7             PWR_PDCRC_PD7_MSK                            /*!< Pin PC7 Pull-Down set */
#define PWR_PDCRC_PD8_POS         (8U)
#define PWR_PDCRC_PD8_MSK         (0x1UL << PWR_PDCRC_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PDCRC_PD8             PWR_PDCRC_PD8_MSK                            /*!< Pin PC8 Pull-Down set */
#define PWR_PDCRC_PD9_POS         (9U)
#define PWR_PDCRC_PD9_MSK         (0x1UL << PWR_PDCRC_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PDCRC_PD9             PWR_PDCRC_PD9_MSK                            /*!< Pin PC9 Pull-Down set */
#define PWR_PDCRC_PD10_POS        (10U)
#define PWR_PDCRC_PD10_MSK        (0x1UL << PWR_PDCRC_PD10_POS)                /*!< 0x00000400 */
#define PWR_PDCRC_PD10            PWR_PDCRC_PD10_MSK                           /*!< Pin PC10 Pull-Down set */
#define PWR_PDCRC_PD11_POS        (11U)
#define PWR_PDCRC_PD11_MSK        (0x1UL << PWR_PDCRC_PD11_POS)                /*!< 0x00000800 */
#define PWR_PDCRC_PD11            PWR_PDCRC_PD11_MSK                           /*!< Pin PC11 Pull-Down set */
#define PWR_PDCRC_PD12_POS        (12U)
#define PWR_PDCRC_PD12_MSK        (0x1UL << PWR_PDCRC_PD12_POS)                /*!< 0x00001000 */
#define PWR_PDCRC_PD12            PWR_PDCRC_PD12_MSK                           /*!< Pin PC12 Pull-Down set */
#define PWR_PDCRC_PD13_POS        (13U)
#define PWR_PDCRC_PD13_MSK        (0x1UL << PWR_PDCRC_PD13_POS)                /*!< 0x00002000 */
#define PWR_PDCRC_PD13            PWR_PDCRC_PD13_MSK                           /*!< Pin PC13 Pull-Down set */
#define PWR_PDCRC_PD14_POS        (14U)
#define PWR_PDCRC_PD14_MSK        (0x1UL << PWR_PDCRC_PD14_POS)                /*!< 0x00004000 */
#define PWR_PDCRC_PD14            PWR_PDCRC_PD14_MSK                           /*!< Pin PC14 Pull-Down set */
#define PWR_PDCRC_PD15_POS        (15U)
#define PWR_PDCRC_PD15_MSK        (0x1UL << PWR_PDCRC_PD15_POS)                /*!< 0x00008000 */
#define PWR_PDCRC_PD15            PWR_PDCRC_PD15_MSK                           /*!< Pin PC15 Pull-Down set */

