ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for PWR_PUCRD register  *****************/
#define PWR_PUCRD_PU0_POS         (0U)
#define PWR_PUCRD_PU0_MSK         (0x1UL << PWR_PUCRD_PU0_POS)                 /*!< 0x00000001 */
#define PWR_PUCRD_PU0             PWR_PUCRD_PU0_MSK                            /*!< Pin PD0 Pull-Up set */
#define PWR_PUCRD_PU1_POS         (1U)
#define PWR_PUCRD_PU1_MSK         (0x1UL << PWR_PUCRD_PU1_POS)                 /*!< 0x00000002 */
#define PWR_PUCRD_PU1             PWR_PUCRD_PU1_MSK                            /*!< Pin PD1 Pull-Up set */
#define PWR_PUCRD_PU2_POS         (2U)
#define PWR_PUCRD_PU2_MSK         (0x1UL << PWR_PUCRD_PU2_POS)                 /*!< 0x00000004 */
#define PWR_PUCRD_PU2             PWR_PUCRD_PU2_MSK                            /*!< Pin PD2 Pull-Up set */
#define PWR_PUCRD_PU3_POS         (3U)
#define PWR_PUCRD_PU3_MSK         (0x1UL << PWR_PUCRD_PU3_POS)                 /*!< 0x00000008 */
#define PWR_PUCRD_PU3             PWR_PUCRD_PU3_MSK                            /*!< Pin PD3 Pull-Up set */
#define PWR_PUCRD_PU4_POS         (4U)
#define PWR_PUCRD_PU4_MSK         (0x1UL << PWR_PUCRD_PU4_POS)                 /*!< 0x00000010 */
#define PWR_PUCRD_PU4             PWR_PUCRD_PU4_MSK                            /*!< Pin PD4 Pull-Up set */
#define PWR_PUCRD_PU5_POS         (5U)
#define PWR_PUCRD_PU5_MSK         (0x1UL << PWR_PUCRD_PU5_POS)                 /*!< 0x00000020 */
#define PWR_PUCRD_PU5             PWR_PUCRD_PU5_MSK                            /*!< Pin PD5 Pull-Up set */
#define PWR_PUCRD_PU6_POS         (6U)
#define PWR_PUCRD_PU6_MSK         (0x1UL << PWR_PUCRD_PU6_POS)                 /*!< 0x00000040 */
#define PWR_PUCRD_PU6             PWR_PUCRD_PU6_MSK                            /*!< Pin PD6 Pull-Up set */
#define PWR_PUCRD_PU8_POS         (8U)
#define PWR_PUCRD_PU8_MSK         (0x1UL << PWR_PUCRD_PU8_POS)                 /*!< 0x00000100 */
#define PWR_PUCRD_PU8             PWR_PUCRD_PU8_MSK                            /*!< Pin PD8 Pull-Up set */
#define PWR_PUCRD_PU9_POS         (9U)
#define PWR_PUCRD_PU9_MSK         (0x1UL << PWR_PUCRD_PU9_POS)                 /*!< 0x00000200 */
#define PWR_PUCRD_PU9             PWR_PUCRD_PU9_MSK                            /*!< Pin PD9 Pull-Up set */
#define PWR_PUCRD_PD10_POS        (10U)
#define PWR_PUCRD_PD10_MSK        (0x1UL << PWR_PUCRD_PD10_POS)                /*!< 0x00000400 */
#define PWR_PUCRD_PD10            PWR_PUCRD_PD10_MSK                           /*!< Pin PD10 Pull-Up set */
#define PWR_PUCRD_PD11_POS        (11U)
#define PWR_PUCRD_PD11_MSK        (0x1UL << PWR_PUCRD_PD11_POS)                /*!< 0x00000800 */
#define PWR_PUCRD_PD11            PWR_PUCRD_PD11_MSK                           /*!< Pin PD11 Pull-Up set */
#define PWR_PUCRD_PD12_POS        (12U)
#define PWR_PUCRD_PD12_MSK        (0x1UL << PWR_PUCRD_PD12_POS)                /*!< 0x00001000 */
#define PWR_PUCRD_PD12            PWR_PUCRD_PD12_MSK                           /*!< Pin PD12 Pull-Up set */
#define PWR_PUCRD_PD13_POS        (13U)
#define PWR_PUCRD_PD13_MSK        (0x1UL << PWR_PUCRD_PD13_POS)                /*!< 0x00002000 */
#define PWR_PUCRD_PD13            PWR_PUCRD_PD13_MSK                           /*!< Pin PD13 Pull-Up set */
#define PWR_PUCRD_PD14_POS        (14U)
#define PWR_PUCRD_PD14_MSK        (0x1UL << PWR_PUCRD_PD14_POS)                /*!< 0x00004000 */
#define PWR_PUCRD_PD14            PWR_PUCRD_PD14_MSK                           /*!< Pin PD14 Pull-Up set */
#define PWR_PUCRD_PD15_POS        (15U)
#define PWR_PUCRD_PD15_MSK        (0x1UL << PWR_PUCRD_PD15_POS)                /*!< 0x00008000 */
#define PWR_PUCRD_PD15            PWR_PUCRD_PD15_MSK                           /*!< Pin PD15 Pull-Up set */

/********************  Bit definition for PWR_PDCRD register  *****************/
#define PWR_PDCRD_PD0_POS         (0U)
#define PWR_PDCRD_PD0_MSK         (0x1UL << PWR_PDCRD_PD0_POS)                 /*!< 0x00000001 */
#define PWR_PDCRD_PD0             PWR_PDCRD_PD0_MSK                            /*!< Pin PD0 Pull-Down set */
#define PWR_PDCRD_PD1_POS         (1U)
#define PWR_PDCRD_PD1_MSK         (0x1UL << PWR_PDCRD_PD1_POS)                 /*!< 0x00000002 */
#define PWR_PDCRD_PD1             PWR_PDCRD_PD1_MSK                            /*!< Pin PD1 Pull-Down set */
#define PWR_PDCRD_PD2_POS         (2U)
#define PWR_PDCRD_PD2_MSK         (0x1UL << PWR_PDCRD_PD2_POS)                 /*!< 0x00000004 */
#define PWR_PDCRD_PD2             PWR_PDCRD_PD2_MSK                            /*!< Pin PD2 Pull-Down set */
#define PWR_PDCRD_PD3_POS         (3U)
#define PWR_PDCRD_PD3_MSK         (0x1UL << PWR_PDCRD_PD3_POS)                 /*!< 0x00000008 */
#define PWR_PDCRD_PD3             PWR_PDCRD_PD3_MSK                            /*!< Pin PD3 Pull-Down set */
#define PWR_PDCRD_PD4_POS         (4U)
#define PWR_PDCRD_PD4_MSK         (0x1UL << PWR_PDCRD_PD4_POS)                 /*!< 0x00000010 */
#define PWR_PDCRD_PD4             PWR_PDCRD_PD4_MSK                            /*!< Pin PD4 Pull-Down set */
#define PWR_PDCRD_PD5_POS         (5U)
#define PWR_PDCRD_PD5_MSK         (0x1UL << PWR_PDCRD_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PDCRD_PD5             PWR_PDCRD_PD5_MSK                            /*!< Pin PD5 Pull-Down set */
#define PWR_PDCRD_PD6_POS         (6U)
#define PWR_PDCRD_PD6_MSK         (0x1UL << PWR_PDCRD_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PDCRD_PD6             PWR_PDCRD_PD6_MSK                            /*!< Pin PD6 Pull-Down set */
#define PWR_PDCRD_PD8_POS         (8U)
#define PWR_PDCRD_PD8_MSK         (0x1UL << PWR_PDCRD_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PDCRD_PD8             PWR_PDCRD_PD8_MSK                            /*!< Pin PD8 Pull-Down set */
#define PWR_PDCRD_PD9_POS         (9U)
#define PWR_PDCRD_PD9_MSK         (0x1UL << PWR_PDCRD_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PDCRD_PD9             PWR_PDCRD_PD9_MSK                            /*!< Pin PD9 Pull-Down set */
#define PWR_PDCRD_PD10_POS        (10U)
#define PWR_PDCRD_PD10_MSK        (0x1UL << PWR_PDCRD_PD10_POS)                /*!< 0x00000400 */
#define PWR_PDCRD_PD10            PWR_PDCRD_PD10_MSK                           /*!< Pin PD10 Pull-Down set */
#define PWR_PDCRD_PD11_POS        (11U)
#define PWR_PDCRD_PD11_MSK        (0x1UL << PWR_PDCRD_PD11_POS)                /*!< 0x00000800 */
#define PWR_PDCRD_PD11            PWR_PDCRD_PD11_MSK                           /*!< Pin PD11 Pull-Down set */
#define PWR_PDCRD_PD12_POS        (12U)
#define PWR_PDCRD_PD12_MSK        (0x1UL << PWR_PDCRD_PD12_POS)                /*!< 0x00001000 */
#define PWR_PDCRD_PD12            PWR_PDCRD_PD12_MSK                           /*!< Pin PD12 Pull-Down set */
#define PWR_PDCRD_PD13_POS        (13U)
#define PWR_PDCRD_PD13_MSK        (0x1UL << PWR_PDCRD_PD13_POS)                /*!< 0x00002000 */
#define PWR_PDCRD_PD13            PWR_PDCRD_PD13_MSK                           /*!< Pin PD13 Pull-Down set */
#define PWR_PDCRD_PD14_POS        (14U)
#define PWR_PDCRD_PD14_MSK        (0x1UL << PWR_PDCRD_PD14_POS)                /*!< 0x00004000 */
#define PWR_PDCRD_PD14            PWR_PDCRD_PD14_MSK                           /*!< Pin PD14 Pull-Down set */
#define PWR_PDCRD_PD15_POS        (15U)
#define PWR_PDCRD_PD15_MSK        (0x1UL << PWR_PDCRD_PD15_POS)                /*!< 0x00008000 */
#define PWR_PDCRD_PD15            PWR_PDCRD_PD15_MSK                           /*!< Pin PD15 Pull-Down set */
/********************  Bit definition for PWR_PUCRE register  *****************/
#define PWR_PUCRE_PU0_POS         (0U)
#define PWR_PUCRE_PU0_MSK         (0x1UL << PWR_PUCRE_PU0_POS)                 /*!< 0x00000001 */
#define PWR_PUCRE_PU0             PWR_PUCRE_PU0_MSK                            /*!< Pin PE0 Pull-Up set */
#define PWR_PUCRE_PU1_POS         (1U)
#define PWR_PUCRE_PU1_MSK         (0x1UL << PWR_PUCRE_PU1_POS)                 /*!< 0x00000002 */
#define PWR_PUCRE_PU1             PWR_PUCRE_PU1_MSK                            /*!< Pin PE1 Pull-Up set */
#define PWR_PUCRE_PU2_POS         (2U)
#define PWR_PUCRE_PU2_MSK         (0x1UL << PWR_PUCRE_PU2_POS)                 /*!< 0x00000004 */
#define PWR_PUCRE_PU2             PWR_PUCRE_PU2_MSK                            /*!< Pin PE2 Pull-Up set */
#define PWR_PUCRE_PU3_POS         (3U)
#define PWR_PUCRE_PU3_MSK         (0x1UL << PWR_PUCRE_PU3_POS)                 /*!< 0x00000008 */
#define PWR_PUCRE_PU3             PWR_PUCRE_PU3_MSK                            /*!< Pin PE3 Pull-Up set */
#define PWR_PUCRE_PU4_POS         (4U)
#define PWR_PUCRE_PU4_MSK         (0x1UL << PWR_PUCRE_PU4_POS)                 /*!< 0x00000010 */
#define PWR_PUCRE_PU4             PWR_PUCRE_PU4_MSK                            /*!< Pin PE4 Pull-Up set */
#define PWR_PUCRE_PD5_POS         (5U)
#define PWR_PUCRE_PD5_MSK         (0x1UL << PWR_PUCRE_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PUCRE_PD5             PWR_PUCRE_PD5_MSK                            /*!< Pin PE5 Pull-Up set */
#define PWR_PUCRE_PD6_POS         (6U)
#define PWR_PUCRE_PD6_MSK         (0x1UL << PWR_PUCRE_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PUCRE_PD6             PWR_PUCRE_PD6_MSK                            /*!< Pin PE6 Pull-Up set */
#define PWR_PUCRE_PD7_POS         (7U)
#define PWR_PUCRE_PD7_MSK         (0x1UL << PWR_PUCRE_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PUCRE_PD7             PWR_PUCRE_PD7_MSK                            /*!< Pin PE7 Pull-Up set */
#define PWR_PUCRE_PD8_POS         (8U)
#define PWR_PUCRE_PD8_MSK         (0x1UL << PWR_PUCRE_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PUCRE_PD8             PWR_PUCRE_PD8_MSK                            /*!< Pin PE8 Pull-Up set */
#define PWR_PUCRE_PD9_POS         (9U)
#define PWR_PUCRE_PD9_MSK         (0x1UL << PWR_PUCRE_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PUCRE_PD9             PWR_PUCRE_PD9_MSK                            /*!< Pin PE9 Pull-Up set */
#define PWR_PUCRE_PD10_POS        (10U)
#define PWR_PUCRE_PD10_MSK        (0x1UL << PWR_PUCRE_PD10_POS)                /*!< 0x00000400 */
#define PWR_PUCRE_PD10            PWR_PUCRE_PD10_MSK                           /*!< Pin PE10 Pull-Up set */
#define PWR_PUCRE_PD11_POS        (11U)
#define PWR_PUCRE_PD11_MSK        (0x1UL << PWR_PUCRE_PD11_POS)                /*!< 0x00000800 */
#define PWR_PUCRE_PD11            PWR_PUCRE_PD11_MSK                           /*!< Pin PE11 Pull-Up set */
#define PWR_PUCRE_PD12_POS        (12U)
#define PWR_PUCRE_PD12_MSK        (0x1UL << PWR_PUCRE_PD12_POS)                /*!< 0x00001000 */
#define PWR_PUCRE_PD12            PWR_PUCRE_PD12_MSK                           /*!< Pin PE12 Pull-Up set */
#define PWR_PUCRE_PD13_POS        (13U)
#define PWR_PUCRE_PD13_MSK        (0x1UL << PWR_PUCRE_PD13_POS)                /*!< 0x00002000 */
#define PWR_PUCRE_PD13            PWR_PUCRE_PD13_MSK                           /*!< Pin PE13 Pull-Up set */
#define PWR_PUCRE_PD14_POS        (14U)
#define PWR_PUCRE_PD14_MSK        (0x1UL << PWR_PUCRE_PD14_POS)                /*!< 0x00004000 */
#define PWR_PUCRE_PD14            PWR_PUCRE_PD14_MSK                           /*!< Pin PE14 Pull-Up set */
#define PWR_PUCRE_PD15_POS        (15U)
#define PWR_PUCRE_PD15_MSK        (0x1UL << PWR_PUCRE_PD15_POS)                /*!< 0x00008000 */
#define PWR_PUCRE_PD15            PWR_PUCRE_PD15_MSK                           /*!< Pin PE15 Pull-Up set */

/********************  Bit definition for PWR_PDCRE register  *****************/
#define PWR_PDCRE_PD0_POS         (0U)
#define PWR_PDCRE_PD0_MSK         (0x1UL << PWR_PDCRE_PD0_POS)                 /*!< 0x00000001 */
#define PWR_PDCRE_PD0             PWR_PDCRE_PD0_MSK                            /*!< Pin PE0 Pull-Down set */
#define PWR_PDCRE_PD1_POS         (1U)
#define PWR_PDCRE_PD1_MSK         (0x1UL << PWR_PDCRE_PD1_POS)                 /*!< 0x00000002 */
#define PWR_PDCRE_PD1             PWR_PDCRE_PD1_MSK                            /*!< Pin PE1 Pull-Down set */
#define PWR_PDCRE_PD2_POS         (2U)
#define PWR_PDCRE_PD2_MSK         (0x1UL << PWR_PDCRE_PD2_POS)                 /*!< 0x00000004 */
#define PWR_PDCRE_PD2             PWR_PDCRE_PD2_MSK                            /*!< Pin PE2 Pull-Down set */
#define PWR_PDCRE_PD3_POS         (3U)
#define PWR_PDCRE_PD3_MSK         (0x1UL << PWR_PDCRE_PD3_POS)                 /*!< 0x00000008 */
#define PWR_PDCRE_PD3             PWR_PDCRE_PD3_MSK                            /*!< Pin PE3 Pull-Down set */
#define PWR_PDCRE_PD4_POS         (4U)
#define PWR_PDCRE_PD4_MSK         (0x1UL << PWR_PDCRE_PD4_POS)                 /*!< 0x00000010 */
#define PWR_PDCRE_PD4             PWR_PDCRE_PD4_MSK                            /*!< Pin PE4 Pull-Down set */
#define PWR_PDCRE_PD5_POS         (5U)
#define PWR_PDCRE_PD5_MSK         (0x1UL << PWR_PDCRE_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PDCRE_PD5             PWR_PDCRE_PD5_MSK                            /*!< Pin PE5 Pull-Down set */
#define PWR_PDCRE_PD6_POS         (6U)
#define PWR_PDCRE_PD6_MSK         (0x1UL << PWR_PDCRE_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PDCRE_PD6             PWR_PDCRE_PD6_MSK                            /*!< Pin PE6 Pull-Down set */
#define PWR_PDCRE_PD7_POS         (7U)
#define PWR_PDCRE_PD7_MSK         (0x1UL << PWR_PDCRE_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PDCRE_PD7             PWR_PDCRE_PD7_MSK                            /*!< Pin PE7 Pull-Down set */
#define PWR_PDCRE_PD8_POS         (8U)
#define PWR_PDCRE_PD8_MSK         (0x1UL << PWR_PDCRE_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PDCRE_PD8             PWR_PDCRE_PD8_MSK                            /*!< Pin PE8 Pull-Down set */
#define PWR_PDCRE_PD9_POS         (9U)
#define PWR_PDCRE_PD9_MSK         (0x1UL << PWR_PDCRE_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PDCRE_PD9             PWR_PDCRE_PD9_MSK                            /*!< Pin PE9 Pull-Down set */
#define PWR_PDCRE_PD10_POS        (10U)
#define PWR_PDCRE_PD10_MSK        (0x1UL << PWR_PDCRE_PD10_POS)                /*!< 0x00000400 */
#define PWR_PDCRE_PD10            PWR_PDCRE_PD10_MSK                           /*!< Pin PE10 Pull-Down set */
#define PWR_PDCRE_PD11_POS        (11U)
#define PWR_PDCRE_PD11_MSK        (0x1UL << PWR_PDCRE_PD11_POS)                /*!< 0x00000800 */
#define PWR_PDCRE_PD11            PWR_PDCRE_PD11_MSK                           /*!< Pin PE11 Pull-Down set */
#define PWR_PDCRE_PD12_POS        (12U)
#define PWR_PDCRE_PD12_MSK        (0x1UL << PWR_PDCRE_PD12_POS)                /*!< 0x00001000 */
#define PWR_PDCRE_PD12            PWR_PDCRE_PD12_MSK                           /*!< Pin PE12 Pull-Down set */
#define PWR_PDCRE_PD13_POS        (13U)
#define PWR_PDCRE_PD13_MSK        (0x1UL << PWR_PDCRE_PD13_POS)                /*!< 0x00002000 */
#define PWR_PDCRE_PD13            PWR_PDCRE_PD13_MSK                           /*!< Pin PE13 Pull-Down set */
#define PWR_PDCRE_PD14_POS        (14U)
#define PWR_PDCRE_PD14_MSK        (0x1UL << PWR_PDCRE_PD14_POS)                /*!< 0x00004000 */
#define PWR_PDCRE_PD14            PWR_PDCRE_PD14_MSK                           /*!< Pin PE14 Pull-Down set */
#define PWR_PDCRE_PD15_POS        (15U)
#define PWR_PDCRE_PD15_MSK        (0x1UL << PWR_PDCRE_PD15_POS)                /*!< 0x00008000 */
#define PWR_PDCRE_PD15            PWR_PDCRE_PD15_MSK                           /*!< Pin PE15 Pull-Down set */

