ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for PWR_PUCRF register  *****************/
#define PWR_PUCRF_PU0_POS         (0U)
#define PWR_PUCRF_PU0_MSK         (0x1UL << PWR_PUCRF_PU0_POS)                 /*!< 0x00000001 */
#define PWR_PUCRF_PU0             PWR_PUCRF_PU0_MSK                            /*!< Pin PF0 Pull-Up set */
#define PWR_PUCRF_PU1_POS         (1U)
#define PWR_PUCRF_PU1_MSK         (0x1UL << PWR_PUCRF_PU1_POS)                 /*!< 0x00000002 */
#define PWR_PUCRF_PU1             PWR_PUCRF_PU1_MSK                            /*!< Pin PF1 Pull-Up set */
#define PWR_PUCRF_PU2_POS         (2U)
#define PWR_PUCRF_PU2_MSK         (0x1UL << PWR_PUCRF_PU2_POS)                 /*!< 0x00000004 */
#define PWR_PUCRF_PU2             PWR_PUCRF_PU2_MSK                            /*!< Pin PF2 Pull-Up set */
#define PWR_PUCRF_PU3_POS         (3U)
#define PWR_PUCRF_PU3_MSK         (0x1UL << PWR_PUCRF_PU3_POS)                 /*!< 0x00000008 */
#define PWR_PUCRF_PU3             PWR_PUCRF_PU3_MSK                            /*!< Pin PF3 Pull-Up set */
#define PWR_PUCRF_PU4_POS         (4U)
#define PWR_PUCRF_PU4_MSK         (0x1UL << PWR_PUCRF_PU4_POS)                 /*!< 0x00000010 */
#define PWR_PUCRF_PU4             PWR_PUCRF_PU4_MSK                            /*!< Pin PF4 Pull-Up set */
#define PWR_PUCRF_PD5_POS         (5U)
#define PWR_PUCRF_PD5_MSK         (0x1UL << PWR_PUCRF_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PUCRF_PD5             PWR_PUCRF_PD5_MSK                            /*!< Pin PF5 Pull-Up set */
#define PWR_PUCRF_PD6_POS         (6U)
#define PWR_PUCRF_PD6_MSK         (0x1UL << PWR_PUCRF_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PUCRF_PD6             PWR_PUCRF_PD6_MSK                            /*!< Pin PF6 Pull-Up set */
#define PWR_PUCRF_PD7_POS         (7U)
#define PWR_PUCRF_PD7_MSK         (0x1UL << PWR_PUCRF_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PUCRF_PD7             PWR_PUCRF_PD7_MSK                            /*!< Pin PF7 Pull-Up set */
#define PWR_PUCRF_PD8_POS         (8U)
#define PWR_PUCRF_PD8_MSK         (0x1UL << PWR_PUCRF_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PUCRF_PD8             PWR_PUCRF_PD8_MSK                            /*!< Pin PF8 Pull-Up set */
#define PWR_PUCRF_PD9_POS         (9U)
#define PWR_PUCRF_PD9_MSK         (0x1UL << PWR_PUCRF_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PUCRF_PD9             PWR_PUCRF_PD9_MSK                            /*!< Pin PF9 Pull-Up set */
#define PWR_PUCRF_PD10_POS        (10U)
#define PWR_PUCRF_PD10_MSK        (0x1UL << PWR_PUCRF_PD10_POS)                /*!< 0x00000400 */
#define PWR_PUCRF_PD10            PWR_PUCRF_PD10_MSK                           /*!< Pin PF10 Pull-Up set */
#define PWR_PUCRF_PD11_POS        (11U)
#define PWR_PUCRF_PD11_MSK        (0x1UL << PWR_PUCRF_PD11_POS)                /*!< 0x00000800 */
#define PWR_PUCRF_PD11            PWR_PUCRF_PD11_MSK                           /*!< Pin PF11 Pull-Up set */
#define PWR_PUCRF_PD12_POS        (12U)
#define PWR_PUCRF_PD12_MSK        (0x1UL << PWR_PUCRF_PD12_POS)                /*!< 0x00001000 */
#define PWR_PUCRF_PD12            PWR_PUCRF_PD12_MSK                           /*!< Pin PF12 Pull-Up set */
#define PWR_PUCRF_PD13_POS        (13U)
#define PWR_PUCRF_PD13_MSK        (0x1UL << PWR_PUCRF_PD13_POS)                /*!< 0x00002000 */
#define PWR_PUCRF_PD13            PWR_PUCRF_PD13_MSK                           /*!< Pin PF13 Pull-Up set */

/********************  Bit definition for PWR_PDCRF register  *****************/
#define PWR_PDCRF_PD0_POS         (0U)
#define PWR_PDCRF_PD0_MSK         (0x1UL << PWR_PDCRF_PD0_POS)                 /*!< 0x00000001 */
#define PWR_PDCRF_PD0             PWR_PDCRF_PD0_MSK                            /*!< Pin PF0 Pull-Down set */
#define PWR_PDCRF_PD1_POS         (1U)
#define PWR_PDCRF_PD1_MSK         (0x1UL << PWR_PDCRF_PD1_POS)                 /*!< 0x00000002 */
#define PWR_PDCRF_PD1             PWR_PDCRF_PD1_MSK                            /*!< Pin PF1 Pull-Down set */
#define PWR_PDCRF_PD2_POS         (2U)
#define PWR_PDCRF_PD2_MSK         (0x1UL << PWR_PDCRF_PD2_POS)                 /*!< 0x00000004 */
#define PWR_PDCRF_PD2             PWR_PDCRF_PD2_MSK                            /*!< Pin PF2 Pull-Down set */
#define PWR_PDCRF_PD3_POS         (3U)
#define PWR_PDCRF_PD3_MSK         (0x1UL << PWR_PDCRF_PD3_POS)                 /*!< 0x00000008 */
#define PWR_PDCRF_PD3             PWR_PDCRF_PD3_MSK                            /*!< Pin PF3 Pull-Down set */
#define PWR_PDCRF_PD4_POS         (4U)
#define PWR_PDCRF_PD4_MSK         (0x1UL << PWR_PDCRF_PD4_POS)                 /*!< 0x00000010 */
#define PWR_PDCRF_PD4             PWR_PDCRF_PD4_MSK                            /*!< Pin PF4 Pull-Down set */
#define PWR_PDCRF_PD5_POS         (5U)
#define PWR_PDCRF_PD5_MSK         (0x1UL << PWR_PDCRF_PD5_POS)                 /*!< 0x00000020 */
#define PWR_PDCRF_PD5             PWR_PDCRF_PD5_MSK                            /*!< Pin PF5 Pull-Down set */
#define PWR_PDCRF_PD6_POS         (6U)
#define PWR_PDCRF_PD6_MSK         (0x1UL << PWR_PDCRF_PD6_POS)                 /*!< 0x00000040 */
#define PWR_PDCRF_PD6             PWR_PDCRF_PD6_MSK                            /*!< Pin PF6 Pull-Down set */
#define PWR_PDCRF_PD7_POS         (7U)
#define PWR_PDCRF_PD7_MSK         (0x1UL << PWR_PDCRF_PD7_POS)                 /*!< 0x00000080 */
#define PWR_PDCRF_PD7             PWR_PDCRF_PD7_MSK                            /*!< Pin PF7 Pull-Down set */
#define PWR_PDCRF_PD8_POS         (8U)
#define PWR_PDCRF_PD8_MSK         (0x1UL << PWR_PDCRF_PD8_POS)                 /*!< 0x00000100 */
#define PWR_PDCRF_PD8             PWR_PDCRF_PD8_MSK                            /*!< Pin PF8 Pull-Down set */
#define PWR_PDCRF_PD9_POS         (9U)
#define PWR_PDCRF_PD9_MSK         (0x1UL << PWR_PDCRF_PD9_POS)                 /*!< 0x00000200 */
#define PWR_PDCRF_PD9             PWR_PDCRF_PD9_MSK                            /*!< Pin PF9 Pull-Down set */
#define PWR_PDCRF_PD10_POS        (10U)
#define PWR_PDCRF_PD10_MSK        (0x1UL << PWR_PDCRF_PD10_POS)                /*!< 0x00000400 */
#define PWR_PDCRF_PD10            PWR_PDCRF_PD10_MSK                           /*!< Pin PF10 Pull-Down set */
#define PWR_PDCRF_PD11_POS        (11U)
#define PWR_PDCRF_PD11_MSK        (0x1UL << PWR_PDCRF_PD11_POS)                /*!< 0x00000800 */
#define PWR_PDCRF_PD11            PWR_PDCRF_PD11_MSK                           /*!< Pin PF11 Pull-Down set */
#define PWR_PDCRF_PD12_POS        (12U)
#define PWR_PDCRF_PD12_MSK        (0x1UL << PWR_PDCRF_PD12_POS)                /*!< 0x00001000 */
#define PWR_PDCRF_PD12            PWR_PDCRF_PD12_MSK                           /*!< Pin PF12 Pull-Down set */
#define PWR_PDCRF_PD13_POS        (13U)
#define PWR_PDCRF_PD13_MSK        (0x1UL << PWR_PDCRF_PD13_POS)                /*!< 0x00002000 */
#define PWR_PDCRF_PD13            PWR_PDCRF_PD13_MSK                           /*!< Pin PF13 Pull-Down set */





