ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- RESET AND CLOCK CONTROL REGISTERS --------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief Reset and Clock Control
  */
typedef struct
{
  volatile uint32 CR;          /*!< RCC Clock Sources Control Register,                                     Address offset: 0x00 */
  volatile uint32 ICSCR;       /*!< RCC Internal Clock Sources Calibration Register,                        Address offset: 0x04 */
  volatile uint32 CFGR;        /*!< RCC Regulated Domain Clocks Configuration Register,                     Address offset: 0x08 */
  volatile uint32 PLLCFGR;     /*!< RCC System PLL configuration Register,                                  Address offset: 0x0C */
  volatile uint32 RESERVED0;   /*!< Reserved,                                                               Address offset: 0x10 */
  volatile uint32 CRRCR;       /*!< RCC Clock Configuration Register,                                       Address offset: 0x14 */
  volatile uint32 CIER;        /*!< RCC Clock Interrupt Enable Register,                                    Address offset: 0x18 */
  volatile uint32 CIFR;        /*!< RCC Clock Interrupt Flag Register,                                      Address offset: 0x1C */
  volatile uint32 CICR;        /*!< RCC Clock Interrupt Clear Register,                                     Address offset: 0x20 */
  volatile uint32 IOPRSTR;     /*!< RCC IO port reset register,                                             Address offset: 0x24 */
  volatile uint32 AHBRSTR;     /*!< RCC AHB peripherals reset register,                                     Address offset: 0x28 */
  volatile uint32 APBRSTR1;    /*!< RCC APB peripherals reset register 1,                                   Address offset: 0x2C */
  volatile uint32 APBRSTR2;    /*!< RCC APB peripherals reset register 2,                                   Address offset: 0x30 */
  volatile uint32 IOPENR;      /*!< RCC IO port enable register,                                            Address offset: 0x34 */
  volatile uint32 AHBENR;      /*!< RCC AHB peripherals clock enable register,                              Address offset: 0x38 */
  volatile uint32 APBENR1;     /*!< RCC APB peripherals clock enable register1,                             Address offset: 0x3C */
  volatile uint32 APBENR2;     /*!< RCC APB peripherals clock enable register2,                             Address offset: 0x40 */
  volatile uint32 IOPSMENR;    /*!< RCC IO port clocks enable in sleep mode register,                       Address offset: 0x44 */
  volatile uint32 AHBSMENR;    /*!< RCC AHB peripheral clocks enable in sleep mode register,                Address offset: 0x48 */
  volatile uint32 APBSMENR1;   /*!< RCC APB peripheral clocks enable in sleep mode register1,               Address offset: 0x4C */
  volatile uint32 APBSMENR2;   /*!< RCC APB peripheral clocks enable in sleep mode register2,               Address offset: 0x50 */
  volatile uint32 CCIPR;       /*!< RCC Peripherals Independent Clocks Configuration Register,              Address offset: 0x54 */
  volatile uint32 CCIPR2;      /*!< RCC Peripherals Independent Clocks Configuration Register2,             Address offset: 0x58 */
  volatile uint32 BDCR;        /*!< RCC Backup Domain Control Register,                                     Address offset: 0x5C */
  volatile uint32 CSR;         /*!< RCC Unregulated Domain Clock Control and Status Register,               Address offset: 0x60 */
} RCC_TYPEDEF;

#define RCC                 (*(RCC_TYPEDEF *) RCC_BASE)

#define RCC_AHBRSTR_FORCE_RESET            ((uint32)0x00051003)     //Except Flash
#define RCC_APBRSTR1_FORCE_RESET           ((uint32)0xF7FFF3B7U)     //Except debugger
#define RCC_APBRSTR2_FORCE_RESET           ((uint32)0x0017D801)
#define RCC_IOPRSTR_FORCE_RESET            ((uint32)0x0000003F)

#define RCC_AHBRSTR_RELEASE_RESET           ((uint32)0x00000000)
#define RCC_APBRSTR1_RELEASE_RESET          ((uint32)0x00000000)
#define RCC_APBRSTR2_RELEASE_RESET          ((uint32)0x00000000)
#define RCC_IOPRSTR_RELEASE_RESET           ((uint32)0x00000000)

#define RCC_AHBPERIPH_CLK_DISABLE           ((uint32)0x00000100)    //Except Flash
#define RCC_APBENR1_CLK_DISABLE             ((uint32)0x18000000)    //Except debugger, Pwr
#define RCC_APBENR2_CLK_DISABLE             ((uint32)0x00000001)    //Except SYSCFG
#define RCC_IOPENR_CLK_DISABLE              ((uint32)0x00000000)

#define RCC_CICR_CLEAR_ALL_INTERRUPTS       ((uint32)0xFFFFFFFFu)

//! SW configuration
#define  RCC_CFGR_SW_HSI                     ((uint32)0x00000000)        //! HSI selected as system clock
#define  RCC_CFGR_SW_HSE                     ((uint32)0x00000001)        //! HSE selected as system clock
#define  RCC_CFGR_SW_PLL                     ((uint32)0x00000002)        //! PLL selected as system clock

#define  RCC_CFGR_SWS_HSI                    ((uint32)0x00000000)        //! HSI oscillator used as system clock
#define  RCC_CFGR_SWS_PLL                    ((uint32)0x00000010)        //! PLL used as system clock

#define RCC_PLLSOURCE_NONE             0x00000000U             /*!< No clock selected as PLL entry clock source  */
#define RCC_PLLSOURCE_HSI              RCC_PLLCFGR_PLLSRC_HSI  /*!< HSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_HSE              RCC_PLLCFGR_PLLSRC_HSE  /*!< HSE clock selected as PLL entry clock source */

// RCC reset configuration
#define  RCC_CR_INIT_CONFIG              ((uint32)0x00000500)
#define  RCC_CFGR_INIT_CONFIG            ((uint32)0x00000000)
#define  RCC_PLLCFGR_INIT_CONFIG         ((uint32)0x00001000)

#define  RCC_CFGR3_INIT_CONFIG           ((uint32)0x00000000)
#define  RCC_CIR_ALL_INTERRUPTS_DISABLE  ((uint32)0x00000000)

#define RCC_HCLK_DIV1                  0x00000000U                                           /*!< HCLK not divided */
#define RCC_HCLK_DIV2                  RCC_CFGR_PPRE_2                                       /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4                  (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_0)                   /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8                  (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1)                   /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16                 (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1 | RCC_CFGR_PPRE_0) /*!< HCLK divided by 16 */

