ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define RCC_HSI_DIV1                   0x00000000U                                        /*!< HSI clock is not divided */
#define RCC_HSI_DIV2                   RCC_CR_HSIDIV_0                                    /*!< HSI clock is divided by 2 */
#define RCC_HSI_DIV4                   RCC_CR_HSIDIV_1                                    /*!< HSI clock is divided by 4 */
#define RCC_HSI_DIV8                   (RCC_CR_HSIDIV_1|RCC_CR_HSIDIV_0)                  /*!< HSI clock is divided by 8 */
#define RCC_HSI_DIV16                  RCC_CR_HSIDIV_2                                    /*!< HSI clock is divided by 16 */
#define RCC_HSI_DIV32                  (RCC_CR_HSIDIV_2|RCC_CR_HSIDIV_0)                  /*!< HSI clock is divided by 32 */
#define RCC_HSI_DIV64                  (RCC_CR_HSIDIV_2|RCC_CR_HSIDIV_1)                  /*!< HSI clock is divided by 64 */
#define RCC_HSI_DIV128                 (RCC_CR_HSIDIV_2|RCC_CR_HSIDIV_1|RCC_CR_HSIDIV_0)  /*!< HSI clock is divided by 128 */

/********************  Bit definition for RCC_CR register  *****************/
#define RCC_CR_HSION_POS                 (8U)
#define RCC_CR_HSION_MSK                 (0x1UL << RCC_CR_HSION_POS)           /*!< 0x00000100 */
#define RCC_CR_HSION                     RCC_CR_HSION_MSK                      /*!< Internal High Speed clock enable */
#define RCC_CR_HSIKERON_POS              (9U)
#define RCC_CR_HSIKERON_MSK              (0x1UL << RCC_CR_HSIKERON_POS)        /*!< 0x00000200 */
#define RCC_CR_HSIKERON                  RCC_CR_HSIKERON_MSK                   /*!< Internal High Speed clock enable for some IPs Kernel */
#define RCC_CR_HSIRDY_POS                (10U)
#define RCC_CR_HSIRDY_MSK                (0x1UL << RCC_CR_HSIRDY_POS)          /*!< 0x00000400 */
#define RCC_CR_HSIRDY                    RCC_CR_HSIRDY_MSK                     /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSIDIV_POS                (11U)
#define RCC_CR_HSIDIV_MSK                (0x7UL << RCC_CR_HSIDIV_POS)          /*!< 0x00003800 */
#define RCC_CR_HSIDIV                    RCC_CR_HSIDIV_MSK                     /*!< HSIDIV[13:11] Internal High Speed clock division factor */
#define RCC_CR_HSIDIV_0                  (0x1UL << RCC_CR_HSIDIV_POS)          /*!< 0x00000800 */
#define RCC_CR_HSIDIV_1                  (0x2UL << RCC_CR_HSIDIV_POS)          /*!< 0x00001000 */
#define RCC_CR_HSIDIV_2                  (0x4UL << RCC_CR_HSIDIV_POS)          /*!< 0x00002000 */
#define RCC_CR_HSEON_POS                 (16U)
#define RCC_CR_HSEON_MSK                 (0x1UL << RCC_CR_HSEON_POS)           /*!< 0x00010000 */
#define RCC_CR_HSEON                     RCC_CR_HSEON_MSK                      /*!< External High Speed clock enable */
#define RCC_CR_HSERDY_POS                (17U)
#define RCC_CR_HSERDY_MSK                (0x1UL << RCC_CR_HSERDY_POS)          /*!< 0x00020000 */
#define RCC_CR_HSERDY                    RCC_CR_HSERDY_MSK                     /*!< External High Speed clock ready */
#define RCC_CR_HSEBYP_POS                (18U)
#define RCC_CR_HSEBYP_MSK                (0x1UL << RCC_CR_HSEBYP_POS)          /*!< 0x00040000 */
#define RCC_CR_HSEBYP                    RCC_CR_HSEBYP_MSK                     /*!< External High Speed clock Bypass */
#define RCC_CR_CSSON_POS                 (19U)
#define RCC_CR_CSSON_MSK                 (0x1UL << RCC_CR_CSSON_POS)           /*!< 0x00080000 */
#define RCC_CR_CSSON                     RCC_CR_CSSON_MSK                      /*!< HSE Clock Security System enable */

#define RCC_CR_HSI48ON_POS                (22U)
#define RCC_CR_HSI48ON_MSK                (0x1UL << RCC_CR_HSI48ON_POS)           /*!< 0x004000000 */
#define RCC_CR_HSI48ON                    RCC_CR_HSI48ON_MSK                      /*!< RC48 clock enable */
#define RCC_CR_HSI48RDY_POS               (23U)
#define RCC_CR_HSI48RDY_MSK               (0x1UL << RCC_CR_HSI48RDY_POS)           /*!< 0x00800000 */
#define RCC_CR_HSI48RDY                   RCC_CR_HSI48RDY_MSK                      /*!< RC48 clock ready */
#define RCC_CR_PLLON_POS                 (24U)
#define RCC_CR_PLLON_MSK                 (0x1UL << RCC_CR_PLLON_POS)           /*!< 0x01000000 */
#define RCC_CR_PLLON                     RCC_CR_PLLON_MSK                      /*!< System PLL clock enable */
#define RCC_CR_PLLRDY_POS                (25U)
#define RCC_CR_PLLRDY_MSK                (0x1UL << RCC_CR_PLLRDY_POS)          /*!< 0x02000000 */
#define RCC_CR_PLLRDY                    RCC_CR_PLLRDY_MSK                     /*!< System PLL clock ready */

/********************  Bit definition for RCC_ICSCR register  ***************/
/*!< HSICAL configuration */
#define RCC_ICSCR_HSICAL_POS             (0U)
#define RCC_ICSCR_HSICAL_MSK             (0xFFUL << RCC_ICSCR_HSICAL_POS)      /*!< 0x000000FF */
#define RCC_ICSCR_HSICAL                 RCC_ICSCR_HSICAL_MSK                  /*!< HSICAL[7:0] bits */
#define RCC_ICSCR_HSICAL_0               (0x01UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000001 */
#define RCC_ICSCR_HSICAL_1               (0x02UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000002 */
#define RCC_ICSCR_HSICAL_2               (0x04UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000004 */
#define RCC_ICSCR_HSICAL_3               (0x08UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000008 */
#define RCC_ICSCR_HSICAL_4               (0x10UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000010 */
#define RCC_ICSCR_HSICAL_5               (0x20UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000020 */
#define RCC_ICSCR_HSICAL_6               (0x40UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000040 */
#define RCC_ICSCR_HSICAL_7               (0x80UL << RCC_ICSCR_HSICAL_POS)      /*!< 0x00000080 */

/*!< HSITRIM configuration */
#define RCC_ICSCR_HSITRIM_POS            (8U)
#define RCC_ICSCR_HSITRIM_MSK            (0x7FUL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00007F00 */
#define RCC_ICSCR_HSITRIM                RCC_ICSCR_HSITRIM_MSK                 /*!< HSITRIM[14:8] bits */
#define RCC_ICSCR_HSITRIM_0              (0x01UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00000100 */
#define RCC_ICSCR_HSITRIM_1              (0x02UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00000200 */
#define RCC_ICSCR_HSITRIM_2              (0x04UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00000400 */
#define RCC_ICSCR_HSITRIM_3              (0x08UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00000800 */
#define RCC_ICSCR_HSITRIM_4              (0x10UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00001000 */
#define RCC_ICSCR_HSITRIM_5              (0x20UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00002000 */
#define RCC_ICSCR_HSITRIM_6              (0x40UL << RCC_ICSCR_HSITRIM_POS)     /*!< 0x00004000 */

/********************  Bit definition for RCC_CFGR register  ***************/
/*!< SW configuration */
#define RCC_CFGR_SW_POS                (0U)
#define RCC_CFGR_SW_MSK                (0x7UL << RCC_CFGR_SW_POS)              /*!< 0x00000007 */
#define RCC_CFGR_SW                    RCC_CFGR_SW_MSK                         /*!< SW[2:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0                  (0x1UL << RCC_CFGR_SW_POS)              /*!< 0x00000001 */
#define RCC_CFGR_SW_1                  (0x2UL << RCC_CFGR_SW_POS)              /*!< 0x00000002 */
#define RCC_CFGR_SW_2                  (0x4UL << RCC_CFGR_SW_POS)              /*!< 0x00000004 */

/*!< SWS configuration */
#define RCC_CFGR_SWS_POS               (3U)
#define RCC_CFGR_SWS_MSK               (0x7UL << RCC_CFGR_SWS_POS)             /*!< 0x00000038 */
#define RCC_CFGR_SWS                   RCC_CFGR_SWS_MSK                        /*!< SWS[2:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0                 (0x1UL << RCC_CFGR_SWS_POS)             /*!< 0x00000008 */
#define RCC_CFGR_SWS_1                 (0x2UL << RCC_CFGR_SWS_POS)             /*!< 0x00000010 */
#define RCC_CFGR_SWS_2                 (0x4UL << RCC_CFGR_SWS_POS)             /*!< 0x00000020 */

