ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define RCC_PLLCFGR_PLLQ_POS             (25U)
#define RCC_PLLCFGR_PLLQ_MSK             (0x7UL << RCC_PLLCFGR_PLLQ_POS)       /*!< 0x0E000000 */
#define RCC_PLLCFGR_PLLQ                 RCC_PLLCFGR_PLLQ_MSK
#define RCC_PLLCFGR_PLLQ_0               (0x1UL << RCC_PLLCFGR_PLLQ_POS)       /*!< 0x02000000 */
#define RCC_PLLCFGR_PLLQ_1               (0x2UL << RCC_PLLCFGR_PLLQ_POS)       /*!< 0x04000000 */
#define RCC_PLLCFGR_PLLQ_2               (0x4UL << RCC_PLLCFGR_PLLQ_POS)       /*!< 0x08000000 */

#define RCC_PLLQ_DIV2                  RCC_PLLCFGR_PLLQ_0                                             /*!< PLLQ division factor = 2 */
#define RCC_PLLQ_DIV3                  RCC_PLLCFGR_PLLQ_1                                             /*!< PLLQ division factor = 3 */
#define RCC_PLLQ_DIV4                  (RCC_PLLCFGR_PLLQ_1 | RCC_PLLCFGR_PLLQ_0)                      /*!< PLLQ division factor = 4 */
#define RCC_PLLQ_DIV5                  RCC_PLLCFGR_PLLQ_2                                             /*!< PLLQ division factor = 5 */
#define RCC_PLLQ_DIV6                  (RCC_PLLCFGR_PLLQ_2 | RCC_PLLCFGR_PLLQ_0)                      /*!< PLLQ division factor = 6 */
#define RCC_PLLQ_DIV7                  (RCC_PLLCFGR_PLLQ_2 | RCC_PLLCFGR_PLLQ_1)                      /*!< PLLQ division factor = 7 */
#define RCC_PLLQ_DIV8                  (RCC_PLLCFGR_PLLQ_2 |RCC_PLLCFGR_PLLQ_1 | RCC_PLLCFGR_PLLQ_0)  /*!< PLLQ division factor = 8 */

#define RCC_PLLCFGR_PLLREN_POS           (28U)
#define RCC_PLLCFGR_PLLREN_MSK           (0x1UL << RCC_PLLCFGR_PLLREN_POS)     /*!< 0x10000000 */
#define RCC_PLLCFGR_PLLREN               RCC_PLLCFGR_PLLREN_MSK

#define RCC_PLLCFGR_PLLR_POS             (29U)
#define RCC_PLLCFGR_PLLR_MSK             (0x7UL << RCC_PLLCFGR_PLLR_POS)       /*!< 0xE0000000 */
#define RCC_PLLCFGR_PLLR                 RCC_PLLCFGR_PLLR_MSK
#define RCC_PLLCFGR_PLLR_0               (0x1UL << RCC_PLLCFGR_PLLR_POS)       /*!< 0x20000000 */
#define RCC_PLLCFGR_PLLR_1               (0x2UL << RCC_PLLCFGR_PLLR_POS)       /*!< 0x40000000 */
#define RCC_PLLCFGR_PLLR_2               (0x4UL << RCC_PLLCFGR_PLLR_POS)       /*!< 0x80000000 */

#define RCC_PLLR_DIV2                  RCC_PLLCFGR_PLLR_0                                             /*!< PLLR division factor = 2 */
#define RCC_PLLR_DIV3                  RCC_PLLCFGR_PLLR_1                                             /*!< PLLR division factor = 3 */
#define RCC_PLLR_DIV4                  (RCC_PLLCFGR_PLLR_1 | RCC_PLLCFGR_PLLR_0)                      /*!< PLLR division factor = 4 */
#define RCC_PLLR_DIV5                  RCC_PLLCFGR_PLLR_2                                             /*!< PLLR division factor = 5 */
#define RCC_PLLR_DIV6                  (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_0)                      /*!< PLLR division factor = 6 */
#define RCC_PLLR_DIV7                  (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_1)                      /*!< PLLR division factor = 7 */
#define RCC_PLLR_DIV8                  (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_1 | RCC_PLLCFGR_PLLR_0) /*!< PLLR division factor = 8 */

/********************  Bit definition for RCC_CRRCR register  ******************/
/*!< RC48CAL configuration */
#define RCC_CRRCR_HSI48CAL_POS            (0U)
#define RCC_CRRCR_HSI48CAL_MSK            (0x1FFUL << RCC_CRRCR_HSI48CAL_POS)    /*!< 0x000001FF */
#define RCC_CRRCR_HSI48CAL                RCC_CRRCR_HSI48CAL_MSK                 /*!< RC48CAL[8:0] bits */
#define RCC_CRRCR_HSI48CAL_0              (0x01UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000001 */
#define RCC_CRRCR_HSI48CAL_1              (0x02UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000002 */
#define RCC_CRRCR_HSI48CAL_2              (0x04UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000004 */
#define RCC_CRRCR_HSI48CAL_3              (0x08UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000008 */
#define RCC_CRRCR_HSI48CAL_4              (0x10UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000010 */
#define RCC_CRRCR_HSI48CAL_5              (0x20UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000020 */
#define RCC_CRRCR_HSI48CAL_6              (0x40UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000040 */
#define RCC_CRRCR_HSI48CAL_7              (0x80UL << RCC_CRRCR_HSI48CAL_POS)     /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_8              (0x100UL << RCC_CRRCR_HSI48CAL_POS)    /*!< 0x00000100 */
/********************  Bit definition for RCC_CIER register  ******************/
#define RCC_CIER_LSIRDYIE_POS            (0U)
#define RCC_CIER_LSIRDYIE_MSK            (0x1UL << RCC_CIER_LSIRDYIE_POS)      /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE                RCC_CIER_LSIRDYIE_MSK
#define RCC_CIER_LSERDYIE_POS            (1U)
#define RCC_CIER_LSERDYIE_MSK            (0x1UL << RCC_CIER_LSERDYIE_POS)      /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE                RCC_CIER_LSERDYIE_MSK
#define RCC_CIER_HSI48RDYIE_POS          (2U)
#define RCC_CIER_HSI48RDYIE_MSK          (0x1UL << RCC_CIER_HSI48RDYIE_POS)      /*!< 0x00000004 */
#define RCC_CIER_HSI48RDYIE              RCC_CIER_HSI48RDYIE_MSK
#define RCC_CIER_HSIRDYIE_POS            (3U)
#define RCC_CIER_HSIRDYIE_MSK            (0x1UL << RCC_CIER_HSIRDYIE_POS)      /*!< 0x00000008 */
#define RCC_CIER_HSIRDYIE                RCC_CIER_HSIRDYIE_MSK
#define RCC_CIER_HSERDYIE_POS            (4U)
#define RCC_CIER_HSERDYIE_MSK            (0x1UL << RCC_CIER_HSERDYIE_POS)      /*!< 0x00000010 */
#define RCC_CIER_HSERDYIE                RCC_CIER_HSERDYIE_MSK
#define RCC_CIER_PLLRDYIE_POS            (5U)
#define RCC_CIER_PLLRDYIE_MSK            (0x1UL << RCC_CIER_PLLRDYIE_POS)      /*!< 0x00000020 */
#define RCC_CIER_PLLRDYIE                RCC_CIER_PLLRDYIE_MSK

/********************  Bit definition for RCC_CIFR register  ******************/
#define RCC_CIFR_LSIRDYF_POS             (0U)
#define RCC_CIFR_LSIRDYF_MSK             (0x1UL << RCC_CIFR_LSIRDYF_POS)       /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF                 RCC_CIFR_LSIRDYF_MSK
#define RCC_CIFR_LSERDYF_POS             (1U)
#define RCC_CIFR_LSERDYF_MSK             (0x1UL << RCC_CIFR_LSERDYF_POS)       /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF                 RCC_CIFR_LSERDYF_MSK
#define RCC_CIFR_HSI48RDYF_POS           (2U)
#define RCC_CIFR_HSI48RDYF_MSK           (0x1UL << RCC_CIFR_HSI48RDYF_POS)      /*!< 0x00000004 */
#define RCC_CIFR_HSI48RDYF                RCC_CIFR_HSI48RDYF_MSK
#define RCC_CIFR_HSIRDYF_POS             (3U)
#define RCC_CIFR_HSIRDYF_MSK             (0x1UL << RCC_CIFR_HSIRDYF_POS)       /*!< 0x00000008 */
#define RCC_CIFR_HSIRDYF                 RCC_CIFR_HSIRDYF_MSK
#define RCC_CIFR_HSERDYF_POS             (4U)
#define RCC_CIFR_HSERDYF_MSK             (0x1UL << RCC_CIFR_HSERDYF_POS)       /*!< 0x00000010 */
#define RCC_CIFR_HSERDYF                 RCC_CIFR_HSERDYF_MSK
#define RCC_CIFR_PLLRDYF_POS             (5U)
#define RCC_CIFR_PLLRDYF_MSK             (0x1UL << RCC_CIFR_PLLRDYF_POS)       /*!< 0x00000020 */
#define RCC_CIFR_PLLRDYF                 RCC_CIFR_PLLRDYF_MSK
#define RCC_CIFR_CSSF_POS                (8U)
#define RCC_CIFR_CSSF_MSK                (0x1UL << RCC_CIFR_CSSF_POS)          /*!< 0x00000100 */
#define RCC_CIFR_CSSF                    RCC_CIFR_CSSF_MSK
#define RCC_CIFR_LSECSSF_POS             (9U)
#define RCC_CIFR_LSECSSF_MSK             (0x1UL << RCC_CIFR_LSECSSF_POS)       /*!< 0x00000200 */
#define RCC_CIFR_LSECSSF                 RCC_CIFR_LSECSSF_MSK

/********************  Bit definition for RCC_CICR register  ******************/
#define RCC_CICR_LSIRDYC_POS             (0U)
#define RCC_CICR_LSIRDYC_MSK             (0x1UL << RCC_CICR_LSIRDYC_POS)       /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC                 RCC_CICR_LSIRDYC_MSK
#define RCC_CICR_LSERDYC_POS             (1U)
#define RCC_CICR_LSERDYC_MSK             (0x1UL << RCC_CICR_LSERDYC_POS)       /*!< 0x00000002 */
#define RCC_CICR_LSERDYC                 RCC_CICR_LSERDYC_MSK
#define RCC_CICR_HSI48RDYC_POS           (2U)
#define RCC_CICR_HSI48RDYC_MSK           (0x1UL << RCC_CICR_HSI48RDYC_POS)      /*!< 0x00000004 */
#define RCC_CICR_HSI48RDYC               RCC_CICR_HSI48RDYC_MSK
#define RCC_CICR_HSIRDYC_POS             (3U)
#define RCC_CICR_HSIRDYC_MSK             (0x1UL << RCC_CICR_HSIRDYC_POS)       /*!< 0x00000008 */
#define RCC_CICR_HSIRDYC                 RCC_CICR_HSIRDYC_MSK
#define RCC_CICR_HSERDYC_POS             (4U)
#define RCC_CICR_HSERDYC_MSK             (0x1UL << RCC_CICR_HSERDYC_POS)       /*!< 0x00000010 */
#define RCC_CICR_HSERDYC                 RCC_CICR_HSERDYC_MSK
#define RCC_CICR_PLLRDYC_POS             (5U)
#define RCC_CICR_PLLRDYC_MSK             (0x1UL << RCC_CICR_PLLRDYC_POS)       /*!< 0x00000020 */
#define RCC_CICR_PLLRDYC                 RCC_CICR_PLLRDYC_MSK
#define RCC_CICR_CSSC_POS                (8U)
#define RCC_CICR_CSSC_MSK                (0x1UL << RCC_CICR_CSSC_POS)          /*!< 0x00000100 */
#define RCC_CICR_CSSC                    RCC_CICR_CSSC_MSK
#define RCC_CICR_LSECSSC_POS             (9U)
#define RCC_CICR_LSECSSC_MSK             (0x1UL << RCC_CICR_LSECSSC_POS)       /*!< 0x00000200 */
#define RCC_CICR_LSECSSC                 RCC_CICR_LSECSSC_MSK

