ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for RCC_IOPRSTR register  ****************/
#define RCC_IOPRSTR_GPIOARST_POS         (0U)
#define RCC_IOPRSTR_GPIOARST_MSK         (0x1UL << RCC_IOPRSTR_GPIOARST_POS)   /*!< 0x00000001 */
#define RCC_IOPRSTR_GPIOARST             RCC_IOPRSTR_GPIOARST_MSK
#define RCC_IOPRSTR_GPIOBRST_POS         (1U)
#define RCC_IOPRSTR_GPIOBRST_MSK         (0x1UL << RCC_IOPRSTR_GPIOBRST_POS)   /*!< 0x00000002 */
#define RCC_IOPRSTR_GPIOBRST             RCC_IOPRSTR_GPIOBRST_MSK
#define RCC_IOPRSTR_GPIOCRST_POS         (2U)
#define RCC_IOPRSTR_GPIOCRST_MSK         (0x1UL << RCC_IOPRSTR_GPIOCRST_POS)   /*!< 0x00000004 */
#define RCC_IOPRSTR_GPIOCRST             RCC_IOPRSTR_GPIOCRST_MSK
#define RCC_IOPRSTR_GPIODRST_POS         (3U)
#define RCC_IOPRSTR_GPIODRST_MSK         (0x1UL << RCC_IOPRSTR_GPIODRST_POS)   /*!< 0x00000008 */
#define RCC_IOPRSTR_GPIODRST             RCC_IOPRSTR_GPIODRST_MSK
#define RCC_IOPRSTR_GPIOERST_POS         (4U)
#define RCC_IOPRSTR_GPIOERST_MSK         (0x1UL << RCC_IOPRSTR_GPIOERST_POS)   /*!< 0x00000010 */
#define RCC_IOPRSTR_GPIOERST             RCC_IOPRSTR_GPIOERST_MSK
#define RCC_IOPRSTR_GPIOFRST_POS         (5U)
#define RCC_IOPRSTR_GPIOFRST_MSK         (0x1UL << RCC_IOPRSTR_GPIOFRST_POS)   /*!< 0x00000020 */
#define RCC_IOPRSTR_GPIOFRST             RCC_IOPRSTR_GPIOFRST_MSK

/********************  Bit definition for RCC_AHBRSTR register  ***************/
#define RCC_AHBRSTR_DMA1RST_POS          (0U)
#define RCC_AHBRSTR_DMA1RST_MSK          (0x1UL << RCC_AHBRSTR_DMA1RST_POS)    /*!< 0x00000001 */
#define RCC_AHBRSTR_DMA1RST              RCC_AHBRSTR_DMA1RST_MSK
#define RCC_AHBRSTR_DMA2RST_POS          (1U)
#define RCC_AHBRSTR_DMA2RST_MSK          (0x1UL << RCC_AHBRSTR_DMA2RST_POS)    /*!< 0x00000002 */
#define RCC_AHBRSTR_DMA2RST              RCC_AHBRSTR_DMA2RST_MSK
#define RCC_AHBRSTR_FLASHRST_POS         (8U)
#define RCC_AHBRSTR_FLASHRST_MSK         (0x1UL << RCC_AHBRSTR_FLASHRST_POS)   /*!< 0x00000100 */
#define RCC_AHBRSTR_FLASHRST             RCC_AHBRSTR_FLASHRST_MSK
#define RCC_AHBRSTR_CRCRST_POS           (12U)
#define RCC_AHBRSTR_CRCRST_MSK           (0x1UL << RCC_AHBRSTR_CRCRST_POS)     /*!< 0x00001000 */
#define RCC_AHBRSTR_CRCRST               RCC_AHBRSTR_CRCRST_MSK

/********************  Bit definition for RCC_APBRSTR1 register  **************/
#define RCC_APBRSTR1_TIM2RST_POS         (0U)
#define RCC_APBRSTR1_TIM2RST_MSK         (0x1UL << RCC_APBRSTR1_TIM2RST_POS)   /*!< 0x00000001 */
#define RCC_APBRSTR1_TIM2RST             RCC_APBRSTR1_TIM2RST_MSK
#define RCC_APBRSTR1_TIM3RST_POS         (1U)
#define RCC_APBRSTR1_TIM3RST_MSK         (0x1UL << RCC_APBRSTR1_TIM3RST_POS)   /*!< 0x00000002 */
#define RCC_APBRSTR1_TIM3RST             RCC_APBRSTR1_TIM3RST_MSK
#define RCC_APBRSTR1_TIM4RST_POS         (2U)
#define RCC_APBRSTR1_TIM4RST_MSK         (0x1UL << RCC_APBRSTR1_TIM4RST_POS)   /*!< 0x00000004 */
#define RCC_APBRSTR1_TIM4RST             RCC_APBRSTR1_TIM4RST_MSK
#define RCC_APBRSTR1_TIM6RST_POS         (4U)
#define RCC_APBRSTR1_TIM6RST_MSK         (0x1UL << RCC_APBRSTR1_TIM6RST_POS)   /*!< 0x00000010 */
#define RCC_APBRSTR1_TIM6RST             RCC_APBRSTR1_TIM6RST_MSK
#define RCC_APBRSTR1_TIM7RST_POS         (5U)
#define RCC_APBRSTR1_TIM7RST_MSK         (0x1UL << RCC_APBRSTR1_TIM7RST_POS)   /*!< 0x00000020 */
#define RCC_APBRSTR1_TIM7RST             RCC_APBRSTR1_TIM7RST_MSK
#define RCC_APBRSTR1_LPUART2RST_POS      (7U)
#define RCC_APBRSTR1_LPUART2RST_MSK      (0x1UL << RCC_APBRSTR1_LPUART2RST_POS)/*!< 0x00000080 */
#define RCC_APBRSTR1_LPUART2RST          RCC_APBRSTR1_LPUART2RST_MSK
#define RCC_APBRSTR1_USART5RST_POS       (8U)
#define RCC_APBRSTR1_USART5RST_MSK       (0x1UL << RCC_APBRSTR1_USART5RST_POS) /*!< 0x00000100 */
#define RCC_APBRSTR1_USART5RST           RCC_APBRSTR1_USART5RST_MSK
#define RCC_APBRSTR1_USART6RST_POS       (9U)
#define RCC_APBRSTR1_USART6RST_MSK       (0x1UL << RCC_APBRSTR1_USART6RST_POS) /*!< 0x00000200 */
#define RCC_APBRSTR1_USART6RST           RCC_APBRSTR1_USART6RST_MSK
#define RCC_APBRSTR1_FDCANRST_POS        (12U)
#define RCC_APBRSTR1_FDCANRST_MSK        (0x1UL << RCC_APBRSTR1_FDCANRST_POS)  /*!< 0x00001000 */
#define RCC_APBRSTR1_FDCANRST            RCC_APBRSTR1_FDCANRST_MSK
#define RCC_APBRSTR1_USBRST_POS          (13U)
#define RCC_APBRSTR1_USBRST_MSK          (0x1UL << RCC_APBRSTR1_USBRST_POS)    /*!< 0x00002000 */
#define RCC_APBRSTR1_USBRST              RCC_APBRSTR1_USBRST_MSK
#define RCC_APBRSTR1_SPI2RST_POS         (14U)
#define RCC_APBRSTR1_SPI2RST_MSK         (0x1UL << RCC_APBRSTR1_SPI2RST_POS)   /*!< 0x00004000 */
#define RCC_APBRSTR1_SPI2RST             RCC_APBRSTR1_SPI2RST_MSK
#define RCC_APBRSTR1_SPI3RST_POS         (15U)
#define RCC_APBRSTR1_SPI3RST_MSK         (0x1UL << RCC_APBRSTR1_SPI3RST_POS)   /*!< 0x00008000 */
#define RCC_APBRSTR1_SPI3RST             RCC_APBRSTR1_SPI3RST_MSK
#define RCC_APBRSTR1_CRSRST_POS          (16U)
#define RCC_APBRSTR1_CRSRST_MSK          (0x1UL << RCC_APBRSTR1_CRSRST_POS)    /*!< 0x00010000 */
#define RCC_APBRSTR1_CRSRST              RCC_APBRSTR1_CRSRST_MSK
#define RCC_APBRSTR1_USART2RST_POS       (17U)
#define RCC_APBRSTR1_USART2RST_MSK       (0x1UL << RCC_APBRSTR1_USART2RST_POS) /*!< 0x00020000 */
#define RCC_APBRSTR1_USART2RST           RCC_APBRSTR1_USART2RST_MSK
#define RCC_APBRSTR1_USART3RST_POS       (18U)
#define RCC_APBRSTR1_USART3RST_MSK       (0x1UL << RCC_APBRSTR1_USART3RST_POS) /*!< 0x00040000 */
#define RCC_APBRSTR1_USART3RST           RCC_APBRSTR1_USART3RST_MSK
#define RCC_APBRSTR1_USART4RST_POS       (19U)
#define RCC_APBRSTR1_USART4RST_MSK       (0x1UL << RCC_APBRSTR1_USART4RST_POS) /*!< 0x00080000 */
#define RCC_APBRSTR1_USART4RST           RCC_APBRSTR1_USART4RST_MSK
#define RCC_APBRSTR1_LPUART1RST_POS      (20U)
#define RCC_APBRSTR1_LPUART1RST_MSK      (0x1UL << RCC_APBRSTR1_LPUART1RST_POS) /*!< 0x00100000 */
#define RCC_APBRSTR1_LPUART1RST          RCC_APBRSTR1_LPUART1RST_MSK
#define RCC_APBRSTR1_I2C1RST_POS         (21U)
#define RCC_APBRSTR1_I2C1RST_MSK         (0x1UL << RCC_APBRSTR1_I2C1RST_POS)    /*!< 0x00200000 */
#define RCC_APBRSTR1_I2C1RST             RCC_APBRSTR1_I2C1RST_MSK
#define RCC_APBRSTR1_I2C2RST_POS         (22U)
#define RCC_APBRSTR1_I2C2RST_MSK         (0x1UL << RCC_APBRSTR1_I2C2RST_POS)    /*!< 0x00400000 */
#define RCC_APBRSTR1_I2C2RST             RCC_APBRSTR1_I2C2RST_MSK
#define RCC_APBRSTR1_I2C3RST_POS         (23U)
#define RCC_APBRSTR1_I2C3RST_MSK         (0x1UL << RCC_APBRSTR1_I2C3RST_POS)    /*!< 0x00800000 */
#define RCC_APBRSTR1_I2C3RST             RCC_APBRSTR1_I2C3RST_MSK
#define RCC_APBRSTR1_CECRST_POS          (24U)
#define RCC_APBRSTR1_CECRST_MSK          (0x1UL << RCC_APBRSTR1_CECRST_POS)     /*!< 0x01000000 */
#define RCC_APBRSTR1_CECRST              RCC_APBRSTR1_CECRST_MSK
#define RCC_APBRSTR1_UCPD1RST_POS        (25U)
#define RCC_APBRSTR1_UCPD1RST_MSK        (0x1UL << RCC_APBRSTR1_UCPD1RST_POS)   /*!< 0x02000000 */
#define RCC_APBRSTR1_UCPD1RST            RCC_APBRSTR1_UCPD1RST_MSK
#define RCC_APBRSTR1_UCPD2RST_POS        (26U)
#define RCC_APBRSTR1_UCPD2RST_MSK        (0x1UL << RCC_APBRSTR1_UCPD2RST_POS)   /*!< 0x04000000 */
#define RCC_APBRSTR1_UCPD2RST            RCC_APBRSTR1_UCPD2RST_MSK
#define RCC_APBRSTR1_DBGRST_POS          (27U)
#define RCC_APBRSTR1_DBGRST_MSK          (0x1UL << RCC_APBRSTR1_DBGRST_POS)     /*!< 0x08000000 */
#define RCC_APBRSTR1_DBGRST              RCC_APBRSTR1_DBGRST_MSK
#define RCC_APBRSTR1_PWRRST_POS          (28U)
#define RCC_APBRSTR1_PWRRST_MSK          (0x1UL << RCC_APBRSTR1_PWRRST_POS)     /*!< 0x10000000 */
#define RCC_APBRSTR1_PWRRST              RCC_APBRSTR1_PWRRST_MSK
#define RCC_APBRSTR1_DAC1RST_POS         (29U)
#define RCC_APBRSTR1_DAC1RST_MSK         (0x1UL << RCC_APBRSTR1_DAC1RST_POS)    /*!< 0x20000000 */
#define RCC_APBRSTR1_DAC1RST             RCC_APBRSTR1_DAC1RST_MSK
#define RCC_APBRSTR1_LPTIM2RST_POS       (30U)
#define RCC_APBRSTR1_LPTIM2RST_MSK       (0x1UL << RCC_APBRSTR1_LPTIM2RST_POS)  /*!< 0x40000000 */
#define RCC_APBRSTR1_LPTIM2RST           RCC_APBRSTR1_LPTIM2RST_MSK
#define RCC_APBRSTR1_LPTIM1RST_POS       (31U)
#define RCC_APBRSTR1_LPTIM1RST_MSK       (0x1UL << RCC_APBRSTR1_LPTIM1RST_POS)  /*!< 0x80000000 */
#define RCC_APBRSTR1_LPTIM1RST           RCC_APBRSTR1_LPTIM1RST_MSK

/********************  Bit definition for RCC_APBRSTR2 register  **************/
#define RCC_APBRSTR2_SYSCFGRST_POS       (0U)
#define RCC_APBRSTR2_SYSCFGRST_MSK       (0x1UL << RCC_APBRSTR2_SYSCFGRST_POS)  /*!< 0x00000001 */
#define RCC_APBRSTR2_SYSCFGRST           RCC_APBRSTR2_SYSCFGRST_MSK
#define RCC_APBRSTR2_TIM1RST_POS         (11U)
#define RCC_APBRSTR2_TIM1RST_MSK         (0x1UL << RCC_APBRSTR2_TIM1RST_POS)    /*!< 0x00000800 */
#define RCC_APBRSTR2_TIM1RST             RCC_APBRSTR2_TIM1RST_MSK
#define RCC_APBRSTR2_SPI1RST_POS         (12U)
#define RCC_APBRSTR2_SPI1RST_MSK         (0x1UL << RCC_APBRSTR2_SPI1RST_POS)    /*!< 0x00001000 */
#define RCC_APBRSTR2_SPI1RST             RCC_APBRSTR2_SPI1RST_MSK
#define RCC_APBRSTR2_USART1RST_POS       (14U)
#define RCC_APBRSTR2_USART1RST_MSK       (0x1UL << RCC_APBRSTR2_USART1RST_POS)  /*!< 0x00004000 */
#define RCC_APBRSTR2_USART1RST           RCC_APBRSTR2_USART1RST_MSK
#define RCC_APBRSTR2_TIM14RST_POS        (15U)
#define RCC_APBRSTR2_TIM14RST_MSK        (0x1UL << RCC_APBRSTR2_TIM14RST_POS)   /*!< 0x00008000 */
#define RCC_APBRSTR2_TIM14RST            RCC_APBRSTR2_TIM14RST_MSK
#define RCC_APBRSTR2_TIM15RST_POS        (16U)
#define RCC_APBRSTR2_TIM15RST_MSK        (0x1UL << RCC_APBRSTR2_TIM15RST_POS)   /*!< 0x00010000 */
#define RCC_APBRSTR2_TIM15RST            RCC_APBRSTR2_TIM15RST_MSK
#define RCC_APBRSTR2_TIM16RST_POS        (17U)
#define RCC_APBRSTR2_TIM16RST_MSK        (0x1UL << RCC_APBRSTR2_TIM16RST_POS)   /*!< 0x00020000 */
#define RCC_APBRSTR2_TIM16RST            RCC_APBRSTR2_TIM16RST_MSK
#define RCC_APBRSTR2_TIM17RST_POS        (18U)
#define RCC_APBRSTR2_TIM17RST_MSK        (0x1UL << RCC_APBRSTR2_TIM17RST_POS)   /*!< 0x00040000 */
#define RCC_APBRSTR2_TIM17RST            RCC_APBRSTR2_TIM17RST_MSK
#define RCC_APBRSTR2_ADCRST_POS          (20U)
#define RCC_APBRSTR2_ADCRST_MSK          (0x1UL << RCC_APBRSTR2_ADCRST_POS)     /*!< 0x00100000 */
#define RCC_APBRSTR2_ADCRST              RCC_APBRSTR2_ADCRST_MSK

/********************  Bit definition for RCC_IOPENR register  ****************/
#define RCC_IOPENR_GPIOAEN_POS           (0U)
#define RCC_IOPENR_GPIOAEN_MSK           (0x1UL << RCC_IOPENR_GPIOAEN_POS)      /*!< 0x00000001 */
#define RCC_IOPENR_GPIOAEN               RCC_IOPENR_GPIOAEN_MSK
#define RCC_IOPENR_GPIOBEN_POS           (1U)
#define RCC_IOPENR_GPIOBEN_MSK           (0x1UL << RCC_IOPENR_GPIOBEN_POS)      /*!< 0x00000002 */
#define RCC_IOPENR_GPIOBEN               RCC_IOPENR_GPIOBEN_MSK
#define RCC_IOPENR_GPIOCEN_POS           (2U)
#define RCC_IOPENR_GPIOCEN_MSK           (0x1UL << RCC_IOPENR_GPIOCEN_POS)      /*!< 0x00000004 */
#define RCC_IOPENR_GPIOCEN               RCC_IOPENR_GPIOCEN_MSK
#define RCC_IOPENR_GPIODEN_POS           (3U)
#define RCC_IOPENR_GPIODEN_MSK           (0x1UL << RCC_IOPENR_GPIODEN_POS)      /*!< 0x00000008 */
#define RCC_IOPENR_GPIODEN               RCC_IOPENR_GPIODEN_MSK
#define RCC_IOPENR_GPIOEEN_POS           (4U)
#define RCC_IOPENR_GPIOEEN_MSK           (0x1UL << RCC_IOPENR_GPIOEEN_POS)      /*!< 0x00000010 */
#define RCC_IOPENR_GPIOEEN               RCC_IOPENR_GPIOEEN_MSK
#define RCC_IOPENR_GPIOFEN_POS           (5U)
#define RCC_IOPENR_GPIOFEN_MSK           (0x1UL << RCC_IOPENR_GPIOFEN_POS)      /*!< 0x00000020 */
#define RCC_IOPENR_GPIOFEN               RCC_IOPENR_GPIOFEN_MSK

/********************  Bit definition for RCC_AHBENR register  ****************/
#define RCC_AHBENR_DMA1EN_POS            (0U)
#define RCC_AHBENR_DMA1EN_MSK            (0x1UL << RCC_AHBENR_DMA1EN_POS)       /*!< 0x00000001 */
#define RCC_AHBENR_DMA1EN                RCC_AHBENR_DMA1EN_MSK
#define RCC_AHBENR_DMA2EN_POS            (1U)
#define RCC_AHBENR_DMA2EN_MSK            (0x1UL << RCC_AHBENR_DMA2EN_POS)       /*!< 0x00000002 */
#define RCC_AHBENR_DMA2EN                RCC_AHBENR_DMA2EN_MSK
#define RCC_AHBENR_FLASHEN_POS           (8U)
#define RCC_AHBENR_FLASHEN_MSK           (0x1UL << RCC_AHBENR_FLASHEN_POS)      /*!< 0x00000100 */
#define RCC_AHBENR_FLASHEN               RCC_AHBENR_FLASHEN_MSK
#define RCC_AHBENR_CRCEN_POS             (12U)
#define RCC_AHBENR_CRCEN_MSK             (0x1UL << RCC_AHBENR_CRCEN_POS)        /*!< 0x00001000 */
#define RCC_AHBENR_CRCEN                 RCC_AHBENR_CRCEN_MSK

/********************  Bit definition for RCC_APBENR1 register  ***************/
#define RCC_APBENR1_TIM2EN_POS           (0U)
#define RCC_APBENR1_TIM2EN_MSK           (0x1UL << RCC_APBENR1_TIM2EN_POS)      /*!< 0x00000001 */
#define RCC_APBENR1_TIM2EN               RCC_APBENR1_TIM2EN_MSK
#define RCC_APBENR1_TIM3EN_POS           (1U)
#define RCC_APBENR1_TIM3EN_MSK           (0x1UL << RCC_APBENR1_TIM3EN_POS)      /*!< 0x00000002 */
#define RCC_APBENR1_TIM3EN               RCC_APBENR1_TIM3EN_MSK
#define RCC_APBENR1_TIM4EN_POS           (2U)
#define RCC_APBENR1_TIM4EN_MSK           (0x1UL << RCC_APBENR1_TIM4EN_POS)      /*!< 0x00000004 */
#define RCC_APBENR1_TIM4EN               RCC_APBENR1_TIM4EN_MSK
#define RCC_APBENR1_TIM6EN_POS           (4U)
#define RCC_APBENR1_TIM6EN_MSK           (0x1UL << RCC_APBENR1_TIM6EN_POS)      /*!< 0x00000010 */
#define RCC_APBENR1_TIM6EN               RCC_APBENR1_TIM6EN_MSK
#define RCC_APBENR1_TIM7EN_POS           (5U)
#define RCC_APBENR1_TIM7EN_MSK           (0x1UL << RCC_APBENR1_TIM7EN_POS)      /*!< 0x00000020 */
#define RCC_APBENR1_TIM7EN               RCC_APBENR1_TIM7EN_MSK
#define RCC_APBENR1_LPUART2EN_POS        (7U)
#define RCC_APBENR1_LPUART2EN_MSK        (0x1UL << RCC_APBENR1_LPUART2EN_POS)   /*!< 0x00000080 */
#define RCC_APBENR1_LPUART2EN            RCC_APBENR1_LPUART2EN_MSK
#define RCC_APBENR1_USART5EN_POS         (8U)
#define RCC_APBENR1_USART5EN_MSK         (0x1UL << RCC_APBENR1_USART5EN_POS)    /*!< 0x00000100 */
#define RCC_APBENR1_USART5EN             RCC_APBENR1_USART5EN_MSK
#define RCC_APBENR1_USART6EN_POS         (9U)
#define RCC_APBENR1_USART6EN_MSK         (0x1UL << RCC_APBENR1_USART6EN_POS)    /*!< 0x00000200 */
#define RCC_APBENR1_USART6EN             RCC_APBENR1_USART6EN_MSK
#define RCC_APBENR1_RTCAPBEN_POS         (10U)
#define RCC_APBENR1_RTCAPBEN_MSK         (0x1UL << RCC_APBENR1_RTCAPBEN_POS)    /*!< 0x00000400 */
#define RCC_APBENR1_RTCAPBEN             RCC_APBENR1_RTCAPBEN_MSK
#define RCC_APBENR1_WWDGEN_POS           (11U)
#define RCC_APBENR1_WWDGEN_MSK           (0x1UL << RCC_APBENR1_WWDGEN_POS)      /*!< 0x00000800 */
#define RCC_APBENR1_WWDGEN               RCC_APBENR1_WWDGEN_MSK
#define RCC_APBENR1_FDCANEN_POS          (12U)
#define RCC_APBENR1_FDCANEN_MSK          (0x1UL << RCC_APBENR1_FDCANEN_POS)     /*!< 0x00001000 */
#define RCC_APBENR1_FDCANEN              RCC_APBENR1_FDCANEN_MSK
#define RCC_APBENR1_USBEN_POS            (13U)
#define RCC_APBENR1_USBEN_MSK            (0x1UL << RCC_APBENR1_USBEN_POS)       /*!< 0x00002000 */
#define RCC_APBENR1_USBEN                RCC_APBENR1_USBEN_MSK
#define RCC_APBENR1_SPI2EN_POS           (14U)
#define RCC_APBENR1_SPI2EN_MSK           (0x1UL << RCC_APBENR1_SPI2EN_POS)      /*!< 0x00004000 */
#define RCC_APBENR1_SPI2EN               RCC_APBENR1_SPI2EN_MSK
#define RCC_APBENR1_SPI3EN_POS           (15U)
#define RCC_APBENR1_SPI3EN_MSK           (0x1UL << RCC_APBENR1_SPI3EN_POS)      /*!< 0x00008000 */
#define RCC_APBENR1_SPI3EN               RCC_APBENR1_SPI3EN_MSK
#define RCC_APBENR1_CRSEN_POS            (16U)
#define RCC_APBENR1_CRSEN_MSK            (0x1UL << RCC_APBENR1_CRSEN_POS)       /*!< 0x00010000 */
#define RCC_APBENR1_CRSEN                RCC_APBENR1_CRSEN_MSK
#define RCC_APBENR1_USART2EN_POS         (17U)
#define RCC_APBENR1_USART2EN_MSK         (0x1UL << RCC_APBENR1_USART2EN_POS)    /*!< 0x00020000 */
#define RCC_APBENR1_USART2EN             RCC_APBENR1_USART2EN_MSK
#define RCC_APBENR1_USART3EN_POS         (18U)
#define RCC_APBENR1_USART3EN_MSK         (0x1UL << RCC_APBENR1_USART3EN_POS)    /*!< 0x00040000 */
#define RCC_APBENR1_USART3EN             RCC_APBENR1_USART3EN_MSK
#define RCC_APBENR1_USART4EN_POS         (19U)
#define RCC_APBENR1_USART4EN_MSK         (0x1UL << RCC_APBENR1_USART4EN_POS)    /*!< 0x00080000 */
#define RCC_APBENR1_USART4EN             RCC_APBENR1_USART4EN_MSK
#define RCC_APBENR1_LPUART1EN_POS        (20U)
#define RCC_APBENR1_LPUART1EN_MSK        (0x1UL << RCC_APBENR1_LPUART1EN_POS)   /*!< 0x00100000 */
#define RCC_APBENR1_LPUART1EN            RCC_APBENR1_LPUART1EN_MSK
#define RCC_APBENR1_I2C1EN_POS           (21U)
#define RCC_APBENR1_I2C1EN_MSK           (0x1UL << RCC_APBENR1_I2C1EN_POS)      /*!< 0x00200000 */
#define RCC_APBENR1_I2C1EN               RCC_APBENR1_I2C1EN_MSK
#define RCC_APBENR1_I2C2EN_POS           (22U)
#define RCC_APBENR1_I2C2EN_MSK           (0x1UL << RCC_APBENR1_I2C2EN_POS)      /*!< 0x00400000 */
#define RCC_APBENR1_I2C2EN               RCC_APBENR1_I2C2EN_MSK
#define RCC_APBENR1_I2C3EN_POS           (23U)
#define RCC_APBENR1_I2C3EN_MSK           (0x1UL << RCC_APBENR1_I2C3EN_POS)      /*!< 0x00800000 */
#define RCC_APBENR1_I2C3EN               RCC_APBENR1_I2C3EN_MSK
#define RCC_APBENR1_CECEN_POS            (24U)
#define RCC_APBENR1_CECEN_MSK            (0x1UL << RCC_APBENR1_CECEN_POS)       /*!< 0x01000000 */
#define RCC_APBENR1_CECEN                RCC_APBENR1_CECEN_MSK
#define RCC_APBENR1_UCPD1EN_POS          (25U)
#define RCC_APBENR1_UCPD1EN_MSK          (0x1UL << RCC_APBENR1_UCPD1EN_POS)     /*!< 0x02000000 */
#define RCC_APBENR1_UCPD1EN              RCC_APBENR1_UCPD1EN_MSK
#define RCC_APBENR1_UCPD2EN_POS          (26U)
#define RCC_APBENR1_UCPD2EN_MSK          (0x1UL << RCC_APBENR1_UCPD2EN_POS)     /*!< 0x04000000 */
#define RCC_APBENR1_UCPD2EN              RCC_APBENR1_UCPD2EN_MSK
#define RCC_APBENR1_DBGEN_POS            (27U)
#define RCC_APBENR1_DBGEN_MSK            (0x1UL << RCC_APBENR1_DBGEN_POS)       /*!< 0x08000000 */
#define RCC_APBENR1_DBGEN                RCC_APBENR1_DBGEN_MSK
#define RCC_APBENR1_PWREN_POS            (28U)
#define RCC_APBENR1_PWREN_MSK            (0x1UL << RCC_APBENR1_PWREN_POS)       /*!< 0x10000000 */
#define RCC_APBENR1_PWREN                RCC_APBENR1_PWREN_MSK
#define RCC_APBENR1_DAC1EN_POS           (29U)
#define RCC_APBENR1_DAC1EN_MSK           (0x1UL << RCC_APBENR1_DAC1EN_POS)      /*!< 0x20000000 */
#define RCC_APBENR1_DAC1EN               RCC_APBENR1_DAC1EN_MSK
#define RCC_APBENR1_LPTIM2EN_POS         (30U)
#define RCC_APBENR1_LPTIM2EN_MSK         (0x1UL << RCC_APBENR1_LPTIM2EN_POS)    /*!< 0x40000000 */
#define RCC_APBENR1_LPTIM2EN             RCC_APBENR1_LPTIM2EN_MSK
#define RCC_APBENR1_LPTIM1EN_POS         (31U)
#define RCC_APBENR1_LPTIM1EN_MSK         (0x1UL << RCC_APBENR1_LPTIM1EN_POS)    /*!< 0x80000000 */
#define RCC_APBENR1_LPTIM1EN             RCC_APBENR1_LPTIM1EN_MSK

/********************  Bit definition for RCC_APBENR2 register  **************/
#define RCC_APBENR2_SYSCFGEN_POS         (0U)
#define RCC_APBENR2_SYSCFGEN_MSK         (0x1UL << RCC_APBENR2_SYSCFGEN_POS)    /*!< 0x00000001 */
#define RCC_APBENR2_SYSCFGEN             RCC_APBENR2_SYSCFGEN_MSK
#define RCC_APBENR2_TIM1EN_POS           (11U)
#define RCC_APBENR2_TIM1EN_MSK           (0x1UL << RCC_APBENR2_TIM1EN_POS)      /*!< 0x00000800 */
#define RCC_APBENR2_TIM1EN               RCC_APBENR2_TIM1EN_MSK
#define RCC_APBENR2_SPI1EN_POS           (12U)
#define RCC_APBENR2_SPI1EN_MSK           (0x1UL << RCC_APBENR2_SPI1EN_POS)      /*!< 0x00001000 */
#define RCC_APBENR2_SPI1EN               RCC_APBENR2_SPI1EN_MSK
#define RCC_APBENR2_USART1EN_POS         (14U)
#define RCC_APBENR2_USART1EN_MSK         (0x1UL << RCC_APBENR2_USART1EN_POS)    /*!< 0x00004000 */
#define RCC_APBENR2_USART1EN             RCC_APBENR2_USART1EN_MSK
#define RCC_APBENR2_TIM14EN_POS          (15U)
#define RCC_APBENR2_TIM14EN_MSK          (0x1UL << RCC_APBENR2_TIM14EN_POS)     /*!< 0x00008000 */
#define RCC_APBENR2_TIM14EN              RCC_APBENR2_TIM14EN_MSK
#define RCC_APBENR2_TIM15EN_POS          (16U)
#define RCC_APBENR2_TIM15EN_MSK          (0x1UL << RCC_APBENR2_TIM15EN_POS)     /*!< 0x00010000 */
#define RCC_APBENR2_TIM15EN              RCC_APBENR2_TIM15EN_MSK
#define RCC_APBENR2_TIM16EN_POS          (17U)
#define RCC_APBENR2_TIM16EN_MSK          (0x1UL << RCC_APBENR2_TIM16EN_POS)     /*!< 0x00020000 */
#define RCC_APBENR2_TIM16EN              RCC_APBENR2_TIM16EN_MSK
#define RCC_APBENR2_TIM17EN_POS          (18U)
#define RCC_APBENR2_TIM17EN_MSK          (0x1UL << RCC_APBENR2_TIM17EN_POS)     /*!< 0x00040000 */
#define RCC_APBENR2_TIM17EN              RCC_APBENR2_TIM17EN_MSK
#define RCC_APBENR2_ADCEN_POS            (20U)
#define RCC_APBENR2_ADCEN_MSK            (0x1UL << RCC_APBENR2_ADCEN_POS)       /*!< 0x00100000 */
#define RCC_APBENR2_ADCEN                RCC_APBENR2_ADCEN_MSK

