ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for RCC_IOPSMENR register  *************/
#define RCC_IOPSMENR_GPIOASMEN_POS       (0U)
#define RCC_IOPSMENR_GPIOASMEN_MSK       (0x1UL << RCC_IOPSMENR_GPIOASMEN_POS)  /*!< 0x00000001 */
#define RCC_IOPSMENR_GPIOASMEN           RCC_IOPSMENR_GPIOASMEN_MSK
#define RCC_IOPSMENR_GPIOBSMEN_POS       (1U)
#define RCC_IOPSMENR_GPIOBSMEN_MSK       (0x1UL << RCC_IOPSMENR_GPIOBSMEN_POS)  /*!< 0x00000002 */
#define RCC_IOPSMENR_GPIOBSMEN           RCC_IOPSMENR_GPIOBSMEN_MSK
#define RCC_IOPSMENR_GPIOCSMEN_POS       (2U)
#define RCC_IOPSMENR_GPIOCSMEN_MSK       (0x1UL << RCC_IOPSMENR_GPIOCSMEN_POS)  /*!< 0x00000004 */
#define RCC_IOPSMENR_GPIOCSMEN           RCC_IOPSMENR_GPIOCSMEN_MSK
#define RCC_IOPSMENR_GPIODSMEN_POS       (3U)
#define RCC_IOPSMENR_GPIODSMEN_MSK       (0x1UL << RCC_IOPSMENR_GPIODSMEN_POS)  /*!< 0x00000008 */
#define RCC_IOPSMENR_GPIODSMEN           RCC_IOPSMENR_GPIODSMEN_MSK
#define RCC_IOPSMENR_GPIOESMEN_POS       (4U)
#define RCC_IOPSMENR_GPIOESMEN_MSK       (0x1UL << RCC_IOPSMENR_GPIOESMEN_POS)  /*!< 0x00000010 */
#define RCC_IOPSMENR_GPIOESMEN           RCC_IOPSMENR_GPIOESMEN_MSK
#define RCC_IOPSMENR_GPIOFSMEN_POS       (5U)
#define RCC_IOPSMENR_GPIOFSMEN_MSK       (0x1UL << RCC_IOPSMENR_GPIOFSMEN_POS)  /*!< 0x00000020 */
#define RCC_IOPSMENR_GPIOFSMEN           RCC_IOPSMENR_GPIOFSMEN_MSK

/********************  Bit definition for RCC_AHBSMENR register  *************/
#define RCC_AHBSMENR_DMA1SMEN_POS        (0U)
#define RCC_AHBSMENR_DMA1SMEN_MSK        (0x1UL << RCC_AHBSMENR_DMA1SMEN_POS)   /*!< 0x00000001 */
#define RCC_AHBSMENR_DMA1SMEN            RCC_AHBSMENR_DMA1SMEN_MSK
#define RCC_AHBSMENR_DMA2SMEN_POS        (1U)
#define RCC_AHBSMENR_DMA2SMEN_MSK        (0x1UL << RCC_AHBSMENR_DMA2SMEN_POS)   /*!< 0x00000002 */
#define RCC_AHBSMENR_DMA2SMEN            RCC_AHBSMENR_DMA2SMEN_MSK
#define RCC_AHBSMENR_FLASHSMEN_POS       (8U)
#define RCC_AHBSMENR_FLASHSMEN_MSK       (0x1UL << RCC_AHBSMENR_FLASHSMEN_POS)  /*!< 0x00000100 */
#define RCC_AHBSMENR_FLASHSMEN           RCC_AHBSMENR_FLASHSMEN_MSK
#define RCC_AHBSMENR_SRAMSMEN_POS        (9U)
#define RCC_AHBSMENR_SRAMSMEN_MSK        (0x1UL << RCC_AHBSMENR_SRAMSMEN_POS)   /*!< 0x00000200 */
#define RCC_AHBSMENR_SRAMSMEN            RCC_AHBSMENR_SRAMSMEN_MSK
#define RCC_AHBSMENR_CRCSMEN_POS         (12U)
#define RCC_AHBSMENR_CRCSMEN_MSK         (0x1UL << RCC_AHBSMENR_CRCSMEN_POS)    /*!< 0x00001000 */
#define RCC_AHBSMENR_CRCSMEN             RCC_AHBSMENR_CRCSMEN_MSK

/********************  Bit definition for RCC_APBSMENR1 register  *************/
#define RCC_APBSMENR1_TIM2SMEN_POS       (0U)
#define RCC_APBSMENR1_TIM2SMEN_MSK       (0x1UL << RCC_APBSMENR1_TIM2SMEN_POS)  /*!< 0x00000001 */
#define RCC_APBSMENR1_TIM2SMEN           RCC_APBSMENR1_TIM2SMEN_MSK
#define RCC_APBSMENR1_TIM3SMEN_POS       (1U)
#define RCC_APBSMENR1_TIM3SMEN_MSK       (0x1UL << RCC_APBSMENR1_TIM3SMEN_POS)  /*!< 0x00000002 */
#define RCC_APBSMENR1_TIM3SMEN           RCC_APBSMENR1_TIM3SMEN_MSK
#define RCC_APBSMENR1_TIM4SMEN_POS       (2U)
#define RCC_APBSMENR1_TIM4SMEN_MSK       (0x1UL << RCC_APBSMENR1_TIM4SMEN_POS)  /*!< 0x00000004 */
#define RCC_APBSMENR1_TIM4SMEN           RCC_APBSMENR1_TIM4SMEN_MSK
#define RCC_APBSMENR1_TIM6SMEN_POS       (4U)
#define RCC_APBSMENR1_TIM6SMEN_MSK       (0x1UL << RCC_APBSMENR1_TIM6SMEN_POS)  /*!< 0x00000010 */
#define RCC_APBSMENR1_TIM6SMEN           RCC_APBSMENR1_TIM6SMEN_MSK
#define RCC_APBSMENR1_TIM7SMEN_POS       (5U)
#define RCC_APBSMENR1_TIM7SMEN_MSK       (0x1UL << RCC_APBSMENR1_TIM7SMEN_POS)  /*!< 0x00000020 */
#define RCC_APBSMENR1_TIM7SMEN           RCC_APBSMENR1_TIM7SMEN_MSK
#define RCC_APBSMENR1_LPUART2SMEN_POS    (7U)
#define RCC_APBSMENR1_LPUART2SMEN_MSK    (0x1UL << RCC_APBSMENR1_LPUART2SMEN_POS)/*!< 0x00000080 */
#define RCC_APBSMENR1_LPUART2SMEN        RCC_APBSMENR1_LPUART2SMEN_MSK
#define RCC_APBSMENR1_USART5SMEN_POS     (8U)
#define RCC_APBSMENR1_USART5SMEN_MSK     (0x1UL << RCC_APBSMENR1_USART5SMEN_POS) /*!< 0x00000100 */
#define RCC_APBSMENR1_USART5SMEN         RCC_APBSMENR1_USART5SMEN_MSK
#define RCC_APBSMENR1_USART6SMEN_POS     (9U)
#define RCC_APBSMENR1_USART6SMEN_MSK     (0x1UL << RCC_APBSMENR1_USART6SMEN_POS) /*!< 0x00000200 */
#define RCC_APBSMENR1_USART6SMEN         RCC_APBSMENR1_USART6SMEN_MSK
#define RCC_APBSMENR1_RTCAPBSMEN_POS     (10U)
#define RCC_APBSMENR1_RTCAPBSMEN_MSK     (0x1UL << RCC_APBSMENR1_RTCAPBSMEN_POS) /*!< 0x00000400 */
#define RCC_APBSMENR1_RTCAPBSMEN         RCC_APBSMENR1_RTCAPBSMEN_MSK
#define RCC_APBSMENR1_WWDGSMEN_POS       (11U)
#define RCC_APBSMENR1_WWDGSMEN_MSK       (0x1UL << RCC_APBSMENR1_WWDGSMEN_POS)   /*!< 0x00000800 */
#define RCC_APBSMENR1_WWDGSMEN           RCC_APBSMENR1_WWDGSMEN_MSK
#define RCC_APBSMENR1_FDCANSMEN_POS      (12U)
#define RCC_APBSMENR1_FDCANSMEN_MSK      (0x1UL << RCC_APBSMENR1_FDCANSMEN_POS)  /*!< 0x00001000 */
#define RCC_APBSMENR1_FDCANSMEN          RCC_APBSMENR1_FDCANSMEN_MSK
#define RCC_APBSMENR1_USBSMEN_POS        (13U)
#define RCC_APBSMENR1_USBSMEN_MSK        (0x1UL << RCC_APBSMENR1_USBSMEN_POS)    /*!< 0x00002000 */
#define RCC_APBSMENR1_USBSMEN            RCC_APBSMENR1_USBSMEN_MSK
#define RCC_APBSMENR1_SPI2SMEN_POS       (14U)
#define RCC_APBSMENR1_SPI2SMEN_MSK       (0x1UL << RCC_APBSMENR1_SPI2SMEN_POS)   /*!< 0x00004000 */
#define RCC_APBSMENR1_SPI2SMEN           RCC_APBSMENR1_SPI2SMEN_MSK
#define RCC_APBSMENR1_SPI3SMEN_POS       (15U)
#define RCC_APBSMENR1_SPI3SMEN_MSK       (0x1UL << RCC_APBSMENR1_SPI3SMEN_POS)   /*!< 0x00008000 */
#define RCC_APBSMENR1_SPI3SMEN           RCC_APBSMENR1_SPI3SMEN_MSK
#define RCC_APBSMENR1_CRSSMEN_POS        (16U)
#define RCC_APBSMENR1_CRSSMEN_MSK        (0x1UL << RCC_APBSMENR1_CRSSMEN_POS)   /*!< 0x00010000 */
#define RCC_APBSMENR1_CRSSMEN            RCC_APBSMENR1_CRSSMEN_MSK
#define RCC_APBSMENR1_USART2SMEN_POS     (17U)
#define RCC_APBSMENR1_USART2SMEN_MSK     (0x1UL << RCC_APBSMENR1_USART2SMEN_POS) /*!< 0x00020000 */
#define RCC_APBSMENR1_USART2SMEN         RCC_APBSMENR1_USART2SMEN_MSK
#define RCC_APBSMENR1_USART3SMEN_POS     (18U)
#define RCC_APBSMENR1_USART3SMEN_MSK     (0x1UL << RCC_APBSMENR1_USART3SMEN_POS) /*!< 0x00040000 */
#define RCC_APBSMENR1_USART3SMEN         RCC_APBSMENR1_USART3SMEN_MSK
#define RCC_APBSMENR1_USART4SMEN_POS     (19U)
#define RCC_APBSMENR1_USART4SMEN_MSK     (0x1UL << RCC_APBSMENR1_USART4SMEN_POS) /*!< 0x00080000 */
#define RCC_APBSMENR1_USART4SMEN         RCC_APBSMENR1_USART4SMEN_MSK
#define RCC_APBSMENR1_LPUART1SMEN_POS    (20U)
#define RCC_APBSMENR1_LPUART1SMEN_MSK    (0x1UL << RCC_APBSMENR1_LPUART1SMEN_POS) /*!< 0x00100000 */
#define RCC_APBSMENR1_LPUART1SMEN        RCC_APBSMENR1_LPUART1SMEN_MSK
#define RCC_APBSMENR1_I2C1SMEN_POS       (21U)
#define RCC_APBSMENR1_I2C1SMEN_MSK       (0x1UL << RCC_APBSMENR1_I2C1SMEN_POS)   /*!< 0x00200000 */
#define RCC_APBSMENR1_I2C1SMEN           RCC_APBSMENR1_I2C1SMEN_MSK
#define RCC_APBSMENR1_I2C2SMEN_POS       (22U)
#define RCC_APBSMENR1_I2C2SMEN_MSK       (0x1UL << RCC_APBSMENR1_I2C2SMEN_POS)   /*!< 0x00400000 */
#define RCC_APBSMENR1_I2C2SMEN           RCC_APBSMENR1_I2C2SMEN_MSK
#define RCC_APBSMENR1_I2C3SMEN_POS       (23U)
#define RCC_APBSMENR1_I2C3SMEN_MSK       (0x1UL << RCC_APBSMENR1_I2C3SMEN_POS)   /*!< 0x00800000 */
#define RCC_APBSMENR1_I2C3SMEN           RCC_APBSMENR1_I2C3SMEN_MSK
#define RCC_APBSMENR1_CECSMEN_POS        (24U)
#define RCC_APBSMENR1_CECSMEN_MSK        (0x1UL << RCC_APBSMENR1_CECSMEN_POS)    /*!< 0x01000000 */
#define RCC_APBSMENR1_CECSMEN            RCC_APBSMENR1_CECSMEN_MSK
#define RCC_APBSMENR1_UCPD1SMEN_POS      (25U)
#define RCC_APBSMENR1_UCPD1SMEN_MSK      (0x1UL << RCC_APBSMENR1_UCPD1SMEN_POS)  /*!< 0x02000000 */
#define RCC_APBSMENR1_UCPD1SMEN          RCC_APBSMENR1_UCPD1SMEN_MSK
#define RCC_APBSMENR1_UCPD2SMEN_POS      (26U)
#define RCC_APBSMENR1_UCPD2SMEN_MSK      (0x1UL << RCC_APBSMENR1_UCPD2SMEN_POS)  /*!< 0x04000000 */
#define RCC_APBSMENR1_UCPD2SMEN          RCC_APBSMENR1_UCPD2SMEN_MSK
#define RCC_APBSMENR1_DBGSMEN_POS        (27U)
#define RCC_APBSMENR1_DBGSMEN_MSK        (0x1UL << RCC_APBSMENR1_DBGSMEN_POS)    /*!< 0x08000000 */
#define RCC_APBSMENR1_DBGSMEN            RCC_APBSMENR1_DBGSMEN_MSK
#define RCC_APBSMENR1_PWRSMEN_POS        (28U)
#define RCC_APBSMENR1_PWRSMEN_MSK        (0x1UL << RCC_APBSMENR1_PWRSMEN_POS)    /*!< 0x10000000 */
#define RCC_APBSMENR1_PWRSMEN            RCC_APBSMENR1_PWRSMEN_MSK
#define RCC_APBSMENR1_DAC1SMEN_POS       (29U)
#define RCC_APBSMENR1_DAC1SMEN_MSK       (0x1UL << RCC_APBSMENR1_DAC1SMEN_POS)   /*!< 0x20000000 */
#define RCC_APBSMENR1_DAC1SMEN           RCC_APBSMENR1_DAC1SMEN_MSK
#define RCC_APBSMENR1_LPTIM2SMEN_POS     (30U)
#define RCC_APBSMENR1_LPTIM2SMEN_MSK     (0x1UL << RCC_APBSMENR1_LPTIM2SMEN_POS) /*!< 0x40000000 */
#define RCC_APBSMENR1_LPTIM2SMEN         RCC_APBSMENR1_LPTIM2SMEN_MSK
#define RCC_APBSMENR1_LPTIM1SMEN_POS     (31U)
#define RCC_APBSMENR1_LPTIM1SMEN_MSK     (0x1UL << RCC_APBSMENR1_LPTIM1SMEN_POS) /*!< 0x80000000 */
#define RCC_APBSMENR1_LPTIM1SMEN         RCC_APBSMENR1_LPTIM1SMEN_MSK

/********************  Bit definition for RCC_APBSMENR2 register  *************/
#define RCC_APBSMENR2_SYSCFGSMEN_POS     (0U)
#define RCC_APBSMENR2_SYSCFGSMEN_MSK     (0x1UL << RCC_APBSMENR2_SYSCFGSMEN_POS) /*!< 0x00000001 */
#define RCC_APBSMENR2_SYSCFGSMEN         RCC_APBSMENR2_SYSCFGSMEN_MSK
#define RCC_APBSMENR2_TIM1SMEN_POS       (11U)
#define RCC_APBSMENR2_TIM1SMEN_MSK       (0x1UL << RCC_APBSMENR2_TIM1SMEN_POS)  /*!< 0x00000800 */
#define RCC_APBSMENR2_TIM1SMEN           RCC_APBSMENR2_TIM1SMEN_MSK
#define RCC_APBSMENR2_SPI1SMEN_POS       (12U)
#define RCC_APBSMENR2_SPI1SMEN_MSK       (0x1UL << RCC_APBSMENR2_SPI1SMEN_POS)  /*!< 0x00001000 */
#define RCC_APBSMENR2_SPI1SMEN           RCC_APBSMENR2_SPI1SMEN_MSK
#define RCC_APBSMENR2_USART1SMEN_POS     (14U)
#define RCC_APBSMENR2_USART1SMEN_MSK     (0x1UL << RCC_APBSMENR2_USART1SMEN_POS) /*!< 0x00004000 */
#define RCC_APBSMENR2_USART1SMEN         RCC_APBSMENR2_USART1SMEN_MSK
#define RCC_APBSMENR2_TIM14SMEN_POS      (15U)
#define RCC_APBSMENR2_TIM14SMEN_MSK      (0x1UL << RCC_APBSMENR2_TIM14SMEN_POS) /*!< 0x00008000 */
#define RCC_APBSMENR2_TIM14SMEN          RCC_APBSMENR2_TIM14SMEN_MSK
#define RCC_APBSMENR2_TIM15SMEN_POS      (16U)
#define RCC_APBSMENR2_TIM15SMEN_MSK      (0x1UL << RCC_APBSMENR2_TIM15SMEN_POS) /*!< 0x00010000 */
#define RCC_APBSMENR2_TIM15SMEN          RCC_APBSMENR2_TIM15SMEN_MSK
#define RCC_APBSMENR2_TIM16SMEN_POS      (17U)
#define RCC_APBSMENR2_TIM16SMEN_MSK      (0x1UL << RCC_APBSMENR2_TIM16SMEN_POS) /*!< 0x00020000 */
#define RCC_APBSMENR2_TIM16SMEN          RCC_APBSMENR2_TIM16SMEN_MSK
#define RCC_APBSMENR2_TIM17SMEN_POS      (18U)
#define RCC_APBSMENR2_TIM17SMEN_MSK      (0x1UL << RCC_APBSMENR2_TIM17SMEN_POS) /*!< 0x00040000 */
#define RCC_APBSMENR2_TIM17SMEN          RCC_APBSMENR2_TIM17SMEN_MSK
#define RCC_APBSMENR2_ADCSMEN_POS        (20U)
#define RCC_APBSMENR2_ADCSMEN_MSK        (0x1UL << RCC_APBSMENR2_ADCSMEN_POS)   /*!< 0x00100000 */
#define RCC_APBSMENR2_ADCSMEN            RCC_APBSMENR2_ADCSMEN_MSK

/********************  Bit definition for RCC_CCIPR register  ******************/
#define RCC_CCIPR_USART1SEL_POS          (0U)
#define RCC_CCIPR_USART1SEL_MSK          (0x3UL << RCC_CCIPR_USART1SEL_POS)     /*!< 0x00000003 */
#define RCC_CCIPR_USART1SEL              RCC_CCIPR_USART1SEL_MSK
#define RCC_CCIPR_USART1SEL_0            (0x1UL << RCC_CCIPR_USART1SEL_POS)     /*!< 0x00000001 */
#define RCC_CCIPR_USART1SEL_1            (0x2UL << RCC_CCIPR_USART1SEL_POS)     /*!< 0x00000002 */

