ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define RCC_CCIPR_USART2SEL_POS          (2U)
#define RCC_CCIPR_USART2SEL_MSK          (0x3UL << RCC_CCIPR_USART2SEL_POS)     /*!< 0x0000000C */
#define RCC_CCIPR_USART2SEL              RCC_CCIPR_USART2SEL_MSK
#define RCC_CCIPR_USART2SEL_0            (0x1UL << RCC_CCIPR_USART2SEL_POS)     /*!< 0x00000004 */
#define RCC_CCIPR_USART2SEL_1            (0x2UL << RCC_CCIPR_USART2SEL_POS)     /*!< 0x00000008 */

#define RCC_CCIPR_USART3SEL_POS          (4U)
#define RCC_CCIPR_USART3SEL_MSK          (0x3UL << RCC_CCIPR_USART3SEL_POS)     /*!< 0x00000030 */
#define RCC_CCIPR_USART3SEL              RCC_CCIPR_USART3SEL_MSK
#define RCC_CCIPR_USART3SEL_0            (0x1UL << RCC_CCIPR_USART3SEL_POS)     /*!< 0x00000010 */
#define RCC_CCIPR_USART3SEL_1            (0x2UL << RCC_CCIPR_USART3SEL_POS)     /*!< 0x00000020 */
#define RCC_CCIPR_CECSEL_POS             (6U)
#define RCC_CCIPR_CECSEL_MSK             (0x1UL << RCC_CCIPR_CECSEL_POS)        /*!< 0x00000040 */
#define RCC_CCIPR_CECSEL                 RCC_CCIPR_CECSEL_MSK

#define RCC_CCIPR_LPUART2SEL_POS         (8U)
#define RCC_CCIPR_LPUART2SEL_MSK         (0x3UL << RCC_CCIPR_LPUART2SEL_POS)    /*!< 0x00000300 */
#define RCC_CCIPR_LPUART2SEL             RCC_CCIPR_LPUART2SEL_MSK
#define RCC_CCIPR_LPUART2SEL_0           (0x1UL << RCC_CCIPR_LPUART2SEL_POS)    /*!< 0x00000100 */
#define RCC_CCIPR_LPUART2SEL_1           (0x2UL << RCC_CCIPR_LPUART2SEL_POS)    /*!< 0x00000200 */
#define RCC_CCIPR_LPUART1SEL_POS         (10U)
#define RCC_CCIPR_LPUART1SEL_MSK         (0x3UL << RCC_CCIPR_LPUART1SEL_POS)    /*!< 0x00000C00 */
#define RCC_CCIPR_LPUART1SEL             RCC_CCIPR_LPUART1SEL_MSK
#define RCC_CCIPR_LPUART1SEL_0           (0x1UL << RCC_CCIPR_LPUART1SEL_POS)    /*!< 0x00000400 */
#define RCC_CCIPR_LPUART1SEL_1           (0x2UL << RCC_CCIPR_LPUART1SEL_POS)    /*!< 0x00000800 */

#define RCC_CCIPR_I2C1SEL_POS            (12U)
#define RCC_CCIPR_I2C1SEL_MSK            (0x3UL << RCC_CCIPR_I2C1SEL_POS)       /*!< 0x00003000 */
#define RCC_CCIPR_I2C1SEL                RCC_CCIPR_I2C1SEL_MSK
#define RCC_CCIPR_I2C1SEL_0              (0x1UL << RCC_CCIPR_I2C1SEL_POS)       /*!< 0x00001000 */
#define RCC_CCIPR_I2C1SEL_1              (0x2UL << RCC_CCIPR_I2C1SEL_POS)       /*!< 0x00002000 */

#define RCC_CCIPR_I2C2SEL_POS           (14U)
#define RCC_CCIPR_I2C2SEL_MSK           (0x3UL << RCC_CCIPR_I2C2SEL_POS)        /*!< 0x0000C000 */
#define RCC_CCIPR_I2C2SEL               RCC_CCIPR_I2C2SEL_MSK
#define RCC_CCIPR_I2C2SEL_0             (0x1UL << RCC_CCIPR_I2C2SEL_POS)        /*!< 0x00004000 */
#define RCC_CCIPR_I2C2SEL_1             (0x2UL << RCC_CCIPR_I2C2SEL_POS)        /*!< 0x00008000 */

#define RCC_CCIPR_LPTIM1SEL_POS          (18U)
#define RCC_CCIPR_LPTIM1SEL_MSK          (0x3UL << RCC_CCIPR_LPTIM1SEL_POS)     /*!< 0x000C0000 */
#define RCC_CCIPR_LPTIM1SEL              RCC_CCIPR_LPTIM1SEL_MSK
#define RCC_CCIPR_LPTIM1SEL_0            (0x1UL << RCC_CCIPR_LPTIM1SEL_POS)     /*!< 0x00040000 */
#define RCC_CCIPR_LPTIM1SEL_1            (0x2UL << RCC_CCIPR_LPTIM1SEL_POS)     /*!< 0x00080000 */

#define RCC_CCIPR_LPTIM2SEL_POS          (20U)
#define RCC_CCIPR_LPTIM2SEL_MSK          (0x3UL << RCC_CCIPR_LPTIM2SEL_POS)     /*!< 0x00300000 */
#define RCC_CCIPR_LPTIM2SEL              RCC_CCIPR_LPTIM2SEL_MSK
#define RCC_CCIPR_LPTIM2SEL_0            (0x1UL << RCC_CCIPR_LPTIM2SEL_POS)     /*!< 0x00100000 */
#define RCC_CCIPR_LPTIM2SEL_1            (0x2UL << RCC_CCIPR_LPTIM2SEL_POS)     /*!< 0x00200000 */

#define RCC_CCIPR_TIM1SEL_POS            (22U)
#define RCC_CCIPR_TIM1SEL_MSK            (0x1UL << RCC_CCIPR_TIM1SEL_POS)       /*!< 0x00400000 */
#define RCC_CCIPR_TIM1SEL                RCC_CCIPR_TIM1SEL_MSK

#define RCC_CCIPR_TIM15SEL_POS           (24U)
#define RCC_CCIPR_TIM15SEL_MSK           (0x1UL << RCC_CCIPR_TIM15SEL_POS)      /*!< 0x01000000 */
#define RCC_CCIPR_TIM15SEL               RCC_CCIPR_TIM15SEL_MSK


#define RCC_CCIPR_ADCSEL_POS             (30U)
#define RCC_CCIPR_ADCSEL_MSK             (0x3UL << RCC_CCIPR_ADCSEL_POS)        /*!< 0xC0000000 */
#define RCC_CCIPR_ADCSEL                 RCC_CCIPR_ADCSEL_MSK
#define RCC_CCIPR_ADCSEL_0               (0x1UL << RCC_CCIPR_ADCSEL_POS)        /*!< 0x40000000 */
#define RCC_CCIPR_ADCSEL_1               (0x2UL << RCC_CCIPR_ADCSEL_POS)        /*!< 0x80000000 */

/********************  Bit definition for RCC_CCIPR2 register  ****************/
#define RCC_CCIPR2_I2S1SEL_POS            (0U)
#define RCC_CCIPR2_I2S1SEL_MSK            (0x3UL << RCC_CCIPR2_I2S1SEL_POS)     /*!< 0x00000003 */
#define RCC_CCIPR2_I2S1SEL                RCC_CCIPR2_I2S1SEL_MSK
#define RCC_CCIPR2_I2S1SEL_0              (0x1UL << RCC_CCIPR2_I2S1SEL_POS)     /*!< 0x00000001 */
#define RCC_CCIPR2_I2S1SEL_1              (0x2UL << RCC_CCIPR2_I2S1SEL_POS)     /*!< 0x00000002 */
#define RCC_CCIPR2_I2S2SEL_POS            (2U)
#define RCC_CCIPR2_I2S2SEL_MSK            (0x3UL << RCC_CCIPR2_I2S2SEL_POS)     /*!< 0x0000000C */
#define RCC_CCIPR2_I2S2SEL                RCC_CCIPR2_I2S2SEL_MSK
#define RCC_CCIPR2_I2S2SEL_0              (0x1UL << RCC_CCIPR2_I2S2SEL_POS)     /*!< 0x00000004 */
#define RCC_CCIPR2_I2S2SEL_1              (0x2UL << RCC_CCIPR2_I2S2SEL_POS)     /*!< 0x00000008 */
#define RCC_CCIPR2_FDCANSEL_POS           (8U)
#define RCC_CCIPR2_FDCANSEL_MSK           (0x3UL << RCC_CCIPR2_FDCANSEL_POS)    /*!< 0x00000300 */
#define RCC_CCIPR2_FDCANSEL               RCC_CCIPR2_FDCANSEL_MSK
#define RCC_CCIPR2_FDCANSEL_0             (0x1UL << RCC_CCIPR2_FDCANSEL_POS)    /*!< 0x00000100 */
#define RCC_CCIPR2_FDCANSEL_1             (0x2UL << RCC_CCIPR2_FDCANSEL_POS)    /*!< 0x00000200 */
#define RCC_CCIPR2_USBSEL_POS             (12U)
#define RCC_CCIPR2_USBSEL_MSK             (0x3UL << RCC_CCIPR2_USBSEL_POS)     /*!< 0x00003000 */
#define RCC_CCIPR2_USBSEL                 RCC_CCIPR2_USBSEL_MSK
#define RCC_CCIPR2_USBSEL_0               (0x1UL << RCC_CCIPR2_USBSEL_POS)      /*!< 0x00001000 */
#define RCC_CCIPR2_USBSEL_1               (0x2UL << RCC_CCIPR2_USBSEL_POS)      /*!< 0x00002000 */
/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_POS               (0U)
#define RCC_BDCR_LSEON_MSK               (0x1UL << RCC_BDCR_LSEON_POS)          /*!< 0x00000001 */
#define RCC_BDCR_LSEON                   RCC_BDCR_LSEON_MSK
#define RCC_BDCR_LSERDY_POS              (1U)
#define RCC_BDCR_LSERDY_MSK              (0x1UL << RCC_BDCR_LSERDY_POS)         /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                  RCC_BDCR_LSERDY_MSK
#define RCC_BDCR_LSEBYP_POS              (2U)
#define RCC_BDCR_LSEBYP_MSK              (0x1UL << RCC_BDCR_LSEBYP_POS)         /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                  RCC_BDCR_LSEBYP_MSK

#define RCC_BDCR_LSEDRV_POS              (3U)
#define RCC_BDCR_LSEDRV_MSK              (0x3UL << RCC_BDCR_LSEDRV_POS)         /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV                  RCC_BDCR_LSEDRV_MSK
#define RCC_BDCR_LSEDRV_0                (0x1UL << RCC_BDCR_LSEDRV_POS)         /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1                (0x2UL << RCC_BDCR_LSEDRV_POS)         /*!< 0x00000010 */

#define RCC_BDCR_LSECSSON_POS            (5U)
#define RCC_BDCR_LSECSSON_MSK            (0x1UL << RCC_BDCR_LSECSSON_POS)       /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON                RCC_BDCR_LSECSSON_MSK
#define RCC_BDCR_LSECSSD_POS             (6U)
#define RCC_BDCR_LSECSSD_MSK             (0x1UL << RCC_BDCR_LSECSSD_POS)        /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                 RCC_BDCR_LSECSSD_MSK

