ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define RCC_BDCR_RTCSEL_POS              (8U)
#define RCC_BDCR_RTCSEL_MSK              (0x3UL << RCC_BDCR_RTCSEL_POS)         /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                  RCC_BDCR_RTCSEL_MSK
#define RCC_BDCR_RTCSEL_0                (0x1UL << RCC_BDCR_RTCSEL_POS)         /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                (0x2UL << RCC_BDCR_RTCSEL_POS)         /*!< 0x00000200 */

#define  RCC_BDCR_RTCSEL_NOCLOCK         ((uint32)0x00000000)        //! No clock
#define  RCC_BDCR_RTCSEL_LSE             ((uint32)0x00000100)        //! LSE oscillator clock used as RTC clock
#define  RCC_BDCR_RTCSEL_LSI             ((uint32)0x00000200)        //! LSI oscillator clock used as RTC clock
#define  RCC_BDCR_RTCSEL_HSE             ((uint32)0x00000300)        //! HSE oscillator clock divided by 128 used as RTC clock

#define RCC_BDCR_RTCEN_POS               (15U)
#define RCC_BDCR_RTCEN_MSK               (0x1UL << RCC_BDCR_RTCEN_POS)          /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                   RCC_BDCR_RTCEN_MSK
#define RCC_BDCR_BDRST_POS               (16U)
#define RCC_BDCR_BDRST_MSK               (0x1UL << RCC_BDCR_BDRST_POS)          /*!< 0x00010000 */
#define RCC_BDCR_BDRST                   RCC_BDCR_BDRST_MSK

#define RCC_BDCR_LSCOEN_POS              (24U)
#define RCC_BDCR_LSCOEN_MSK              (0x1UL << RCC_BDCR_LSCOEN_POS)         /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                  RCC_BDCR_LSCOEN_MSK
#define RCC_BDCR_LSCOSEL_POS             (25U)
#define RCC_BDCR_LSCOSEL_MSK             (0x1UL << RCC_BDCR_LSCOSEL_POS)        /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                 RCC_BDCR_LSCOSEL_MSK

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_POS                (0U)
#define RCC_CSR_LSION_MSK                (0x1UL << RCC_CSR_LSION_POS)           /*!< 0x00000001 */
#define RCC_CSR_LSION                    RCC_CSR_LSION_MSK
#define RCC_CSR_LSIRDY_POS               (1U)
#define RCC_CSR_LSIRDY_MSK               (0x1UL << RCC_CSR_LSIRDY_POS)          /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                   RCC_CSR_LSIRDY_MSK

#define RCC_CSR_RMVF_POS                 (23U)
#define RCC_CSR_RMVF_MSK                 (0x1UL << RCC_CSR_RMVF_POS)            /*!< 0x00800000 */
#define RCC_CSR_RMVF                     RCC_CSR_RMVF_MSK
#define RCC_CSR_OBLRSTF_POS              (25U)
#define RCC_CSR_OBLRSTF_MSK              (0x1UL << RCC_CSR_OBLRSTF_POS)         /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                  RCC_CSR_OBLRSTF_MSK
#define RCC_CSR_PINRSTF_POS              (26U)
#define RCC_CSR_PINRSTF_MSK              (0x1UL << RCC_CSR_PINRSTF_POS)         /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                  RCC_CSR_PINRSTF_MSK
#define RCC_CSR_PWRRSTF_POS              (27U)
#define RCC_CSR_PWRRSTF_MSK              (0x1UL << RCC_CSR_PWRRSTF_POS)         /*!< 0x08000000 */
#define RCC_CSR_PWRRSTF                  RCC_CSR_PWRRSTF_MSK
#define RCC_CSR_SFTRSTF_POS              (28U)
#define RCC_CSR_SFTRSTF_MSK              (0x1UL << RCC_CSR_SFTRSTF_POS)         /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                  RCC_CSR_SFTRSTF_MSK
#define RCC_CSR_IWDGRSTF_POS             (29U)
#define RCC_CSR_IWDGRSTF_MSK             (0x1UL << RCC_CSR_IWDGRSTF_POS)        /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                 RCC_CSR_IWDGRSTF_MSK
#define RCC_CSR_WWDGRSTF_POS             (30U)
#define RCC_CSR_WWDGRSTF_MSK             (0x1UL << RCC_CSR_WWDGRSTF_POS)        /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                 RCC_CSR_WWDGRSTF_MSK
#define RCC_CSR_LPWRRSTF_POS             (31U)
#define RCC_CSR_LPWRRSTF_MSK             (0x1UL << RCC_CSR_LPWRRSTF_POS)        /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                 RCC_CSR_LPWRRSTF_MSK


//Useful macros
#define RCC_CLOCK_ENABLE_FOR_ALL_GPIO_PORTS()   ( RCC.IOPENR |= (RCC_IOPENR_GPIOAEN | \
                                                                RCC_IOPENR_GPIOBEN | \
                                                                RCC_IOPENR_GPIOCEN | \
                                                                RCC_IOPENR_GPIODEN | \
                                                                RCC_IOPENR_GPIOEEN | \
                                                                RCC_IOPENR_GPIOFEN) )


#define LL_RCC_USART1_CLKSOURCE_PCLK1      ((RCC_CCIPR_USART1SEL << 16U) | 0x00000000U)            /*!< PCLK1 clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_SYSCLK     ((RCC_CCIPR_USART1SEL << 16U) | RCC_CCIPR_USART1SEL_0)  /*!< SYSCLK clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_HSI        ((RCC_CCIPR_USART1SEL << 16U) | RCC_CCIPR_USART1SEL_1)  /*!< HSI clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_LSE        ((RCC_CCIPR_USART1SEL << 16U) | RCC_CCIPR_USART1SEL)    /*!< LSE clock used as USART1 clock source */

#define LL_RCC_USART2_CLKSOURCE_PCLK1      ((RCC_CCIPR_USART2SEL << 16U) | 0x00000000U)            /*!< PCLK1 clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_SYSCLK     ((RCC_CCIPR_USART2SEL << 16U) | RCC_CCIPR_USART2SEL_0)  /*!< SYSCLK clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_HSI        ((RCC_CCIPR_USART2SEL << 16U) | RCC_CCIPR_USART2SEL_1)  /*!< HSI clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_LSE        ((RCC_CCIPR_USART2SEL << 16U) | RCC_CCIPR_USART2SEL)    /*!< LSE clock used as USART2 clock source */

#define LL_RCC_USART3_CLKSOURCE_PCLK1      ((RCC_CCIPR_USART3SEL << 16U) | 0x00000000U)           /*!< PCLK1 clock used as USART3 clock source */
#define LL_RCC_USART3_CLKSOURCE_SYSCLK     ((RCC_CCIPR_USART3SEL << 16U) | RCC_CCIPR_USART3SEL_0) /*!< SYSCLK clock used as USART3 clock source */
#define LL_RCC_USART3_CLKSOURCE_HSI        ((RCC_CCIPR_USART3SEL << 16U) | RCC_CCIPR_USART3SEL_1) /*!< HSI clock used as USART3 clock source */
#define LL_RCC_USART3_CLKSOURCE_LSE        ((RCC_CCIPR_USART3SEL << 16U) | RCC_CCIPR_USART3SEL)   /*!< LSE clock used as USART3 clock source */

#define LL_RCC_I2C1_CLKSOURCE_PCLK1        0x00000000U                  /*!< PCLK1 clock used as I2C1 clock source */
#define LL_RCC_I2C1_CLKSOURCE_SYSCLK       RCC_CCIPR_I2C1SEL_0          /*!< SYSCLK clock used as I2C1 clock source */
#define LL_RCC_I2C1_CLKSOURCE_HSI          RCC_CCIPR_I2C1SEL_1          /*!< HSI clock used as I2C1 clock source */

#define LL_RCC_I2C2_CLKSOURCE_PCLK1        0x00000000U                  /*!< PCLK1 clock used as I2C1 clock source */
#define LL_RCC_I2C2_CLKSOURCE_SYSCLK       RCC_CCIPR_I2C2SEL_0          /*!< SYSCLK clock used as I2C1 clock source */
#define LL_RCC_I2C2_CLKSOURCE_HSI          RCC_CCIPR_I2C2SEL_1          /*!< HSI clock used as I2C1 clock source */

