ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- DEBUG REGISTERS --------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief Debug MCU
 */
typedef struct
{
  volatile uint32 IDCODE;      /*!< MCU device ID code,              Address offset: 0x00 */
  volatile uint32 CR;          /*!< Debug configuration register,    Address offset: 0x04 */
  volatile uint32 APBFZ1;      /*!< Debug APB freeze register 1,     Address offset: 0x08 */
  volatile uint32 APBFZ2;      /*!< Debug APB freeze register 2,     Address offset: 0x0C */
} DBG_TYPEDEF;

#define DBG              (*(DBG_TYPEDEF *) DBG_BASE)

/********************  Bit definition for DBG_IDCODE register  *************/
#define DBG_IDCODE_DEV_ID_POS                          (0U)
#define DBG_IDCODE_DEV_ID_MSK                          (0xFFFUL << DBG_IDCODE_DEV_ID_POS)  /*!< 0x00000FFF */
#define DBG_IDCODE_DEV_ID                              DBG_IDCODE_DEV_ID_MSK
#define DBG_IDCODE_REV_ID_POS                          (16U)
#define DBG_IDCODE_REV_ID_MSK                          (0xFFFFUL << DBG_IDCODE_REV_ID_POS) /*!< 0xFFFF0000 */
#define DBG_IDCODE_REV_ID                              DBG_IDCODE_REV_ID_MSK

/********************  Bit definition for DBG_CR register  *****************/
#define DBG_CR_DBG_STOP_POS                            (1U)
#define DBG_CR_DBG_STOP_MSK                            (0x1UL << DBG_CR_DBG_STOP_POS)      /*!< 0x00000002 */
#define DBG_CR_DBG_STOP                                DBG_CR_DBG_STOP_MSK
#define DBG_CR_DBG_STANDBY_POS                         (2U)
#define DBG_CR_DBG_STANDBY_MSK                         (0x1UL << DBG_CR_DBG_STANDBY_POS)   /*!< 0x00000004 */
#define DBG_CR_DBG_STANDBY                             DBG_CR_DBG_STANDBY_MSK


/********************  Bit definition for DBG_APB_FZ1 register  ***********/
#define DBG_APB_FZ1_DBG_TIM2_STOP_POS                  (0U)
#define DBG_APB_FZ1_DBG_TIM2_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_TIM2_STOP_POS) /*!< 0x00000001 */
#define DBG_APB_FZ1_DBG_TIM2_STOP                      DBG_APB_FZ1_DBG_TIM2_STOP_MSK
#define DBG_APB_FZ1_DBG_TIM3_STOP_POS                  (1U)
#define DBG_APB_FZ1_DBG_TIM3_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_TIM3_STOP_POS) /*!< 0x00000002 */
#define DBG_APB_FZ1_DBG_TIM3_STOP                      DBG_APB_FZ1_DBG_TIM3_STOP_MSK
#define DBG_APB_FZ1_DBG_TIM4_STOP_POS                  (2U)
#define DBG_APB_FZ1_DBG_TIM4_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_TIM4_STOP_POS) /*!< 0x00000004 */
#define DBG_APB_FZ1_DBG_TIM4_STOP                      DBG_APB_FZ1_DBG_TIM4_STOP_MSK
#define DBG_APB_FZ1_DBG_TIM6_STOP_POS                  (4U)
#define DBG_APB_FZ1_DBG_TIM6_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_TIM6_STOP_POS) /*!< 0x00000010 */
#define DBG_APB_FZ1_DBG_TIM6_STOP                      DBG_APB_FZ1_DBG_TIM6_STOP_MSK
#define DBG_APB_FZ1_DBG_TIM7_STOP_POS                  (5U)
#define DBG_APB_FZ1_DBG_TIM7_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_TIM7_STOP_POS) /*!< 0x00000020 */
#define DBG_APB_FZ1_DBG_TIM7_STOP                      DBG_APB_FZ1_DBG_TIM7_STOP_MSK
#define DBG_APB_FZ1_DBG_RTC_STOP_POS                   (10U)
#define DBG_APB_FZ1_DBG_RTC_STOP_MSK                   (0x1UL << DBG_APB_FZ1_DBG_RTC_STOP_POS)  /*!< 0x00000400 */
#define DBG_APB_FZ1_DBG_RTC_STOP                       DBG_APB_FZ1_DBG_RTC_STOP_MSK
#define DBG_APB_FZ1_DBG_WWDG_STOP_POS                  (11U)
#define DBG_APB_FZ1_DBG_WWDG_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_WWDG_STOP_POS) /*!< 0x00000800 */
#define DBG_APB_FZ1_DBG_WWDG_STOP                      DBG_APB_FZ1_DBG_WWDG_STOP_MSK
#define DBG_APB_FZ1_DBG_IWDG_STOP_POS                  (12U)
#define DBG_APB_FZ1_DBG_IWDG_STOP_MSK                  (0x1UL << DBG_APB_FZ1_DBG_IWDG_STOP_POS) /*!< 0x00001000 */
#define DBG_APB_FZ1_DBG_IWDG_STOP                      DBG_APB_FZ1_DBG_IWDG_STOP_MSK
#define DBG_APB_FZ1_DBG_I2C1_SMBUS_TIMEOUT_STOP_POS    (21U)
#define DBG_APB_FZ1_DBG_I2C1_SMBUS_TIMEOUT_STOP_MSK    (0x1UL << DBG_APB_FZ1_DBG_I2C1_SMBUS_TIMEOUT_STOP_POS) /*!< 0x00200000 */
#define DBG_APB_FZ1_DBG_I2C1_SMBUS_TIMEOUT_STOP        DBG_APB_FZ1_DBG_I2C1_SMBUS_TIMEOUT_STOP_MSK
#define DBG_APB_FZ1_DBG_I2C2_SMBUS_TIMEOUT_STOP_POS    (22U)
#define DBG_APB_FZ1_DBG_I2C2_SMBUS_TIMEOUT_STOP_MSK    (0x1UL << DBG_APB_FZ1_DBG_I2C2_SMBUS_TIMEOUT_STOP_POS) /*!< 0x00400000 */
#define DBG_APB_FZ1_DBG_I2C2_SMBUS_TIMEOUT_STOP        DBG_APB_FZ1_DBG_I2C2_SMBUS_TIMEOUT_STOP_MSK
#define DBG_APB_FZ1_DBG_LPTIM2_STOP_POS                (30U)
#define DBG_APB_FZ1_DBG_LPTIM2_STOP_MSK                (0x1UL << DBG_APB_FZ1_DBG_LPTIM2_STOP_POS) /*!< 0x40000000 */
#define DBG_APB_FZ1_DBG_LPTIM2_STOP                    DBG_APB_FZ1_DBG_LPTIM2_STOP_MSK
#define DBG_APB_FZ1_DBG_LPTIM1_STOP_POS                (31U)
#define DBG_APB_FZ1_DBG_LPTIM1_STOP_MSK                (0x1UL << DBG_APB_FZ1_DBG_LPTIM1_STOP_POS) /*!< 0x80000000 */
#define DBG_APB_FZ1_DBG_LPTIM1_STOP                    DBG_APB_FZ1_DBG_LPTIM1_STOP_MSK

/********************  Bit definition for DBG_APB_FZ2 register  ************/
#define DBG_APB_FZ2_DBG_TIM1_STOP_POS                  (11U)
#define DBG_APB_FZ2_DBG_TIM1_STOP_MSK                  (0x1UL << DBG_APB_FZ2_DBG_TIM1_STOP_POS)  /*!< 0x00000800 */
#define DBG_APB_FZ2_DBG_TIM1_STOP                      DBG_APB_FZ2_DBG_TIM1_STOP_MSK
#define DBG_APB_FZ2_DBG_TIM14_STOP_POS                 (15U)
#define DBG_APB_FZ2_DBG_TIM14_STOP_MSK                 (0x1UL << DBG_APB_FZ2_DBG_TIM14_STOP_POS) /*!< 0x00008000 */
#define DBG_APB_FZ2_DBG_TIM14_STOP                     DBG_APB_FZ2_DBG_TIM14_STOP_MSK
#define DBG_APB_FZ2_DBG_TIM15_STOP_POS                 (16U)
#define DBG_APB_FZ2_DBG_TIM15_STOP_MSK                 (0x1UL << DBG_APB_FZ2_DBG_TIM15_STOP_POS) /*!< 0x00010000 */
#define DBG_APB_FZ2_DBG_TIM15_STOP                     DBG_APB_FZ2_DBG_TIM15_STOP_MSK
#define DBG_APB_FZ2_DBG_TIM16_STOP_POS                 (17U)
#define DBG_APB_FZ2_DBG_TIM16_STOP_MSK                 (0x1UL << DBG_APB_FZ2_DBG_TIM16_STOP_POS) /*!< 0x00020000 */
#define DBG_APB_FZ2_DBG_TIM16_STOP                     DBG_APB_FZ2_DBG_TIM16_STOP_MSK
#define DBG_APB_FZ2_DBG_TIM17_STOP_POS                 (18U)
#define DBG_APB_FZ2_DBG_TIM17_STOP_MSK                 (0x1UL << DBG_APB_FZ2_DBG_TIM17_STOP_POS) /*!< 0x00040000 */
#define DBG_APB_FZ2_DBG_TIM17_STOP                     DBG_APB_FZ2_DBG_TIM17_STOP_MSK





