ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- IWDG REGISTERS ---------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief Independent Watchdog Register(IWDG)
 */
typedef struct
{
  volatile uint32 KR;          /*!< IWDG Key register,       Address offset: 0x00 */
  volatile uint32 PR;          /*!< IWDG Prescaler register, Address offset: 0x04 */
  volatile uint32 RLR;         /*!< IWDG Reload register,    Address offset: 0x08 */
  volatile uint32 SR;          /*!< IWDG Status register,    Address offset: 0x0C */
  volatile uint32 WINR;        /*!< IWDG Window register,    Address offset: 0x10 */
} IWDG_TYPEDEF;

#define IWDG                (*(IWDG_TYPEDEF *) IWDG_BASE)

#define IWDG_WRITE_ACCESS_ENABLE    ((uint32)0x00005555)
#define IWDG_WRITE_ACCESS_DISABLE   ((uint32)0x00000000)
#define IWDG_RELOAD                 ((uint32)0x0000AAAA)
#define IWDG_ENABLE                 ((uint32)0x0000CCCC)

/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_KR_KEY_POS      (0U)
#define IWDG_KR_KEY_MSK      (0xFFFFUL << IWDG_KR_KEY_POS)                     /*!< 0x0000FFFF */
#define IWDG_KR_KEY          IWDG_KR_KEY_MSK                                   /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_POS       (0U)
#define IWDG_PR_PR_MSK       (0x7UL << IWDG_PR_PR_POS)                         /*!< 0x00000007 */
#define IWDG_PR_PR           IWDG_PR_PR_MSK                                    /*!<PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_POS)                         /*!< 0x00000001 */
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_POS)                         /*!< 0x00000002 */
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_POS)                         /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_POS      (0U)
#define IWDG_RLR_RL_MSK      (0xFFFUL << IWDG_RLR_RL_POS)                      /*!< 0x00000FFF */
#define IWDG_RLR_RL          IWDG_RLR_RL_MSK                                   /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_POS      (0U)
#define IWDG_SR_PVU_MSK      (0x1UL << IWDG_SR_PVU_POS)                        /*!< 0x00000001 */
#define IWDG_SR_PVU          IWDG_SR_PVU_MSK                                   /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_POS      (1U)
#define IWDG_SR_RVU_MSK      (0x1UL << IWDG_SR_RVU_POS)                        /*!< 0x00000002 */
#define IWDG_SR_RVU          IWDG_SR_RVU_MSK                                   /*!< Watchdog counter reload value update */
#define IWDG_SR_WVU_POS      (2U)
#define IWDG_SR_WVU_MSK      (0x1UL << IWDG_SR_WVU_POS)                        /*!< 0x00000004 */
#define IWDG_SR_WVU          IWDG_SR_WVU_MSK                                   /*!< Watchdog counter window value update */

/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_WINR_WIN_POS    (0U)
#define IWDG_WINR_WIN_MSK    (0xFFFUL << IWDG_WINR_WIN_POS)                    /*!< 0x00000FFF */
#define IWDG_WINR_WIN        IWDG_WINR_WIN_MSK                                 /*!< Watchdog counter window value */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- WWDG REGISTERS --------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief Window Watchdog Register(WWDG)
 */
typedef struct
{
  volatile uint32 CR;          /*!< WWDG Control register,       Address offset: 0x00 */
  volatile uint32 CFR;         /*!< WWDG Configuration register, Address offset: 0x04 */
  volatile uint32 SR;          /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TYPEDEF;


#define WWDG                (*(WWDG_TYPEDEF *) WWDG_BASE)

/*******************  Bit definition for WWDG_CR register  ********************/
#define WWDG_CR_T_POS           (0U)
#define WWDG_CR_T_MSK           (0x7FUL << WWDG_CR_T_POS)                      /*!< 0x0000007F */
#define WWDG_CR_T               WWDG_CR_T_MSK                                  /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CR_T_0             (0x01UL << WWDG_CR_T_POS)                      /*!< 0x00000001 */
#define WWDG_CR_T_1             (0x02UL << WWDG_CR_T_POS)                      /*!< 0x00000002 */
#define WWDG_CR_T_2             (0x04UL << WWDG_CR_T_POS)                      /*!< 0x00000004 */
#define WWDG_CR_T_3             (0x08UL << WWDG_CR_T_POS)                      /*!< 0x00000008 */
#define WWDG_CR_T_4             (0x10UL << WWDG_CR_T_POS)                      /*!< 0x00000010 */
#define WWDG_CR_T_5             (0x20UL << WWDG_CR_T_POS)                      /*!< 0x00000020 */
#define WWDG_CR_T_6             (0x40UL << WWDG_CR_T_POS)                      /*!< 0x00000040 */

#define WWDG_CR_WDGA_POS        (7U)
#define WWDG_CR_WDGA_MSK        (0x1UL << WWDG_CR_WDGA_POS)                    /*!< 0x00000080 */
#define WWDG_CR_WDGA            WWDG_CR_WDGA_MSK                               /*!<Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W_POS          (0U)
#define WWDG_CFR_W_MSK          (0x7FUL << WWDG_CFR_W_POS)                     /*!< 0x0000007F */
#define WWDG_CFR_W              WWDG_CFR_W_MSK                                 /*!<W[6:0] bits (7-bit window value) */
#define WWDG_CFR_W_0            (0x01UL << WWDG_CFR_W_POS)                     /*!< 0x00000001 */
#define WWDG_CFR_W_1            (0x02UL << WWDG_CFR_W_POS)                     /*!< 0x00000002 */
#define WWDG_CFR_W_2            (0x04UL << WWDG_CFR_W_POS)                     /*!< 0x00000004 */
#define WWDG_CFR_W_3            (0x08UL << WWDG_CFR_W_POS)                     /*!< 0x00000008 */
#define WWDG_CFR_W_4            (0x10UL << WWDG_CFR_W_POS)                     /*!< 0x00000010 */
#define WWDG_CFR_W_5            (0x20UL << WWDG_CFR_W_POS)                     /*!< 0x00000020 */
#define WWDG_CFR_W_6            (0x40UL << WWDG_CFR_W_POS)                     /*!< 0x00000040 */

#define WWDG_CFR_WDGTB_POS      (11U)
#define WWDG_CFR_WDGTB_MSK      (0x7UL << WWDG_CFR_WDGTB_POS)                  /*!< 0x00003800 */
#define WWDG_CFR_WDGTB          WWDG_CFR_WDGTB_MSK                             /*!<WDGTB[2:0] bits (Timer Base) */
#define WWDG_CFR_WDGTB_0        (0x1UL << WWDG_CFR_WDGTB_POS)                  /*!< 0x00000800 */
#define WWDG_CFR_WDGTB_1        (0x2UL << WWDG_CFR_WDGTB_POS)                  /*!< 0x00001000 */
#define WWDG_CFR_WDGTB_2        (0x4UL << WWDG_CFR_WDGTB_POS)                  /*!< 0x00002000 */

#define WWDG_CFR_EWI_POS        (9U)
#define WWDG_CFR_EWI_MSK        (0x1UL << WWDG_CFR_EWI_POS)                    /*!< 0x00000200 */
#define WWDG_CFR_EWI            WWDG_CFR_EWI_MSK                               /*!<Early Wakeup Interrupt */

