ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_POS        (0U)
#define WWDG_SR_EWIF_MSK        (0x1UL << WWDG_SR_EWIF_POS)                    /*!< 0x00000001 */
#define WWDG_SR_EWIF            WWDG_SR_EWIF_MSK                               /*!<Early Wakeup Interrupt Flag */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- DMA CONTROLLER REGISTERS -----------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief DMA Controller
  */
typedef struct
{
  volatile uint32 CCR;         /*!< DMA channel x configuration register        */
  volatile uint32 CNDTR;       /*!< DMA channel x number of data register       */
  volatile uint32 CPAR;        /*!< DMA channel x peripheral address register   */
  volatile uint32 CMAR;        /*!< DMA channel x memory address register       */
} DMA_CHANNEL_TYPEDEF;

typedef struct
{
  volatile uint32 ISR;         /*!< DMA interrupt status register,                 Address offset: 0x00 */
  volatile uint32 IFCR;        /*!< DMA interrupt flag clear register,             Address offset: 0x04 */
} DMA_TYPEDEF;

/**
  * @brief DMA Multiplexer
  */
typedef struct
{
  volatile uint32   CCR[12];       /*!< DMA Multiplexer CHANNEL x Control Register    Address offset: 0x0004 * (channel x) */
}DMAMUX_CHANNEL_TYPEDEF;

typedef struct
{
  volatile uint32   CSR;       /*!< DMA CHANNEL Status Register                    Address offset: 0x0080   */
  volatile uint32   CFR;       /*!< DMA CHANNEL Clear Flag Register                Address offset: 0x0084   */
}DMAMUX_CHANNELSTATUS_TYPEDEF;

typedef struct
{
  volatile uint32   RGCR;        /*!< DMA Request Generator x Control Register     Address offset: 0x0100 + 0x0004 * (Req Gen x) */
}DMAMUX_REQUESTGEN_TYPEDEF;

typedef struct
{
  volatile uint32   RGSR;        /*!< DMA Request Generator Status Register        Address offset: 0x0140   */
  volatile uint32   RGCFR;       /*!< DMA Request Generator Clear Flag Register    Address offset: 0x0144   */
}DMAMUX_REQUESTGENSTATUS_TYPEDEF;


#define DMA1                       (*(DMA_TYPEDEF *) DMA1_BASE)
#define DMA2                       (*(DMA_TYPEDEF *) DMA2_BASE)

#define DMA1_CHANNEL1              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL1_BASE)
#define DMA1_CHANNEL2              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL2_BASE)
#define DMA1_CHANNEL3              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL3_BASE)
#define DMA1_CHANNEL4              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL4_BASE)
#define DMA1_CHANNEL5              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL5_BASE)
#define DMA1_CHANNEL6              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL6_BASE)
#define DMA1_CHANNEL7              (*(DMA_CHANNEL_TYPEDEF *) DMA1_CHANNEL7_BASE)
#define DMA2_CHANNEL1              (*(DMA_CHANNEL_TYPEDEF *) DMA2_CHANNEL1_BASE)
#define DMA2_CHANNEL2              (*(DMA_CHANNEL_TYPEDEF *) DMA2_CHANNEL2_BASE)
#define DMA2_CHANNEL3              (*(DMA_CHANNEL_TYPEDEF *) DMA2_CHANNEL3_BASE)
#define DMA2_CHANNEL4              (*(DMA_CHANNEL_TYPEDEF *) DMA2_CHANNEL4_BASE)
#define DMA2_CHANNEL5              (*(DMA_CHANNEL_TYPEDEF *) DMA2_CHANNEL5_BASE)

#define DMAMUX1                    (*(DMAMUX_CHANNEL_TYPEDEF *) DMAMUX1_BASE)

#define DMAMUX1_REQUESTGENERATOR0  (*(DMAMUX_REQUESTGEN_TYPEDEF *) DMAMUX1_REQUESTGENERATOR0_BASE)
#define DMAMUX1_REQUESTGENERATOR1  (*(DMAMUX_REQUESTGEN_TYPEDEF *) DMAMUX1_REQUESTGENERATOR1_BASE)
#define DMAMUX1_REQUESTGENERATOR2  (*(DMAMUX_REQUESTGEN_TYPEDEF *) DMAMUX1_REQUESTGENERATOR2_BASE)
#define DMAMUX1_REQUESTGENERATOR3  (*(DMAMUX_REQUESTGEN_TYPEDEF *) DMAMUX1_REQUESTGENERATOR3_BASE)

#define DMAMUX1_CHANNELSTATUS      (*(DMAMUX_CHANNELSTATUS_TYPEDEF *) DMAMUX1_CHANNELSTATUS_BASE)
#define DMAMUX1_REQUESTGENSTATUS   (*(DMAMUX_REQUESTGENSTATUS_TYPEDEF *) DMAMUX1_REQUESTGENSTATUS_BASE)


/*******************  Bit definition for DMA_ISR register  ********************/
#define DMA_ISR_GIF1_POS       (0U)
#define DMA_ISR_GIF1_MSK       (0x1UL << DMA_ISR_GIF1_POS)                     /*!< 0x00000001 */
#define DMA_ISR_GIF1           DMA_ISR_GIF1_MSK                                /*!< CHANNEL 1 Global interrupt flag */
#define DMA_ISR_TCIF1_POS      (1U)
#define DMA_ISR_TCIF1_MSK      (0x1UL << DMA_ISR_TCIF1_POS)                    /*!< 0x00000002 */
#define DMA_ISR_TCIF1          DMA_ISR_TCIF1_MSK                               /*!< CHANNEL 1 Transfer Complete flag */
#define DMA_ISR_HTIF1_POS      (2U)
#define DMA_ISR_HTIF1_MSK      (0x1UL << DMA_ISR_HTIF1_POS)                    /*!< 0x00000004 */
#define DMA_ISR_HTIF1          DMA_ISR_HTIF1_MSK                               /*!< CHANNEL 1 Half Transfer flag */
#define DMA_ISR_TEIF1_POS      (3U)
#define DMA_ISR_TEIF1_MSK      (0x1UL << DMA_ISR_TEIF1_POS)                    /*!< 0x00000008 */
#define DMA_ISR_TEIF1          DMA_ISR_TEIF1_MSK                               /*!< CHANNEL 1 Transfer Error flag */
#define DMA_ISR_GIF2_POS       (4U)
#define DMA_ISR_GIF2_MSK       (0x1UL << DMA_ISR_GIF2_POS)                     /*!< 0x00000010 */
#define DMA_ISR_GIF2           DMA_ISR_GIF2_MSK                                /*!< CHANNEL 2 Global interrupt flag */
#define DMA_ISR_TCIF2_POS      (5U)
#define DMA_ISR_TCIF2_MSK      (0x1UL << DMA_ISR_TCIF2_POS)                    /*!< 0x00000020 */
#define DMA_ISR_TCIF2          DMA_ISR_TCIF2_MSK                               /*!< CHANNEL 2 Transfer Complete flag */
#define DMA_ISR_HTIF2_POS      (6U)
#define DMA_ISR_HTIF2_MSK      (0x1UL << DMA_ISR_HTIF2_POS)                    /*!< 0x00000040 */
#define DMA_ISR_HTIF2          DMA_ISR_HTIF2_MSK                               /*!< CHANNEL 2 Half Transfer flag */
#define DMA_ISR_TEIF2_POS      (7U)
#define DMA_ISR_TEIF2_MSK      (0x1UL << DMA_ISR_TEIF2_POS)                    /*!< 0x00000080 */
#define DMA_ISR_TEIF2          DMA_ISR_TEIF2_MSK                               /*!< CHANNEL 2 Transfer Error flag */
#define DMA_ISR_GIF3_POS       (8U)
#define DMA_ISR_GIF3_MSK       (0x1UL << DMA_ISR_GIF3_POS)                     /*!< 0x00000100 */
#define DMA_ISR_GIF3           DMA_ISR_GIF3_MSK                                /*!< CHANNEL 3 Global interrupt flag */
#define DMA_ISR_TCIF3_POS      (9U)
#define DMA_ISR_TCIF3_MSK      (0x1UL << DMA_ISR_TCIF3_POS)                    /*!< 0x00000200 */
#define DMA_ISR_TCIF3          DMA_ISR_TCIF3_MSK                               /*!< CHANNEL 3 Transfer Complete flag */
#define DMA_ISR_HTIF3_POS      (10U)
#define DMA_ISR_HTIF3_MSK      (0x1UL << DMA_ISR_HTIF3_POS)                    /*!< 0x00000400 */
#define DMA_ISR_HTIF3          DMA_ISR_HTIF3_MSK                               /*!< CHANNEL 3 Half Transfer flag */
#define DMA_ISR_TEIF3_POS      (11U)
#define DMA_ISR_TEIF3_MSK      (0x1UL << DMA_ISR_TEIF3_POS)                    /*!< 0x00000800 */
#define DMA_ISR_TEIF3          DMA_ISR_TEIF3_MSK                               /*!< CHANNEL 3 Transfer Error flag */
#define DMA_ISR_GIF4_POS       (12U)
#define DMA_ISR_GIF4_MSK       (0x1UL << DMA_ISR_GIF4_POS)                     /*!< 0x00001000 */
#define DMA_ISR_GIF4           DMA_ISR_GIF4_MSK                                /*!< CHANNEL 4 Global interrupt flag */
#define DMA_ISR_TCIF4_POS      (13U)
#define DMA_ISR_TCIF4_MSK      (0x1UL << DMA_ISR_TCIF4_POS)                    /*!< 0x00002000 */
#define DMA_ISR_TCIF4          DMA_ISR_TCIF4_MSK                               /*!< CHANNEL 4 Transfer Complete flag */
#define DMA_ISR_HTIF4_POS      (14U)
#define DMA_ISR_HTIF4_MSK      (0x1UL << DMA_ISR_HTIF4_POS)                    /*!< 0x00004000 */
#define DMA_ISR_HTIF4          DMA_ISR_HTIF4_MSK                               /*!< CHANNEL 4 Half Transfer flag */
#define DMA_ISR_TEIF4_POS      (15U)
#define DMA_ISR_TEIF4_MSK      (0x1UL << DMA_ISR_TEIF4_POS)                    /*!< 0x00008000 */
#define DMA_ISR_TEIF4          DMA_ISR_TEIF4_MSK                               /*!< CHANNEL 4 Transfer Error flag */
#define DMA_ISR_GIF5_POS       (16U)
#define DMA_ISR_GIF5_MSK       (0x1UL << DMA_ISR_GIF5_POS)                     /*!< 0x00010000 */
#define DMA_ISR_GIF5           DMA_ISR_GIF5_MSK                                /*!< CHANNEL 5 Global interrupt flag */
#define DMA_ISR_TCIF5_POS      (17U)
#define DMA_ISR_TCIF5_MSK      (0x1UL << DMA_ISR_TCIF5_POS)                    /*!< 0x00020000 */
#define DMA_ISR_TCIF5          DMA_ISR_TCIF5_MSK                               /*!< CHANNEL 5 Transfer Complete flag */
#define DMA_ISR_HTIF5_POS      (18U)
#define DMA_ISR_HTIF5_MSK      (0x1UL << DMA_ISR_HTIF5_POS)                    /*!< 0x00040000 */
#define DMA_ISR_HTIF5          DMA_ISR_HTIF5_MSK                               /*!< CHANNEL 5 Half Transfer flag */
#define DMA_ISR_TEIF5_POS      (19U)
#define DMA_ISR_TEIF5_MSK      (0x1UL << DMA_ISR_TEIF5_POS)                    /*!< 0x00080000 */
#define DMA_ISR_TEIF5          DMA_ISR_TEIF5_MSK                               /*!< CHANNEL 5 Transfer Error flag */
#define DMA_ISR_GIF6_POS       (20U)
#define DMA_ISR_GIF6_MSK       (0x1UL << DMA_ISR_GIF6_POS)                     /*!< 0x00100000 */
#define DMA_ISR_GIF6           DMA_ISR_GIF6_MSK                                /*!< CHANNEL 6 Global interrupt flag */
#define DMA_ISR_TCIF6_POS      (21U)
#define DMA_ISR_TCIF6_MSK      (0x1UL << DMA_ISR_TCIF6_POS)                    /*!< 0x00200000 */
#define DMA_ISR_TCIF6          DMA_ISR_TCIF6_MSK                               /*!< CHANNEL 6 Transfer Complete flag */
#define DMA_ISR_HTIF6_POS      (22U)
#define DMA_ISR_HTIF6_MSK      (0x1UL << DMA_ISR_HTIF6_POS)                    /*!< 0x00400000 */
#define DMA_ISR_HTIF6          DMA_ISR_HTIF6_MSK                               /*!< CHANNEL 6 Half Transfer flag */
#define DMA_ISR_TEIF6_POS      (23U)
#define DMA_ISR_TEIF6_MSK      (0x1UL << DMA_ISR_TEIF6_POS)                    /*!< 0x00800000 */
#define DMA_ISR_TEIF6          DMA_ISR_TEIF6_MSK                               /*!< CHANNEL 6 Transfer Error flag */
#define DMA_ISR_GIF7_POS       (24U)
#define DMA_ISR_GIF7_MSK       (0x1UL << DMA_ISR_GIF7_POS)                     /*!< 0x01000000 */
#define DMA_ISR_GIF7           DMA_ISR_GIF7_MSK                                /*!< CHANNEL 7 Global interrupt flag */
#define DMA_ISR_TCIF7_POS      (25U)
#define DMA_ISR_TCIF7_MSK      (0x1UL << DMA_ISR_TCIF7_POS)                    /*!< 0x02000000 */
#define DMA_ISR_TCIF7          DMA_ISR_TCIF7_MSK                               /*!< CHANNEL 7 Transfer Complete flag */
#define DMA_ISR_HTIF7_POS      (26U)
#define DMA_ISR_HTIF7_MSK      (0x1UL << DMA_ISR_HTIF7_POS)                    /*!< 0x04000000 */
#define DMA_ISR_HTIF7          DMA_ISR_HTIF7_MSK                               /*!< CHANNEL 7 Half Transfer flag */
#define DMA_ISR_TEIF7_POS      (27U)
#define DMA_ISR_TEIF7_MSK      (0x1UL << DMA_ISR_TEIF7_POS)                    /*!< 0x08000000 */
#define DMA_ISR_TEIF7          DMA_ISR_TEIF7_MSK                               /*!< CHANNEL 7 Transfer Error flag */

