ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for DMA_IFCR register  *******************/
#define DMA_IFCR_CGIF1_POS     (0U)
#define DMA_IFCR_CGIF1_MSK     (0x1UL << DMA_IFCR_CGIF1_POS)                   /*!< 0x00000001 */
#define DMA_IFCR_CGIF1         DMA_IFCR_CGIF1_MSK                              /*!< CHANNEL 1 Global interrupt clearr */
#define DMA_IFCR_CTCIF1_POS    (1U)
#define DMA_IFCR_CTCIF1_MSK    (0x1UL << DMA_IFCR_CTCIF1_POS)                  /*!< 0x00000002 */
#define DMA_IFCR_CTCIF1        DMA_IFCR_CTCIF1_MSK                             /*!< CHANNEL 1 Transfer Complete clear */
#define DMA_IFCR_CHTIF1_POS    (2U)
#define DMA_IFCR_CHTIF1_MSK    (0x1UL << DMA_IFCR_CHTIF1_POS)                  /*!< 0x00000004 */
#define DMA_IFCR_CHTIF1        DMA_IFCR_CHTIF1_MSK                             /*!< CHANNEL 1 Half Transfer clear */
#define DMA_IFCR_CTEIF1_POS    (3U)
#define DMA_IFCR_CTEIF1_MSK    (0x1UL << DMA_IFCR_CTEIF1_POS)                  /*!< 0x00000008 */
#define DMA_IFCR_CTEIF1        DMA_IFCR_CTEIF1_MSK                             /*!< CHANNEL 1 Transfer Error clear */
#define DMA_IFCR_CGIF2_POS     (4U)
#define DMA_IFCR_CGIF2_MSK     (0x1UL << DMA_IFCR_CGIF2_POS)                   /*!< 0x00000010 */
#define DMA_IFCR_CGIF2         DMA_IFCR_CGIF2_MSK                              /*!< CHANNEL 2 Global interrupt clear */
#define DMA_IFCR_CTCIF2_POS    (5U)
#define DMA_IFCR_CTCIF2_MSK    (0x1UL << DMA_IFCR_CTCIF2_POS)                  /*!< 0x00000020 */
#define DMA_IFCR_CTCIF2        DMA_IFCR_CTCIF2_MSK                             /*!< CHANNEL 2 Transfer Complete clear */
#define DMA_IFCR_CHTIF2_POS    (6U)
#define DMA_IFCR_CHTIF2_MSK    (0x1UL << DMA_IFCR_CHTIF2_POS)                  /*!< 0x00000040 */
#define DMA_IFCR_CHTIF2        DMA_IFCR_CHTIF2_MSK                             /*!< CHANNEL 2 Half Transfer clear */
#define DMA_IFCR_CTEIF2_POS    (7U)
#define DMA_IFCR_CTEIF2_MSK    (0x1UL << DMA_IFCR_CTEIF2_POS)                  /*!< 0x00000080 */
#define DMA_IFCR_CTEIF2        DMA_IFCR_CTEIF2_MSK                             /*!< CHANNEL 2 Transfer Error clear */
#define DMA_IFCR_CGIF3_POS     (8U)
#define DMA_IFCR_CGIF3_MSK     (0x1UL << DMA_IFCR_CGIF3_POS)                   /*!< 0x00000100 */
#define DMA_IFCR_CGIF3         DMA_IFCR_CGIF3_MSK                              /*!< CHANNEL 3 Global interrupt clear */
#define DMA_IFCR_CTCIF3_POS    (9U)
#define DMA_IFCR_CTCIF3_MSK    (0x1UL << DMA_IFCR_CTCIF3_POS)                  /*!< 0x00000200 */
#define DMA_IFCR_CTCIF3        DMA_IFCR_CTCIF3_MSK                             /*!< CHANNEL 3 Transfer Complete clear */
#define DMA_IFCR_CHTIF3_POS    (10U)
#define DMA_IFCR_CHTIF3_MSK    (0x1UL << DMA_IFCR_CHTIF3_POS)                  /*!< 0x00000400 */
#define DMA_IFCR_CHTIF3        DMA_IFCR_CHTIF3_MSK                             /*!< CHANNEL 3 Half Transfer clear */
#define DMA_IFCR_CTEIF3_POS    (11U)
#define DMA_IFCR_CTEIF3_MSK    (0x1UL << DMA_IFCR_CTEIF3_POS)                  /*!< 0x00000800 */
#define DMA_IFCR_CTEIF3        DMA_IFCR_CTEIF3_MSK                             /*!< CHANNEL 3 Transfer Error clear */
#define DMA_IFCR_CGIF4_POS     (12U)
#define DMA_IFCR_CGIF4_MSK     (0x1UL << DMA_IFCR_CGIF4_POS)                   /*!< 0x00001000 */
#define DMA_IFCR_CGIF4         DMA_IFCR_CGIF4_MSK                              /*!< CHANNEL 4 Global interrupt clear */
#define DMA_IFCR_CTCIF4_POS    (13U)
#define DMA_IFCR_CTCIF4_MSK    (0x1UL << DMA_IFCR_CTCIF4_POS)                  /*!< 0x00002000 */
#define DMA_IFCR_CTCIF4        DMA_IFCR_CTCIF4_MSK                             /*!< CHANNEL 4 Transfer Complete clear */
#define DMA_IFCR_CHTIF4_POS    (14U)
#define DMA_IFCR_CHTIF4_MSK    (0x1UL << DMA_IFCR_CHTIF4_POS)                  /*!< 0x00004000 */
#define DMA_IFCR_CHTIF4        DMA_IFCR_CHTIF4_MSK                             /*!< CHANNEL 4 Half Transfer clear */
#define DMA_IFCR_CTEIF4_POS    (15U)
#define DMA_IFCR_CTEIF4_MSK    (0x1UL << DMA_IFCR_CTEIF4_POS)                  /*!< 0x00008000 */
#define DMA_IFCR_CTEIF4        DMA_IFCR_CTEIF4_MSK                             /*!< CHANNEL 4 Transfer Error clear */
#define DMA_IFCR_CGIF5_POS     (16U)
#define DMA_IFCR_CGIF5_MSK     (0x1UL << DMA_IFCR_CGIF5_POS)                   /*!< 0x00010000 */
#define DMA_IFCR_CGIF5         DMA_IFCR_CGIF5_MSK                              /*!< CHANNEL 5 Global interrupt clear */
#define DMA_IFCR_CTCIF5_POS    (17U)
#define DMA_IFCR_CTCIF5_MSK    (0x1UL << DMA_IFCR_CTCIF5_POS)                  /*!< 0x00020000 */
#define DMA_IFCR_CTCIF5        DMA_IFCR_CTCIF5_MSK                             /*!< CHANNEL 5 Transfer Complete clear */
#define DMA_IFCR_CHTIF5_POS    (18U)
#define DMA_IFCR_CHTIF5_MSK    (0x1UL << DMA_IFCR_CHTIF5_POS)                  /*!< 0x00040000 */
#define DMA_IFCR_CHTIF5        DMA_IFCR_CHTIF5_MSK                             /*!< CHANNEL 5 Half Transfer clear */
#define DMA_IFCR_CTEIF5_POS    (19U)
#define DMA_IFCR_CTEIF5_MSK    (0x1UL << DMA_IFCR_CTEIF5_POS)                  /*!< 0x00080000 */
#define DMA_IFCR_CTEIF5        DMA_IFCR_CTEIF5_MSK                             /*!< CHANNEL 5 Transfer Error clear */
#define DMA_IFCR_CGIF6_POS     (20U)
#define DMA_IFCR_CGIF6_MSK     (0x1UL << DMA_IFCR_CGIF6_POS)                   /*!< 0x00100000 */
#define DMA_IFCR_CGIF6         DMA_IFCR_CGIF6_MSK                              /*!< CHANNEL 6 Global interrupt clear */
#define DMA_IFCR_CTCIF6_POS    (21U)
#define DMA_IFCR_CTCIF6_MSK    (0x1UL << DMA_IFCR_CTCIF6_POS)                  /*!< 0x00200000 */
#define DMA_IFCR_CTCIF6        DMA_IFCR_CTCIF6_MSK                             /*!< CHANNEL 6 Transfer Complete clear */
#define DMA_IFCR_CHTIF6_POS    (22U)
#define DMA_IFCR_CHTIF6_MSK    (0x1UL << DMA_IFCR_CHTIF6_POS)                  /*!< 0x00400000 */
#define DMA_IFCR_CHTIF6        DMA_IFCR_CHTIF6_MSK                             /*!< CHANNEL 6 Half Transfer clear */
#define DMA_IFCR_CTEIF6_POS    (23U)
#define DMA_IFCR_CTEIF6_MSK    (0x1UL << DMA_IFCR_CTEIF6_POS)                  /*!< 0x00800000 */
#define DMA_IFCR_CTEIF6        DMA_IFCR_CTEIF6_MSK                             /*!< CHANNEL 6 Transfer Error clear */
#define DMA_IFCR_CGIF7_POS     (24U)
#define DMA_IFCR_CGIF7_MSK     (0x1UL << DMA_IFCR_CGIF7_POS)                   /*!< 0x01000000 */
#define DMA_IFCR_CGIF7         DMA_IFCR_CGIF7_MSK                              /*!< CHANNEL 7 Global interrupt clear */
#define DMA_IFCR_CTCIF7_POS    (25U)
#define DMA_IFCR_CTCIF7_MSK    (0x1UL << DMA_IFCR_CTCIF7_POS)                  /*!< 0x02000000 */
#define DMA_IFCR_CTCIF7        DMA_IFCR_CTCIF7_MSK                             /*!< CHANNEL 7 Transfer Complete clear */
#define DMA_IFCR_CHTIF7_POS    (26U)
#define DMA_IFCR_CHTIF7_MSK    (0x1UL << DMA_IFCR_CHTIF7_POS)                  /*!< 0x04000000 */
#define DMA_IFCR_CHTIF7        DMA_IFCR_CHTIF7_MSK                             /*!< CHANNEL 7 Half Transfer clear */
#define DMA_IFCR_CTEIF7_POS    (27U)
#define DMA_IFCR_CTEIF7_MSK    (0x1UL << DMA_IFCR_CTEIF7_POS)                  /*!< 0x08000000 */
#define DMA_IFCR_CTEIF7        DMA_IFCR_CTEIF7_MSK                             /*!< CHANNEL 7 Transfer Error clear */

/*******************  Bit definition for DMA_CCR register  ********************/
#define DMA_CCR_EN_POS         (0U)
#define DMA_CCR_EN_MSK         (0x1UL << DMA_CCR_EN_POS)                       /*!< 0x00000001 */
#define DMA_CCR_EN             DMA_CCR_EN_MSK                                  /*!< CHANNEL enable                      */
#define DMA_CCR_TCIE_POS       (1U)
#define DMA_CCR_TCIE_MSK       (0x1UL << DMA_CCR_TCIE_POS)                     /*!< 0x00000002 */
#define DMA_CCR_TCIE           DMA_CCR_TCIE_MSK                                /*!< Transfer complete interrupt enable  */
#define DMA_CCR_HTIE_POS       (2U)
#define DMA_CCR_HTIE_MSK       (0x1UL << DMA_CCR_HTIE_POS)                     /*!< 0x00000004 */
#define DMA_CCR_HTIE           DMA_CCR_HTIE_MSK                                /*!< Half Transfer interrupt enable      */
#define DMA_CCR_TEIE_POS       (3U)
#define DMA_CCR_TEIE_MSK       (0x1UL << DMA_CCR_TEIE_POS)                     /*!< 0x00000008 */
#define DMA_CCR_TEIE           DMA_CCR_TEIE_MSK                                /*!< Transfer error interrupt enable     */
#define DMA_CCR_DIR_POS        (4U)
#define DMA_CCR_DIR_MSK        (0x1UL << DMA_CCR_DIR_POS)                      /*!< 0x00000010 */
#define DMA_CCR_DIR            DMA_CCR_DIR_MSK                                 /*!< Data transfer direction             */
#define DMA_CCR_CIRC_POS       (5U)
#define DMA_CCR_CIRC_MSK       (0x1UL << DMA_CCR_CIRC_POS)                     /*!< 0x00000020 */
#define DMA_CCR_CIRC           DMA_CCR_CIRC_MSK                                /*!< Circular mode                       */
#define DMA_CCR_PINC_POS       (6U)
#define DMA_CCR_PINC_MSK       (0x1UL << DMA_CCR_PINC_POS)                     /*!< 0x00000040 */
#define DMA_CCR_PINC           DMA_CCR_PINC_MSK                                /*!< Peripheral increment mode           */
#define DMA_CCR_MINC_POS       (7U)
#define DMA_CCR_MINC_MSK       (0x1UL << DMA_CCR_MINC_POS)                     /*!< 0x00000080 */
#define DMA_CCR_MINC           DMA_CCR_MINC_MSK                                /*!< Memory increment mode               */

#define DMA_CCR_PSIZE_POS      (8U)
#define DMA_CCR_PSIZE_MSK      (0x3UL << DMA_CCR_PSIZE_POS)                    /*!< 0x00000300 */
#define DMA_CCR_PSIZE          DMA_CCR_PSIZE_MSK                               /*!< PSIZE[1:0] bits (Peripheral size)   */
#define DMA_CCR_PSIZE_0        (0x1UL << DMA_CCR_PSIZE_POS)                    /*!< 0x00000100 */
#define DMA_CCR_PSIZE_1        (0x2UL << DMA_CCR_PSIZE_POS)                    /*!< 0x00000200 */

#define DMA_CCR_MSIZE_POS      (10U)
#define DMA_CCR_MSIZE_MSK      (0x3UL << DMA_CCR_MSIZE_POS)                    /*!< 0x00000C00 */
#define DMA_CCR_MSIZE          DMA_CCR_MSIZE_MSK                               /*!< MSIZE[1:0] bits (Memory size)       */
#define DMA_CCR_MSIZE_0        (0x1UL << DMA_CCR_MSIZE_POS)                    /*!< 0x00000400 */
#define DMA_CCR_MSIZE_1        (0x2UL << DMA_CCR_MSIZE_POS)                    /*!< 0x00000800 */

#define DMA_CCR_PL_POS         (12U)
#define DMA_CCR_PL_MSK         (0x3UL << DMA_CCR_PL_POS)                       /*!< 0x00003000 */
#define DMA_CCR_PL             DMA_CCR_PL_MSK                                  /*!< PL[1:0] bits(CHANNEL Priority level)*/
#define DMA_CCR_PL_0           (0x1UL << DMA_CCR_PL_POS)                       /*!< 0x00001000 */
#define DMA_CCR_PL_1           (0x2UL << DMA_CCR_PL_POS)                        /*!< 0x00002000 */

#define DMA_CCR_MEM2MEM_POS    (14U)
#define DMA_CCR_MEM2MEM_MSK    (0x1UL << DMA_CCR_MEM2MEM_POS)                  /*!< 0x00004000 */
#define DMA_CCR_MEM2MEM        DMA_CCR_MEM2MEM_MSK                             /*!< Memory to memory mode               */

/******************  Bit definition for DMA_CNDTR register  *******************/
#define DMA_CNDTR_NDT_POS      (0U)
#define DMA_CNDTR_NDT_MSK      (0xFFFFUL << DMA_CNDTR_NDT_POS)                 /*!< 0x0000FFFF */
#define DMA_CNDTR_NDT          DMA_CNDTR_NDT_MSK                               /*!< Number of data to Transfer          */

/******************  Bit definition for DMA_CPAR register  ********************/
#define DMA_CPAR_PA_POS        (0U)
#define DMA_CPAR_PA_MSK        (0xFFFFFFFFUL << DMA_CPAR_PA_POS)               /*!< 0xFFFFFFFF */
#define DMA_CPAR_PA            DMA_CPAR_PA_MSK                                 /*!< Peripheral Address                  */

/******************  Bit definition for DMA_CMAR register  ********************/
#define DMA_CMAR_MA_POS        (0U)
#define DMA_CMAR_MA_MSK        (0xFFFFFFFFUL << DMA_CMAR_MA_POS)               /*!< 0xFFFFFFFF */
#define DMA_CMAR_MA            DMA_CMAR_MA_MSK                                 /*!< Memory Address                      */

/********************  Bits definition for DMAMUX_CxCR register  **************/
#define DMAMUX_CxCR_DMAREQ_ID_POS              (0U)
#define DMAMUX_CxCR_DMAREQ_ID_MSK              (0xFFUL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x000000FF */
#define DMAMUX_CxCR_DMAREQ_ID                  DMAMUX_CxCR_DMAREQ_ID_MSK             /*!< DMA Request ID   */
#define DMAMUX_CxCR_DMAREQ_ID_0                (0x01UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000001 */
#define DMAMUX_CxCR_DMAREQ_ID_1                (0x02UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000002 */
#define DMAMUX_CxCR_DMAREQ_ID_2                (0x04UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000004 */
#define DMAMUX_CxCR_DMAREQ_ID_3                (0x08UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000008 */
#define DMAMUX_CxCR_DMAREQ_ID_4                (0x10UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000010 */
#define DMAMUX_CxCR_DMAREQ_ID_5                (0x20UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000020 */
#define DMAMUX_CxCR_DMAREQ_ID_6                (0x40UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000040 */
#define DMAMUX_CxCR_DMAREQ_ID_7                (0x80UL << DMAMUX_CxCR_DMAREQ_ID_POS) /*!< 0x00000080 */
#define DMAMUX_CxCR_SOIE_POS                   (8U)
#define DMAMUX_CxCR_SOIE_MSK                   (0x1UL << DMAMUX_CxCR_SOIE_POS)  /*!< 0x00000100 */
#define DMAMUX_CxCR_SOIE                       DMAMUX_CxCR_SOIE_MSK             /*!< Synchro overrun interrupt enable     */
#define DMAMUX_CxCR_EGE_POS                    (9U)
#define DMAMUX_CxCR_EGE_MSK                    (0x1UL << DMAMUX_CxCR_EGE_POS)   /*!< 0x00000200 */
#define DMAMUX_CxCR_EGE                        DMAMUX_CxCR_EGE_MSK              /*!< Event generation interrupt enable    */
#define DMAMUX_CxCR_SE_POS                     (16U)
#define DMAMUX_CxCR_SE_MSK                     (0x1UL << DMAMUX_CxCR_SE_POS)    /*!< 0x00010000 */
#define DMAMUX_CxCR_SE                         DMAMUX_CxCR_SE_MSK               /*!< Synchronization enable               */
#define DMAMUX_CxCR_SPOL_POS                   (17U)
#define DMAMUX_CxCR_SPOL_MSK                   (0x3UL << DMAMUX_CxCR_SPOL_POS)  /*!< 0x00060000 */
#define DMAMUX_CxCR_SPOL                       DMAMUX_CxCR_SPOL_MSK             /*!< Synchronization polarity             */
#define DMAMUX_CxCR_SPOL_0                     (0x1UL << DMAMUX_CxCR_SPOL_POS)  /*!< 0x00020000 */
#define DMAMUX_CxCR_SPOL_1                     (0x2UL << DMAMUX_CxCR_SPOL_POS)  /*!< 0x00040000 */
#define DMAMUX_CxCR_NBREQ_POS                  (19U)
#define DMAMUX_CxCR_NBREQ_MSK                  (0x1FUL << DMAMUX_CxCR_NBREQ_POS) /*!< 0x00F80000 */
#define DMAMUX_CxCR_NBREQ                      DMAMUX_CxCR_NBREQ_MSK             /*!< Number of request                    */
#define DMAMUX_CxCR_NBREQ_0                    (0x01UL << DMAMUX_CxCR_NBREQ_POS) /*!< 0x00080000 */
#define DMAMUX_CxCR_NBREQ_1                    (0x02UL << DMAMUX_CxCR_NBREQ_POS) /*!< 0x00100000 */
#define DMAMUX_CxCR_NBREQ_2                    (0x04UL << DMAMUX_CxCR_NBREQ_POS) /*!< 0x00200000 */
#define DMAMUX_CxCR_NBREQ_3                    (0x08UL << DMAMUX_CxCR_NBREQ_POS) /*!< 0x00400000 */
#define DMAMUX_CxCR_NBREQ_4                    (0x10UL << DMAMUX_CxCR_NBREQ_POS) /*!< 0x00800000 */
#define DMAMUX_CxCR_SYNC_ID_POS                (24U)
#define DMAMUX_CxCR_SYNC_ID_MSK                (0x1FUL << DMAMUX_CxCR_SYNC_ID_POS) /*!< 0x1F000000 */
#define DMAMUX_CxCR_SYNC_ID                    DMAMUX_CxCR_SYNC_ID_MSK             /*!< Synchronization ID                   */
#define DMAMUX_CxCR_SYNC_ID_0                  (0x01UL << DMAMUX_CxCR_SYNC_ID_POS) /*!< 0x01000000 */
#define DMAMUX_CxCR_SYNC_ID_1                  (0x02UL << DMAMUX_CxCR_SYNC_ID_POS) /*!< 0x02000000 */
#define DMAMUX_CxCR_SYNC_ID_2                  (0x04UL << DMAMUX_CxCR_SYNC_ID_POS) /*!< 0x04000000 */
#define DMAMUX_CxCR_SYNC_ID_3                  (0x08UL << DMAMUX_CxCR_SYNC_ID_POS) /*!< 0x08000000 */
#define DMAMUX_CxCR_SYNC_ID_4                  (0x10UL << DMAMUX_CxCR_SYNC_ID_POS) /*!< 0x10000000 */

/*******************  Bits definition for DMAMUX_CSR register  **************/
#define DMAMUX_CSR_SOF0_POS                    (0U)
#define DMAMUX_CSR_SOF0_MSK                    (0x1UL << DMAMUX_CSR_SOF0_POS)  /*!< 0x00000001 */
#define DMAMUX_CSR_SOF0                        DMAMUX_CSR_SOF0_MSK             /*!< Synchronization Overrun Flag 0       */
#define DMAMUX_CSR_SOF1_POS                    (1U)
#define DMAMUX_CSR_SOF1_MSK                    (0x1UL << DMAMUX_CSR_SOF1_POS)  /*!< 0x00000002 */
#define DMAMUX_CSR_SOF1                        DMAMUX_CSR_SOF1_MSK             /*!< Synchronization Overrun Flag 1       */
#define DMAMUX_CSR_SOF2_POS                    (2U)
#define DMAMUX_CSR_SOF2_MSK                    (0x1UL << DMAMUX_CSR_SOF2_POS)  /*!< 0x00000004 */
#define DMAMUX_CSR_SOF2                        DMAMUX_CSR_SOF2_MSK             /*!< Synchronization Overrun Flag 2       */
#define DMAMUX_CSR_SOF3_POS                    (3U)
#define DMAMUX_CSR_SOF3_MSK                    (0x1UL << DMAMUX_CSR_SOF3_POS)  /*!< 0x00000008 */
#define DMAMUX_CSR_SOF3                        DMAMUX_CSR_SOF3_MSK             /*!< Synchronization Overrun Flag 3       */
#define DMAMUX_CSR_SOF4_POS                    (4U)
#define DMAMUX_CSR_SOF4_MSK                    (0x1UL << DMAMUX_CSR_SOF4_POS)  /*!< 0x00000010 */
#define DMAMUX_CSR_SOF4                        DMAMUX_CSR_SOF4_MSK             /*!< Synchronization Overrun Flag 4       */
#define DMAMUX_CSR_SOF5_POS                    (5U)
#define DMAMUX_CSR_SOF5_MSK                    (0x1UL << DMAMUX_CSR_SOF5_POS)  /*!< 0x00000020 */
#define DMAMUX_CSR_SOF5                        DMAMUX_CSR_SOF5_MSK             /*!< Synchronization Overrun Flag 5       */
#define DMAMUX_CSR_SOF6_POS                    (6U)
#define DMAMUX_CSR_SOF6_MSK                    (0x1UL << DMAMUX_CSR_SOF6_POS)  /*!< 0x00000040 */
#define DMAMUX_CSR_SOF6                        DMAMUX_CSR_SOF6_MSK             /*!< Synchronization Overrun Flag 6       */

