ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for DMAMUX_CFR register  **************/
#define DMAMUX_CFR_CSOF0_POS                   (0U)
#define DMAMUX_CFR_CSOF0_MSK                   (0x1UL << DMAMUX_CFR_CSOF0_POS)  /*!< 0x00000001 */
#define DMAMUX_CFR_CSOF0                       DMAMUX_CFR_CSOF0_MSK             /*!< Clear Overrun Flag 0                 */
#define DMAMUX_CFR_CSOF1_POS                   (1U)
#define DMAMUX_CFR_CSOF1_MSK                   (0x1UL << DMAMUX_CFR_CSOF1_POS)  /*!< 0x00000002 */
#define DMAMUX_CFR_CSOF1                       DMAMUX_CFR_CSOF1_MSK             /*!< Clear Overrun Flag 1                 */
#define DMAMUX_CFR_CSOF2_POS                   (2U)
#define DMAMUX_CFR_CSOF2_MSK                   (0x1UL << DMAMUX_CFR_CSOF2_POS)  /*!< 0x00000004 */
#define DMAMUX_CFR_CSOF2                       DMAMUX_CFR_CSOF2_MSK             /*!< Clear Overrun Flag 2                 */
#define DMAMUX_CFR_CSOF3_POS                   (3U)
#define DMAMUX_CFR_CSOF3_MSK                   (0x1UL << DMAMUX_CFR_CSOF3_POS)  /*!< 0x00000008 */
#define DMAMUX_CFR_CSOF3                       DMAMUX_CFR_CSOF3_MSK             /*!< Clear Overrun Flag 3                 */
#define DMAMUX_CFR_CSOF4_POS                   (4U)
#define DMAMUX_CFR_CSOF4_MSK                   (0x1UL << DMAMUX_CFR_CSOF4_POS)  /*!< 0x00000010 */
#define DMAMUX_CFR_CSOF4                       DMAMUX_CFR_CSOF4_MSK             /*!< Clear Overrun Flag 4                 */
#define DMAMUX_CFR_CSOF5_POS                   (5U)
#define DMAMUX_CFR_CSOF5_MSK                   (0x1UL << DMAMUX_CFR_CSOF5_POS)  /*!< 0x00000020 */
#define DMAMUX_CFR_CSOF5                       DMAMUX_CFR_CSOF5_MSK             /*!< Clear Overrun Flag 5                 */
#define DMAMUX_CFR_CSOF6_POS                   (6U)
#define DMAMUX_CFR_CSOF6_MSK                   (0x1UL << DMAMUX_CFR_CSOF6_POS)  /*!< 0x00000040 */
#define DMAMUX_CFR_CSOF6                       DMAMUX_CFR_CSOF6_MSK             /*!< Clear Overrun Flag 6                 */

/********************  Bits definition for DMAMUX_RGxCR register  ************/
#define DMAMUX_RGxCR_SIG_ID_POS                (0U)
#define DMAMUX_RGxCR_SIG_ID_MSK                (0x1FUL << DMAMUX_RGxCR_SIG_ID_POS) /*!< 0x0000001F */
#define DMAMUX_RGxCR_SIG_ID                    DMAMUX_RGxCR_SIG_ID_MSK             /*!< Signal ID                         */
#define DMAMUX_RGxCR_SIG_ID_0                  (0x01UL << DMAMUX_RGxCR_SIG_ID_POS) /*!< 0x00000001 */
#define DMAMUX_RGxCR_SIG_ID_1                  (0x02UL << DMAMUX_RGxCR_SIG_ID_POS) /*!< 0x00000002 */
#define DMAMUX_RGxCR_SIG_ID_2                  (0x04UL << DMAMUX_RGxCR_SIG_ID_POS) /*!< 0x00000004 */
#define DMAMUX_RGxCR_SIG_ID_3                  (0x08UL << DMAMUX_RGxCR_SIG_ID_POS) /*!< 0x00000008 */
#define DMAMUX_RGxCR_SIG_ID_4                  (0x10UL << DMAMUX_RGxCR_SIG_ID_POS) /*!< 0x00000010 */
#define DMAMUX_RGxCR_OIE_POS                   (8U)
#define DMAMUX_RGxCR_OIE_MSK                   (0x1UL << DMAMUX_RGxCR_OIE_POS)  /*!< 0x00000100 */
#define DMAMUX_RGxCR_OIE                       DMAMUX_RGxCR_OIE_MSK             /*!< Overrun interrupt enable             */
#define DMAMUX_RGxCR_GE_POS                    (16U)
#define DMAMUX_RGxCR_GE_MSK                    (0x1UL << DMAMUX_RGxCR_GE_POS)   /*!< 0x00010000 */
#define DMAMUX_RGxCR_GE                        DMAMUX_RGxCR_GE_MSK              /*!< Generation enable                    */
#define DMAMUX_RGxCR_GPOL_POS                  (17U)
#define DMAMUX_RGxCR_GPOL_MSK                  (0x3UL << DMAMUX_RGxCR_GPOL_POS) /*!< 0x00060000 */
#define DMAMUX_RGxCR_GPOL                      DMAMUX_RGxCR_GPOL_MSK            /*!< Generation polarity                  */
#define DMAMUX_RGxCR_GPOL_0                    (0x1UL << DMAMUX_RGxCR_GPOL_POS) /*!< 0x00020000 */
#define DMAMUX_RGxCR_GPOL_1                    (0x2UL << DMAMUX_RGxCR_GPOL_POS) /*!< 0x00040000 */
#define DMAMUX_RGxCR_GNBREQ_POS                (19U)
#define DMAMUX_RGxCR_GNBREQ_MSK                (0x1FUL << DMAMUX_RGxCR_GNBREQ_POS) /*!< 0x00F80000 */
#define DMAMUX_RGxCR_GNBREQ                    DMAMUX_RGxCR_GNBREQ_MSK             /*!< Number of request                 */
#define DMAMUX_RGxCR_GNBREQ_0                  (0x01UL << DMAMUX_RGxCR_GNBREQ_POS) /*!< 0x00080000 */
#define DMAMUX_RGxCR_GNBREQ_1                  (0x02UL << DMAMUX_RGxCR_GNBREQ_POS) /*!< 0x00100000 */
#define DMAMUX_RGxCR_GNBREQ_2                  (0x04UL << DMAMUX_RGxCR_GNBREQ_POS) /*!< 0x00200000 */
#define DMAMUX_RGxCR_GNBREQ_3                  (0x08UL << DMAMUX_RGxCR_GNBREQ_POS) /*!< 0x00400000 */
#define DMAMUX_RGxCR_GNBREQ_4                  (0x10UL << DMAMUX_RGxCR_GNBREQ_POS) /*!< 0x00800000 */

/********************  Bits definition for DMAMUX_RGSR register  **************/
#define DMAMUX_RGSR_OF0_POS                    (0U)
#define DMAMUX_RGSR_OF0_MSK                    (0x1UL << DMAMUX_RGSR_OF0_POS)   /*!< 0x00000001 */
#define DMAMUX_RGSR_OF0                        DMAMUX_RGSR_OF0_MSK              /*!< Overrun flag 0                       */
#define DMAMUX_RGSR_OF1_POS                    (1U)
#define DMAMUX_RGSR_OF1_MSK                    (0x1UL << DMAMUX_RGSR_OF1_POS)   /*!< 0x00000002 */
#define DMAMUX_RGSR_OF1                        DMAMUX_RGSR_OF1_MSK              /*!< Overrun flag 1                       */
#define DMAMUX_RGSR_OF2_POS                    (2U)
#define DMAMUX_RGSR_OF2_MSK                    (0x1UL << DMAMUX_RGSR_OF2_POS)   /*!< 0x00000004 */
#define DMAMUX_RGSR_OF2                        DMAMUX_RGSR_OF2_MSK              /*!< Overrun flag 2                       */
#define DMAMUX_RGSR_OF3_POS                    (3U)
#define DMAMUX_RGSR_OF3_MSK                    (0x1UL << DMAMUX_RGSR_OF3_POS)   /*!< 0x00000008 */
#define DMAMUX_RGSR_OF3                        DMAMUX_RGSR_OF3_MSK              /*!< Overrun flag 3                       */

/********************  Bits definition for DMAMUX_RGCFR register  **************/
#define DMAMUX_RGCFR_COF0_POS                  (0U)
#define DMAMUX_RGCFR_COF0_MSK                  (0x1UL << DMAMUX_RGCFR_COF0_POS) /*!< 0x00000001 */
#define DMAMUX_RGCFR_COF0                      DMAMUX_RGCFR_COF0_MSK            /*!< Clear Overrun flag 0                 */
#define DMAMUX_RGCFR_COF1_POS                  (1U)
#define DMAMUX_RGCFR_COF1_MSK                  (0x1UL << DMAMUX_RGCFR_COF1_POS) /*!< 0x00000002 */
#define DMAMUX_RGCFR_COF1                      DMAMUX_RGCFR_COF1_MSK            /*!< Clear Overrun flag 1                 */
#define DMAMUX_RGCFR_COF2_POS                  (2U)
#define DMAMUX_RGCFR_COF2_MSK                  (0x1UL << DMAMUX_RGCFR_COF2_POS) /*!< 0x00000004 */
#define DMAMUX_RGCFR_COF2                      DMAMUX_RGCFR_COF2_MSK            /*!< Clear Overrun flag 2                 */
#define DMAMUX_RGCFR_COF3_POS                  (3U)
#define DMAMUX_RGCFR_COF3_MSK                  (0x1UL << DMAMUX_RGCFR_COF3_POS) /*!< 0x00000008 */
#define DMAMUX_RGCFR_COF3                      DMAMUX_RGCFR_COF3_MSK            /*!< Clear Overrun flag 3                 */


/** @defgroup DMAMUX_LL_EC_REQUEST Transfer request
  * @{
  */
typedef enum
{
    DMAMUX_REQ_MEM2MEM           =  0x00000000U,   /*!< memory to memory transfer  */
    DMAMUX_REQ_GENERATOR0        =  0x00000001U,   /*!< DMAMUX request generator 0 */
    DMAMUX_REQ_GENERATOR1        =  0x00000002U,   /*!< DMAMUX request generator 1 */
    DMAMUX_REQ_GENERATOR2        =  0x00000003U,   /*!< DMAMUX request generator 2 */
    DMAMUX_REQ_GENERATOR3        =  0x00000004U,   /*!< DMAMUX request generator 3 */
    DMAMUX_REQ_ADC1              =  0x00000005U,   /*!< DMAMUX ADC1 request        */
    DMAMUX_REQ_AES_IN            =  0x00000006U,   /*!< DMAMUX AES_IN request      */
    DMAMUX_REQ_AES_OUT           =  0x00000007U,   /*!< DMAMUX AES_OUT request     */
    DMAMUX_REQ_DAC1_CH1          =  0x00000008U,   /*!< DMAMUX DAC_CH1 request     */
    DMAMUX_REQ_DAC1_CH2          =  0x00000009U,   /*!< DMAMUX DAC_CH2 request     */
    DMAMUX_REQ_I2C1_RX           =  0x0000000AU,   /*!< DMAMUX I2C1 RX request     */
    DMAMUX_REQ_I2C1_TX           =  0x0000000BU,   /*!< DMAMUX I2C1 TX request     */
    DMAMUX_REQ_I2C2_RX           =  0x0000000CU,   /*!< DMAMUX I2C2 RX request     */
    DMAMUX_REQ_I2C2_TX           =  0x0000000DU,   /*!< DMAMUX I2C2 TX request     */
    DMAMUX_REQ_LPUART1_RX        =  0x0000000EU,   /*!< DMAMUX LPUART1 RX request  */
    DMAMUX_REQ_LPUART1_TX        =  0x0000000FU,   /*!< DMAMUX LPUART1 TX request  */
    DMAMUX_REQ_SPI1_RX           =  0x00000010U,   /*!< DMAMUX SPI1 RX request     */
    DMAMUX_REQ_SPI1_TX           =  0x00000011U,   /*!< DMAMUX SPI1 TX request     */
    DMAMUX_REQ_SPI2_RX           =  0x00000012U,   /*!< DMAMUX SPI2 RX request     */
    DMAMUX_REQ_SPI2_TX           =  0x00000013U,   /*!< DMAMUX SPI2 TX request     */
    DMAMUX_REQ_TIM1_CH1          =  0x00000014U,   /*!< DMAMUX TIM1 CH1 request    */
    DMAMUX_REQ_TIM1_CH2          =  0x00000015U,   /*!< DMAMUX TIM1 CH2 request    */
    DMAMUX_REQ_TIM1_CH3          =  0x00000016U,   /*!< DMAMUX TIM1 CH3 request    */
    DMAMUX_REQ_TIM1_CH4          =  0x00000017U,   /*!< DMAMUX TIM1 CH4 request    */
    DMAMUX_REQ_TIM1_TRIG_COM     =  0x00000018U,   /*!< DMAMUX TIM1 TRIG COM request */
    DMAMUX_REQ_TIM1_UP           =  0x00000019U,   /*!< DMAMUX TIM1 UP request     */
    DMAMUX_REQ_TIM2_CH1          =  0x0000001AU,   /*!< DMAMUX TIM2 CH1 request    */
    DMAMUX_REQ_TIM2_CH2          =  0x0000001BU,   /*!< DMAMUX TIM2 CH2 request    */
    DMAMUX_REQ_TIM2_CH3          =  0x0000001CU,   /*!< DMAMUX TIM2 CH3 request    */
    DMAMUX_REQ_TIM2_CH4          =  0x0000001DU,   /*!< DMAMUX TIM2 CH4 request    */
    DMAMUX_REQ_TIM2_TRIG         =  0x0000001EU,   /*!< DMAMUX TIM2 TRIG request   */
    DMAMUX_REQ_TIM2_UP           =  0x0000001FU,   /*!< DMAMUX TIM2 UP request     */
    DMAMUX_REQ_TIM3_CH1          =  0x00000020U,   /*!< DMAMUX TIM3 CH1 request    */
    DMAMUX_REQ_TIM3_CH2          =  0x00000021U,   /*!< DMAMUX TIM3 CH2 request    */
    DMAMUX_REQ_TIM3_CH3          =  0x00000022U,   /*!< DMAMUX TIM3 CH3 request    */
    DMAMUX_REQ_TIM3_CH4          =  0x00000023U,   /*!< DMAMUX TIM3 CH4 request    */
    DMAMUX_REQ_TIM3_TRIG         =  0x00000024U,   /*!< DMAMUX TIM3 TRIG request   */
    DMAMUX_REQ_TIM3_UP           =  0x00000025U,   /*!< DMAMUX TIM3 UP request     */
    DMAMUX_REQ_TIM6_UP           =  0x00000026U,   /*!< DMAMUX TIM6 UP request     */
    DMAMUX_REQ_TIM7_UP           =  0x00000027U,   /*!< DMAMUX TIM7 UP request     */
    DMAMUX_REQ_TIM15_CH1         =  0x00000028U,   /*!< DMAMUX TIM15 CH1 request   */
    DMAMUX_REQ_TIM15_CH2         =  0x00000029U,   /*!< DMAMUX TIM15 CH2 request   */
    DMAMUX_REQ_TIM15_TRIG_COM    =  0x0000002AU,   /*!< DMAMUX TIM15 TRIG COM request */
    DMAMUX_REQ_TIM15_UP          =  0x0000002BU,   /*!< DMAMUX TIM15 UP request    */
    DMAMUX_REQ_TIM16_CH1         =  0x0000002CU,   /*!< DMAMUX TIM16 CH1 request   */
    DMAMUX_REQ_TIM16_COM         =  0x0000002DU,   /*!< DMAMUX TIM16 COM request   */
    DMAMUX_REQ_TIM16_UP          =  0x0000002EU,   /*!< DMAMUX TIM16 UP request    */
    DMAMUX_REQ_TIM17_CH1         =  0x0000002FU,   /*!< DMAMUX TIM17 CH1 request   */
    DMAMUX_REQ_TIM17_COM         =  0x00000030U,   /*!< DMAMUX TIM17 COM request   */
    DMAMUX_REQ_TIM17_UP          =  0x00000031U,   /*!< DMAMUX TIM17 UP request    */
    DMAMUX_REQ_USART1_RX         =  0x00000032U,   /*!< DMAMUX USART1 RX request  */
    DMAMUX_REQ_USART1_TX         =  0x00000033U,   /*!< DMAMUX USART1 TX request  */
    DMAMUX_REQ_USART2_RX         =  0x00000034U,   /*!< DMAMUX USART2 RX request  */
    DMAMUX_REQ_USART2_TX         =  0x00000035U,   /*!< DMAMUX USART2 TX request  */
    DMAMUX_REQ_USART3_RX         =  0x00000036U,   /*!< DMAMUX USART3 RX request  */
    DMAMUX_REQ_USART3_TX         =  0x00000037U,   /*!< DMAMUX USART3 TX request  */
    DMAMUX_REQ_USART4_RX         =  0x00000038U,   /*!< DMAMUX USART4 RX request  */
    DMAMUX_REQ_USART4_TX         =  0x00000039U,   /*!< DMAMUX USART4 TX request  */
    DMAMUX_REQ_UCPD1_RX          =  0x0000003AU,   /*!< DMAMUX UCPD1 RX request  */
    DMAMUX_REQ_UCPD1_TX          =  0x0000003BU,   /*!< DMAMUX UCPD1 TX request  */
    DMAMUX_REQ_UCPD2_RX          =  0x0000003CU,   /*!< DMAMUX UCPD2 RX request  */
    DMAMUX_REQ_UCPD2_TX          =  0x0000003DU,   /*!< DMAMUX UCPD2 TX request  */
    DMAMUX_REQ_I2C3_RX           =  0x0000003EU,   /*!< DMAMUX I2C3 RX request  */
    DMAMUX_REQ_I2C3_TX           =  0x0000003FU,   /*!< DMAMUX I2C3 TX request  */
    DMAMUX_REQ_LPUART2_RX        =  0x00000040U,   /*!< DMAMUX LPUART2 RX request  */
    DMAMUX_REQ_LPUART2_TX        =  0x00000041U,   /*!< DMAMUX LPUART2 TX request  */
    DMAMUX_REQ_SPI3_RX           =  0x00000042U,   /*!< DMAMUX SPI3 RX request     */
    DMAMUX_REQ_SPI3_TX           =  0x00000043U,   /*!< DMAMUX SPI3 TX request     */
    DMAMUX_REQ_TIM4_CH1          =  0x00000044U,   /*!< DMAMUX TIM4 CH1 request    */
    DMAMUX_REQ_TIM4_CH2          =  0x00000045U,   /*!< DMAMUX TIM4 CH2 request    */
    DMAMUX_REQ_TIM4_CH3          =  0x00000046U,   /*!< DMAMUX TIM4 CH3 request    */
    DMAMUX_REQ_TIM4_CH4          =  0x00000047U,   /*!< DMAMUX TIM4 CH4 request    */
    DMAMUX_REQ_TIM4_TRIG         =  0x00000048U,   /*!< DMAMUX TIM4 TRIG request   */
    DMAMUX_REQ_TIM4_UP           =  0x00000049U,   /*!< DMAMUX TIM4 UP request     */
    DMAMUX_REQ_USART5_RX         =  0x0000004AU,   /*!< DMAMUX USART5 RX request  */
    DMAMUX_REQ_USART5_TX         =  0x0000004BU,   /*!< DMAMUX USART5 TX request  */
    DMAMUX_REQ_USART6_RX         =  0x0000004CU,   /*!< DMAMUX USART6 RX request  */
    DMAMUX_REQ_USART6_TX         =  0x0000004DU,   /*!< DMAMUX USART6 TX request  */
    DMAMUX_MAX_REQ               =  DMAMUX_REQ_USART6_TX
}DMA_MUX_REQ_ID_TYPE;




/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_CHANNEL DMAMUX Channel
  * @{
  */
#define LL_DMAMUX_CHANNEL_0               0x00000000U               /*!< DMAMUX Channel 0 connected to DMA1 Channel 1  */
#define LL_DMAMUX_CHANNEL_1               0x00000001U               /*!< DMAMUX Channel 1 connected to DMA1 Channel 2  */
#define LL_DMAMUX_CHANNEL_2               0x00000002U               /*!< DMAMUX Channel 2 connected to DMA1 Channel 3  */
#define LL_DMAMUX_CHANNEL_3               0x00000003U               /*!< DMAMUX Channel 3 connected to DMA1 Channel 4  */
#define LL_DMAMUX_CHANNEL_4               0x00000004U               /*!< DMAMUX Channel 4 connected to DMA1 Channel 5  */
#define LL_DMAMUX_CHANNEL_5               0x00000005U               /*!< DMAMUX Channel 5 connected to DMA1 Channel 6  */
#define LL_DMAMUX_CHANNEL_6               0x00000006U               /*!< DMAMUX Channel 6 connected to DMA1 Channel 7  */
#define LL_DMAMUX_CHANNEL_7               0x00000007U               /*!< DMAMUX Channel 7 connected to DMA2 Channel 1  */
#define LL_DMAMUX_CHANNEL_8               0x00000008U               /*!< DMAMUX Channel 8 connected to DMA2 Channel 2  */
#define LL_DMAMUX_CHANNEL_9               0x00000009U               /*!< DMAMUX Channel 9 connected to DMA2 Channel 3  */
#define LL_DMAMUX_CHANNEL_10              0x0000000AU               /*!< DMAMUX Channel 10 connected to DMA2 Channel 4 */
#define LL_DMAMUX_CHANNEL_11              0x0000000BU               /*!< DMAMUX Channel 11 connected to DMA2 Channel 5 */


