ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for EXTI_EMR2 register  ******************/
#define EXTI_EMR2_EM32_POS           (0U)
#define EXTI_EMR2_EM32_Msk           (0x1UL << EXTI_EMR2_EM32_POS)             /*!< 0x00000001 */
#define EXTI_EMR2_EM32               EXTI_EMR2_EM32_Msk                        /*!< Event Mask on line 32 */
#define EXTI_EMR2_EM33_POS           (1U)
#define EXTI_EMR2_EM33_Msk           (0x1UL << EXTI_EMR2_EM33_POS)             /*!< 0x00000002 */
#define EXTI_EMR2_EM33               EXTI_EMR2_EM33_Msk                        /*!< Event Mask on line 33 */
#define EXTI_EMR2_EM34_POS           (2U)
#define EXTI_EMR2_EM34_Msk           (0x1UL << EXTI_EMR2_EM34_POS)             /*!< 0x00000004 */
#define EXTI_EMR2_EM34               EXTI_EMR2_EM34_Msk                        /*!< Event Mask on line 34 */
#define EXTI_EMR2_EM35_POS           (3U)
#define EXTI_EMR2_EM35_Msk           (0x1UL << EXTI_EMR2_EM35_POS)             /*!< 0x00000008 */
#define EXTI_EMR2_EM35               EXTI_EMR2_EM35_Msk                        /*!< Event Mask on line 35 */
#define EXTI_EMR2_EM36_POS           (4U)
#define EXTI_EMR2_EM36_Msk           (0x1UL << EXTI_EMR2_EM36_POS)             /*!< 0x00000010 */
#define EXTI_EMR2_EM36               EXTI_EMR2_EM36_Msk                        /*!< Event Mask on line 36 */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- SCC CONTROL REGISTERS --------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief System configuration controller
  */
typedef struct
{
  volatile uint32 CFGR1;          /*!< SYSCFG configuration register 1,                   Address offset: 0x00 */
       uint32 RESERVED0[5];   /*!< Reserved,                                                   0x04 --0x14 */
  volatile uint32 CFGR2;          /*!< SYSCFG configuration register 2,                   Address offset: 0x18 */
       uint32 RESERVED1[25];  /*!< Reserved                                                           0x1C */
  volatile uint32 IT_LINE_SR[32]; /*!< SYSCFG configuration IT_LINE register,             Address offset: 0x80 */
} SYSCFG_TYPEDEF;

#define SYSCFG              (*(SYSCFG_TYPEDEF *) SYSCFG_BASE)

/*****************  Bit definition for SYSCFG_CFGR1 register  ****************/
#define SYSCFG_CFGR1_MEM_MODE_POS             (0U)
#define SYSCFG_CFGR1_MEM_MODE_MSK             (0x3UL << SYSCFG_CFGR1_MEM_MODE_POS) /*!< 0x00000003 */
#define SYSCFG_CFGR1_MEM_MODE                 SYSCFG_CFGR1_MEM_MODE_MSK            /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_CFGR1_MEM_MODE_0               (0x1UL << SYSCFG_CFGR1_MEM_MODE_POS) /*!< 0x00000001 */
#define SYSCFG_CFGR1_MEM_MODE_1               (0x2UL << SYSCFG_CFGR1_MEM_MODE_POS) /*!< 0x00000002 */
#define SYSCFG_CFGR1_PA11_RMP_POS             (3U)
#define SYSCFG_CFGR1_PA11_RMP_MSK             (0x1UL << SYSCFG_CFGR1_PA11_RMP_POS) /*!< 0x00000008 */
#define SYSCFG_CFGR1_PA11_RMP                 SYSCFG_CFGR1_PA11_RMP_MSK            /*!< PA11 Remap */
#define SYSCFG_CFGR1_PA12_RMP_POS             (4U)
#define SYSCFG_CFGR1_PA12_RMP_MSK             (0x1UL << SYSCFG_CFGR1_PA12_RMP_POS) /*!< 0x00000010 */
#define SYSCFG_CFGR1_PA12_RMP                 SYSCFG_CFGR1_PA12_RMP_MSK            /*!< PA12 Remap */
#define SYSCFG_CFGR1_IR_POL_POS               (5U)
#define SYSCFG_CFGR1_IR_POL_MSK               (0x1UL << SYSCFG_CFGR1_IR_POL_POS) /*!< 0x00000020 */
#define SYSCFG_CFGR1_IR_POL                   SYSCFG_CFGR1_IR_POL_MSK            /*!< IROut Polarity Selection */
#define SYSCFG_CFGR1_IR_MOD_POS               (6U)
#define SYSCFG_CFGR1_IR_MOD_MSK               (0x3UL << SYSCFG_CFGR1_IR_MOD_POS) /*!< 0x000000C0 */
#define SYSCFG_CFGR1_IR_MOD                   SYSCFG_CFGR1_IR_MOD_MSK            /*!< IRDA Modulation Envelope signal source selection */
#define SYSCFG_CFGR1_IR_MOD_0                 (0x1UL << SYSCFG_CFGR1_IR_MOD_POS) /*!< 0x00000040 */
#define SYSCFG_CFGR1_IR_MOD_1                 (0x2UL << SYSCFG_CFGR1_IR_MOD_POS) /*!< 0x00000080 */
#define SYSCFG_CFGR1_BOOSTEN_POS              (8U)
#define SYSCFG_CFGR1_BOOSTEN_MSK              (0x1UL << SYSCFG_CFGR1_BOOSTEN_POS) /*!< 0x00000100 */
#define SYSCFG_CFGR1_BOOSTEN                  SYSCFG_CFGR1_BOOSTEN_MSK            /*!< I/O analog switch voltage booster enable */
#define SYSCFG_CFGR1_UCPD1_STROBE_POS         (9U)
#define SYSCFG_CFGR1_UCPD1_STROBE_MSK         (0x1UL << SYSCFG_CFGR1_UCPD1_STROBE_POS) /*!< 0x00000200 */
#define SYSCFG_CFGR1_UCPD1_STROBE             SYSCFG_CFGR1_UCPD1_STROBE_MSK            /*!< Strobe signal bit for UCPD1 */
#define SYSCFG_CFGR1_UCPD2_STROBE_POS         (10U)
#define SYSCFG_CFGR1_UCPD2_STROBE_MSK         (0x1UL << SYSCFG_CFGR1_UCPD2_STROBE_POS) /*!< 0x00000400 */
#define SYSCFG_CFGR1_UCPD2_STROBE             SYSCFG_CFGR1_UCPD2_STROBE_MSK            /*!< Strobe signal bit for UCPD2 */
#define SYSCFG_CFGR1_I2C_PB6_FMP_POS          (16U)
#define SYSCFG_CFGR1_I2C_PB6_FMP_MSK          (0x1UL << SYSCFG_CFGR1_I2C_PB6_FMP_POS)  /*!< 0x00010000 */
#define SYSCFG_CFGR1_I2C_PB6_FMP              SYSCFG_CFGR1_I2C_PB6_FMP_MSK             /*!< I2C PB6 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB7_FMP_POS          (17U)
#define SYSCFG_CFGR1_I2C_PB7_FMP_MSK          (0x1UL << SYSCFG_CFGR1_I2C_PB7_FMP_POS)  /*!< 0x00020000 */
#define SYSCFG_CFGR1_I2C_PB7_FMP              SYSCFG_CFGR1_I2C_PB7_FMP_MSK             /*!< I2C PB7 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB8_FMP_POS          (18U)
#define SYSCFG_CFGR1_I2C_PB8_FMP_MSK          (0x1UL << SYSCFG_CFGR1_I2C_PB8_FMP_POS)  /*!< 0x00040000 */
#define SYSCFG_CFGR1_I2C_PB8_FMP              SYSCFG_CFGR1_I2C_PB8_FMP_MSK             /*!< I2C PB8 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB9_FMP_POS          (19U)
#define SYSCFG_CFGR1_I2C_PB9_FMP_MSK          (0x1UL << SYSCFG_CFGR1_I2C_PB9_FMP_POS)  /*!< 0x00080000 */
#define SYSCFG_CFGR1_I2C_PB9_FMP              SYSCFG_CFGR1_I2C_PB9_FMP_MSK             /*!< I2C PB9 Fast mode plus */
#define SYSCFG_CFGR1_I2C1_FMP_POS             (20U)
#define SYSCFG_CFGR1_I2C1_FMP_MSK             (0x1UL << SYSCFG_CFGR1_I2C1_FMP_POS)     /*!< 0x00100000 */
#define SYSCFG_CFGR1_I2C1_FMP                 SYSCFG_CFGR1_I2C1_FMP_MSK                /*!< Enable Fast Mode Plus on PB10, PB11, PF6 and PF7  */
#define SYSCFG_CFGR1_I2C2_FMP_POS             (21U)
#define SYSCFG_CFGR1_I2C2_FMP_MSK             (0x1UL << SYSCFG_CFGR1_I2C2_FMP_POS)     /*!< 0x00200000 */
#define SYSCFG_CFGR1_I2C2_FMP                 SYSCFG_CFGR1_I2C2_FMP_MSK                /*!< Enable I2C2 Fast mode plus  */
#define SYSCFG_CFGR1_I2C_PA9_FMP_POS          (22U)
#define SYSCFG_CFGR1_I2C_PA9_FMP_MSK          (0x1UL << SYSCFG_CFGR1_I2C_PA9_FMP_POS)  /*!< 0x00400000 */
#define SYSCFG_CFGR1_I2C_PA9_FMP              SYSCFG_CFGR1_I2C_PA9_FMP_MSK             /*!< Enable Fast Mode Plus on PA9  */
#define SYSCFG_CFGR1_I2C_PA10_FMP_POS         (23U)
#define SYSCFG_CFGR1_I2C_PA10_FMP_MSK         (0x1UL << SYSCFG_CFGR1_I2C_PA10_FMP_POS) /*!< 0x00800000 */
#define SYSCFG_CFGR1_I2C_PA10_FMP             SYSCFG_CFGR1_I2C_PA10_FMP_MSK            /*!< Enable Fast Mode Plus on PA10 */

/******************  Bit definition for SYSCFG_CFGR2 register  ****************/
#define SYSCFG_CFGR2_CLL_POS                  (0U)
#define SYSCFG_CFGR2_CLL_MSK                  (0x1UL << SYSCFG_CFGR2_CLL_POS)   /*!< 0x00000001 */
#define SYSCFG_CFGR2_CLL                      SYSCFG_CFGR2_CLL_MSK              /*!< Enables and locks the LOCKUP (Hardfault) output of CortexM0 with Break Input of TIMER1 */
#define SYSCFG_CFGR2_SPL_POS                  (1U)
#define SYSCFG_CFGR2_SPL_MSK                  (0x1UL << SYSCFG_CFGR2_SPL_POS)   /*!< 0x00000002 */
#define SYSCFG_CFGR2_SPL                      SYSCFG_CFGR2_SPL_MSK              /*!< Enables and locks the SRAM_PARITY error signal with Break Input of TIMER1 */
#define SYSCFG_CFGR2_PVDL_POS                 (2U)
#define SYSCFG_CFGR2_PVDL_MSK                 (0x1UL << SYSCFG_CFGR2_PVDL_POS)  /*!< 0x00000004 */
#define SYSCFG_CFGR2_PVDL                     SYSCFG_CFGR2_PVDL_MSK             /*!< Enables and locks the PVD connection with Timer1 Break Input and also the PVD_EN and PVDSEL[2:0] bits of the Power Control Interface */
#define SYSCFG_CFGR2_ECCL_POS                 (3U)
#define SYSCFG_CFGR2_ECCL_MSK                 (0x1UL << SYSCFG_CFGR2_ECCL_POS)  /*!< 0x00000008 */
#define SYSCFG_CFGR2_ECCL                     SYSCFG_CFGR2_ECCL_MSK             /*!< ECCL */
#define SYSCFG_CFGR2_SPF_POS                  (8U)
#define SYSCFG_CFGR2_SPF_MSK                  (0x1UL << SYSCFG_CFGR2_SPF_POS)   /*!< 0x00000100 */
#define SYSCFG_CFGR2_SPF                      SYSCFG_CFGR2_SPF_MSK              /*!< SRAM Parity error flag */
#define SYSCFG_CFGR2_SRAM_PE                  SYSCFG_CFGR2_SPF                  /*!< SRAM Parity error flag (define maintained for legacy purpose) */

