ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*****************  Bit definition for SYSCFG_ITLINEx ISR Wrapper register  ****************/
#define SYSCFG_ITLINE0_SR_EWDG_POS            (0U)
#define SYSCFG_ITLINE0_SR_EWDG_MSK            (0x1UL << SYSCFG_ITLINE0_SR_EWDG_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE0_SR_EWDG                SYSCFG_ITLINE0_SR_EWDG_MSK       /*!< EWDG interrupt */
#define SYSCFG_ITLINE1_SR_PVDOUT_POS          (0U)
#define SYSCFG_ITLINE1_SR_PVDOUT_MSK          (0x1UL << SYSCFG_ITLINE1_SR_PVDOUT_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE1_SR_PVDOUT              SYSCFG_ITLINE1_SR_PVDOUT_MSK     /*!< Power voltage detection -> exti[16] Interrupt */
#define SYSCFG_ITLINE2_SR_TAMPER_POS          (0U)
#define SYSCFG_ITLINE2_SR_TAMPER_MSK          (0x1UL << SYSCFG_ITLINE2_SR_TAMPER_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE2_SR_TAMPER              SYSCFG_ITLINE2_SR_TAMPER_MSK     /*!< TAMPER -> exti[21] interrupt */
#define SYSCFG_ITLINE2_SR_RTC_WAKEUP_POS      (1U)
#define SYSCFG_ITLINE2_SR_RTC_WAKEUP_MSK      (0x1UL << SYSCFG_ITLINE2_SR_RTC_WAKEUP_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE2_SR_RTC_WAKEUP          SYSCFG_ITLINE2_SR_RTC_WAKEUP_MSK /*!< RTC_WAKEUP -> exti[19] interrupt .... */
#define SYSCFG_ITLINE3_SR_FLASH_ECC_POS       (0U)
#define SYSCFG_ITLINE3_SR_FLASH_ECC_MSK       (0x1UL << SYSCFG_ITLINE3_SR_FLASH_ECC_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE3_SR_FLASH_ECC           SYSCFG_ITLINE3_SR_FLASH_ECC_MSK  /*!< Flash ITF ECC interrupt */
#define SYSCFG_ITLINE3_SR_FLASH_ITF_POS       (1U)
#define SYSCFG_ITLINE3_SR_FLASH_ITF_MSK       (0x1UL << SYSCFG_ITLINE3_SR_FLASH_ITF_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE3_SR_FLASH_ITF           SYSCFG_ITLINE3_SR_FLASH_ITF_MSK  /*!< FLASH ITF interrupt */
#define SYSCFG_ITLINE4_SR_CLK_CTRL_POS        (0U)
#define SYSCFG_ITLINE4_SR_CLK_CTRL_MSK        (0x1UL << SYSCFG_ITLINE4_SR_CLK_CTRL_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE4_SR_CLK_CTRL            SYSCFG_ITLINE4_SR_CLK_CTRL_MSK   /*!< RCC interrupt */
#define SYSCFG_ITLINE5_SR_EXTI0_POS           (0U)
#define SYSCFG_ITLINE5_SR_EXTI0_MSK           (0x1UL << SYSCFG_ITLINE5_SR_EXTI0_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE5_SR_EXTI0               SYSCFG_ITLINE5_SR_EXTI0_MSK      /*!< External Interrupt 0 */
#define SYSCFG_ITLINE5_SR_EXTI1_POS           (1U)
#define SYSCFG_ITLINE5_SR_EXTI1_MSK           (0x1UL << SYSCFG_ITLINE5_SR_EXTI1_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE5_SR_EXTI1               SYSCFG_ITLINE5_SR_EXTI1_MSK      /*!< External Interrupt 1 */
#define SYSCFG_ITLINE6_SR_EXTI2_POS           (0U)
#define SYSCFG_ITLINE6_SR_EXTI2_MSK           (0x1UL << SYSCFG_ITLINE6_SR_EXTI2_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE6_SR_EXTI2               SYSCFG_ITLINE6_SR_EXTI2_MSK      /*!< External Interrupt 2 */
#define SYSCFG_ITLINE6_SR_EXTI3_POS           (1U)
#define SYSCFG_ITLINE6_SR_EXTI3_MSK           (0x1UL << SYSCFG_ITLINE6_SR_EXTI3_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE6_SR_EXTI3               SYSCFG_ITLINE6_SR_EXTI3_MSK      /*!< External Interrupt 3 */
#define SYSCFG_ITLINE7_SR_EXTI4_POS           (0U)
#define SYSCFG_ITLINE7_SR_EXTI4_MSK           (0x1UL << SYSCFG_ITLINE7_SR_EXTI4_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE7_SR_EXTI4               SYSCFG_ITLINE7_SR_EXTI4_MSK      /*!< External Interrupt 4 */
#define SYSCFG_ITLINE7_SR_EXTI5_POS           (1U)
#define SYSCFG_ITLINE7_SR_EXTI5_MSK           (0x1UL << SYSCFG_ITLINE7_SR_EXTI5_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE7_SR_EXTI5               SYSCFG_ITLINE7_SR_EXTI5_MSK      /*!< External Interrupt 5 */
#define SYSCFG_ITLINE7_SR_EXTI6_POS           (2U)
#define SYSCFG_ITLINE7_SR_EXTI6_MSK           (0x1UL << SYSCFG_ITLINE7_SR_EXTI6_POS) /*!< 0x00000004 */
#define SYSCFG_ITLINE7_SR_EXTI6               SYSCFG_ITLINE7_SR_EXTI6_MSK      /*!< External Interrupt 6 */
#define SYSCFG_ITLINE7_SR_EXTI7_POS           (3U)
#define SYSCFG_ITLINE7_SR_EXTI7_MSK           (0x1UL << SYSCFG_ITLINE7_SR_EXTI7_POS) /*!< 0x00000008 */
#define SYSCFG_ITLINE7_SR_EXTI7               SYSCFG_ITLINE7_SR_EXTI7_MSK      /*!< External Interrupt 7 */
#define SYSCFG_ITLINE7_SR_EXTI8_POS           (4U)
#define SYSCFG_ITLINE7_SR_EXTI8_MSK           (0x1UL << SYSCFG_ITLINE7_SR_EXTI8_POS) /*!< 0x00000010 */
#define SYSCFG_ITLINE7_SR_EXTI8               SYSCFG_ITLINE7_SR_EXTI8_MSK      /*!< External Interrupt 8 */
#define SYSCFG_ITLINE7_SR_EXTI9_POS           (5U)
#define SYSCFG_ITLINE7_SR_EXTI9_MSK           (0x1UL << SYSCFG_ITLINE7_SR_EXTI9_POS) /*!< 0x00000020 */
#define SYSCFG_ITLINE7_SR_EXTI9               SYSCFG_ITLINE7_SR_EXTI9_MSK      /*!< External Interrupt 9 */
#define SYSCFG_ITLINE7_SR_EXTI10_POS          (6U)
#define SYSCFG_ITLINE7_SR_EXTI10_MSK          (0x1UL << SYSCFG_ITLINE7_SR_EXTI10_POS) /*!< 0x00000040 */
#define SYSCFG_ITLINE7_SR_EXTI10              SYSCFG_ITLINE7_SR_EXTI10_MSK     /*!< External Interrupt 10 */
#define SYSCFG_ITLINE7_SR_EXTI11_POS          (7U)
#define SYSCFG_ITLINE7_SR_EXTI11_MSK          (0x1UL << SYSCFG_ITLINE7_SR_EXTI11_POS) /*!< 0x00000080 */
#define SYSCFG_ITLINE7_SR_EXTI11              SYSCFG_ITLINE7_SR_EXTI11_MSK     /*!< External Interrupt 11 */
#define SYSCFG_ITLINE7_SR_EXTI12_POS          (8U)
#define SYSCFG_ITLINE7_SR_EXTI12_MSK          (0x1UL << SYSCFG_ITLINE7_SR_EXTI12_POS) /*!< 0x00000100 */
#define SYSCFG_ITLINE7_SR_EXTI12              SYSCFG_ITLINE7_SR_EXTI12_MSK     /*!< External Interrupt 12 */
#define SYSCFG_ITLINE7_SR_EXTI13_POS          (9U)
#define SYSCFG_ITLINE7_SR_EXTI13_MSK          (0x1UL << SYSCFG_ITLINE7_SR_EXTI13_POS) /*!< 0x00000200 */
#define SYSCFG_ITLINE7_SR_EXTI13              SYSCFG_ITLINE7_SR_EXTI13_MSK     /*!< External Interrupt 13 */
#define SYSCFG_ITLINE7_SR_EXTI14_POS          (10U)
#define SYSCFG_ITLINE7_SR_EXTI14_MSK          (0x1UL << SYSCFG_ITLINE7_SR_EXTI14_POS) /*!< 0x00000400 */
#define SYSCFG_ITLINE7_SR_EXTI14              SYSCFG_ITLINE7_SR_EXTI14_MSK     /*!< External Interrupt 14 */
#define SYSCFG_ITLINE7_SR_EXTI15_POS          (11U)
#define SYSCFG_ITLINE7_SR_EXTI15_MSK          (0x1UL << SYSCFG_ITLINE7_SR_EXTI15_POS) /*!< 0x00000800 */
#define SYSCFG_ITLINE7_SR_EXTI15              SYSCFG_ITLINE7_SR_EXTI15_MSK     /*!< External Interrupt 15 */
#define SYSCFG_ITLINE8_SR_UCPD1_POS          (0U)
#define SYSCFG_ITLINE8_SR_UCPD1_MSK          (0x1UL << SYSCFG_ITLINE8_SR_UCPD1_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE8_SR_UCPD1              SYSCFG_ITLINE8_SR_UCPD1_MSK       /*!< UCPD1 -> exti[32] Interrupt */
#define SYSCFG_ITLINE8_SR_UCPD2_POS          (1U)
#define SYSCFG_ITLINE8_SR_UCPD2_MSK          (0x1UL << SYSCFG_ITLINE8_SR_UCPD2_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE8_SR_UCPD2              SYSCFG_ITLINE8_SR_UCPD2_MSK       /*!< UCPD2 -> exti[33] Interrupt */
#define SYSCFG_ITLINE9_SR_DMA1_CH1_POS        (0U)
#define SYSCFG_ITLINE9_SR_DMA1_CH1_MSK        (0x1UL << SYSCFG_ITLINE9_SR_DMA1_CH1_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE9_SR_DMA1_CH1            SYSCFG_ITLINE9_SR_DMA1_CH1_MSK   /*!< DMA1 CHANNEL 1 Interrupt */
#define SYSCFG_ITLINE10_SR_DMA1_CH2_POS       (0U)
#define SYSCFG_ITLINE10_SR_DMA1_CH2_MSK       (0x1UL << SYSCFG_ITLINE10_SR_DMA1_CH2_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE10_SR_DMA1_CH2           SYSCFG_ITLINE10_SR_DMA1_CH2_MSK  /*!< DMA1 CHANNEL 2 Interrupt */
#define SYSCFG_ITLINE10_SR_DMA1_CH3_POS       (1U)
#define SYSCFG_ITLINE10_SR_DMA1_CH3_MSK       (0x1UL << SYSCFG_ITLINE10_SR_DMA1_CH3_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE10_SR_DMA1_CH3           SYSCFG_ITLINE10_SR_DMA1_CH3_MSK  /*!< DMA2 CHANNEL 3 Interrupt */
#define SYSCFG_ITLINE11_SR_DMAMUX1_POS         (0U)
#define SYSCFG_ITLINE11_SR_DMAMUX1_MSK         (0x1UL << SYSCFG_ITLINE11_SR_DMAMUX1_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE11_SR_DMAMUX1             SYSCFG_ITLINE11_SR_DMAMUX1_MSK    /*!< DMAMUX Interrupt */
#define SYSCFG_ITLINE11_SR_DMA1_CH4_POS       (1U)
#define SYSCFG_ITLINE11_SR_DMA1_CH4_MSK       (0x1UL << SYSCFG_ITLINE11_SR_DMA1_CH4_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE11_SR_DMA1_CH4           SYSCFG_ITLINE11_SR_DMA1_CH4_MSK  /*!< DMA1 CHANNEL 4 Interrupt */
#define SYSCFG_ITLINE11_SR_DMA1_CH5_POS       (2U)
#define SYSCFG_ITLINE11_SR_DMA1_CH5_MSK       (0x1UL << SYSCFG_ITLINE11_SR_DMA1_CH5_POS) /*!< 0x00000004 */
#define SYSCFG_ITLINE11_SR_DMA1_CH5           SYSCFG_ITLINE11_SR_DMA1_CH5_MSK  /*!< DMA1 CHANNEL 5 Interrupt */
#define SYSCFG_ITLINE11_SR_DMA1_CH6_POS       (3U)
#define SYSCFG_ITLINE11_SR_DMA1_CH6_MSK       (0x1UL << SYSCFG_ITLINE11_SR_DMA1_CH6_POS) /*!< 0x00000008 */
#define SYSCFG_ITLINE11_SR_DMA1_CH6           SYSCFG_ITLINE11_SR_DMA1_CH6_MSK  /*!< DMA1 CHANNEL 6 Interrupt */
#define SYSCFG_ITLINE11_SR_DMA1_CH7_POS       (4U)
#define SYSCFG_ITLINE11_SR_DMA1_CH7_MSK       (0x1UL << SYSCFG_ITLINE11_SR_DMA1_CH7_POS) /*!< 0x00000010 */
#define SYSCFG_ITLINE11_SR_DMA1_CH7           SYSCFG_ITLINE11_SR_DMA1_CH7_MSK  /*!< DMA1 CHANNEL 7 Interrupt */
#define SYSCFG_ITLINE12_SR_ADC_POS            (0U)
#define SYSCFG_ITLINE12_SR_ADC_MSK            (0x1UL << SYSCFG_ITLINE12_SR_ADC_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE12_SR_ADC                SYSCFG_ITLINE12_SR_ADC_MSK       /*!< ADC Interrupt */
#define SYSCFG_ITLINE12_SR_COMP1_POS          (1U)
#define SYSCFG_ITLINE12_SR_COMP1_MSK          (0x1UL << SYSCFG_ITLINE12_SR_COMP1_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE12_SR_COMP1              SYSCFG_ITLINE12_SR_COMP1_MSK     /*!< COMP1 Interrupt -> exti[17] */
#define SYSCFG_ITLINE12_SR_COMP2_POS          (2U)
#define SYSCFG_ITLINE12_SR_COMP2_MSK          (0x1UL << SYSCFG_ITLINE12_SR_COMP2_POS) /*!< 0x00000004 */
#define SYSCFG_ITLINE12_SR_COMP2              SYSCFG_ITLINE12_SR_COMP2_MSK     /*!< COMP2 Interrupt -> exti[18] */
#define SYSCFG_ITLINE13_SR_TIM1_CCU_POS       (0U)
#define SYSCFG_ITLINE13_SR_TIM1_CCU_MSK       (0x1UL << SYSCFG_ITLINE13_SR_TIM1_CCU_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE13_SR_TIM1_CCU           SYSCFG_ITLINE13_SR_TIM1_CCU_MSK  /*!< TIM1 CCU Interrupt */
#define SYSCFG_ITLINE13_SR_TIM1_TRG_POS       (1U)
#define SYSCFG_ITLINE13_SR_TIM1_TRG_MSK       (0x1UL << SYSCFG_ITLINE13_SR_TIM1_TRG_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE13_SR_TIM1_TRG           SYSCFG_ITLINE13_SR_TIM1_TRG_MSK  /*!< TIM1 TRG Interrupt */
#define SYSCFG_ITLINE13_SR_TIM1_UPD_POS       (2U)
#define SYSCFG_ITLINE13_SR_TIM1_UPD_MSK       (0x1UL << SYSCFG_ITLINE13_SR_TIM1_UPD_POS) /*!< 0x00000004 */
#define SYSCFG_ITLINE13_SR_TIM1_UPD           SYSCFG_ITLINE13_SR_TIM1_UPD_MSK  /*!< TIM1 UPD Interrupt */
#define SYSCFG_ITLINE13_SR_TIM1_BRK_POS       (3U)
#define SYSCFG_ITLINE13_SR_TIM1_BRK_MSK       (0x1UL << SYSCFG_ITLINE13_SR_TIM1_BRK_POS) /*!< 0x00000008 */
#define SYSCFG_ITLINE13_SR_TIM1_BRK           SYSCFG_ITLINE13_SR_TIM1_BRK_MSK  /*!< TIM1 BRK Interrupt */
#define SYSCFG_ITLINE14_SR_TIM1_CC_POS        (0U)
#define SYSCFG_ITLINE14_SR_TIM1_CC_MSK        (0x1UL << SYSCFG_ITLINE14_SR_TIM1_CC_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE14_SR_TIM1_CC            SYSCFG_ITLINE14_SR_TIM1_CC_MSK   /*!< TIM1 CC Interrupt */
#define SYSCFG_ITLINE15_SR_TIM2_GLB_POS       (0U)
#define SYSCFG_ITLINE15_SR_TIM2_GLB_MSK       (0x1UL << SYSCFG_ITLINE15_SR_TIM2_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE15_SR_TIM2_GLB           SYSCFG_ITLINE15_SR_TIM2_GLB_MSK  /*!< TIM2 GLB Interrupt */
#define SYSCFG_ITLINE16_SR_TIM3_GLB_POS       (0U)
#define SYSCFG_ITLINE16_SR_TIM3_GLB_MSK       (0x1UL << SYSCFG_ITLINE16_SR_TIM3_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE16_SR_TIM3_GLB           SYSCFG_ITLINE16_SR_TIM3_GLB_MSK  /*!< TIM3 GLB Interrupt */
#define SYSCFG_ITLINE17_SR_TIM6_GLB_POS       (0U)
#define SYSCFG_ITLINE17_SR_TIM6_GLB_MSK       (0x1UL << SYSCFG_ITLINE17_SR_TIM6_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE17_SR_TIM6_GLB           SYSCFG_ITLINE17_SR_TIM6_GLB_MSK  /*!< TIM6 GLB Interrupt */
#define SYSCFG_ITLINE17_SR_DAC_POS            (1U)
#define SYSCFG_ITLINE17_SR_DAC_MSK            (0x1UL << SYSCFG_ITLINE17_SR_DAC_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE17_SR_DAC                SYSCFG_ITLINE17_SR_DAC_MSK       /*!< DAC Interrupt */
#define SYSCFG_ITLINE17_SR_LPTIM1_GLB_POS     (2U)
#define SYSCFG_ITLINE17_SR_LPTIM1_GLB_MSK     (0x1UL << SYSCFG_ITLINE17_SR_LPTIM1_GLB_POS) /*!< 0x00000004 */
#define SYSCFG_ITLINE17_SR_LPTIM1_GLB         SYSCFG_ITLINE17_SR_LPTIM1_GLB_MSK /*!< LPTIM1 -> exti[29] Interrupt */
#define SYSCFG_ITLINE18_SR_TIM7_GLB_POS       (0U)
#define SYSCFG_ITLINE18_SR_TIM7_GLB_MSK       (0x1UL << SYSCFG_ITLINE18_SR_TIM7_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE18_SR_TIM7_GLB           SYSCFG_ITLINE18_SR_TIM7_GLB_MSK  /*!< TIM7 GLB Interrupt */
#define SYSCFG_ITLINE18_SR_LPTIM2_GLB_POS     (1U)
#define SYSCFG_ITLINE18_SR_LPTIM2_GLB_MSK     (0x1UL << SYSCFG_ITLINE18_SR_LPTIM2_GLB_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE18_SR_LPTIM2_GLB         SYSCFG_ITLINE18_SR_LPTIM2_GLB_MSK /*!< LPTIM2 -> exti[30] Interrupt */
#define SYSCFG_ITLINE19_SR_TIM14_GLB_POS      (0U)
#define SYSCFG_ITLINE19_SR_TIM14_GLB_MSK      (0x1UL << SYSCFG_ITLINE19_SR_TIM14_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE19_SR_TIM14_GLB          SYSCFG_ITLINE19_SR_TIM14_GLB_MSK /*!< TIM14 GLB Interrupt */
#define SYSCFG_ITLINE20_SR_TIM15_GLB_POS      (0U)
#define SYSCFG_ITLINE20_SR_TIM15_GLB_MSK      (0x1UL << SYSCFG_ITLINE20_SR_TIM15_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE20_SR_TIM15_GLB          SYSCFG_ITLINE20_SR_TIM15_GLB_MSK /*!< TIM15 GLB Interrupt */
#define SYSCFG_ITLINE21_SR_TIM16_GLB_POS      (0U)
#define SYSCFG_ITLINE21_SR_TIM16_GLB_MSK      (0x1UL << SYSCFG_ITLINE21_SR_TIM16_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE21_SR_TIM16_GLB          SYSCFG_ITLINE21_SR_TIM16_GLB_MSK /*!< TIM16 GLB Interrupt */
#define SYSCFG_ITLINE22_SR_TIM17_GLB_POS      (0U)
#define SYSCFG_ITLINE22_SR_TIM17_GLB_MSK      (0x1UL << SYSCFG_ITLINE22_SR_TIM17_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE22_SR_TIM17_GLB          SYSCFG_ITLINE22_SR_TIM17_GLB_MSK /*!< TIM17 GLB Interrupt */
#define SYSCFG_ITLINE23_SR_I2C1_GLB_POS       (0U)
#define SYSCFG_ITLINE23_SR_I2C1_GLB_MSK       (0x1UL << SYSCFG_ITLINE23_SR_I2C1_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE23_SR_I2C1_GLB           SYSCFG_ITLINE23_SR_I2C1_GLB_MSK  /*!< I2C1 GLB Interrupt -> exti[23] */
#define SYSCFG_ITLINE24_SR_I2C2_GLB_POS       (0U)
#define SYSCFG_ITLINE24_SR_I2C2_GLB_MSK       (0x1UL << SYSCFG_ITLINE24_SR_I2C2_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE24_SR_I2C2_GLB           SYSCFG_ITLINE24_SR_I2C2_GLB_MSK  /*!< I2C2 GLB Interrupt */
#define SYSCFG_ITLINE25_SR_SPI1_POS           (0U)
#define SYSCFG_ITLINE25_SR_SPI1_MSK           (0x1UL << SYSCFG_ITLINE25_SR_SPI1_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE25_SR_SPI1               SYSCFG_ITLINE25_SR_SPI1_MSK      /*!< SPI1 Interrupt */
#define SYSCFG_ITLINE26_SR_SPI2_POS           (0U)
#define SYSCFG_ITLINE26_SR_SPI2_MSK           (0x1UL << SYSCFG_ITLINE26_SR_SPI2_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE26_SR_SPI2               SYSCFG_ITLINE26_SR_SPI2_MSK      /*!< SPI2  Interrupt */
#define SYSCFG_ITLINE27_SR_USART1_GLB_POS     (0U)
#define SYSCFG_ITLINE27_SR_USART1_GLB_MSK     (0x1UL << SYSCFG_ITLINE27_SR_USART1_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE27_SR_USART1_GLB         SYSCFG_ITLINE27_SR_USART1_GLB_MSK /*!< USART1 GLB Interrupt -> exti[25] */
#define SYSCFG_ITLINE28_SR_USART2_GLB_POS     (0U)
#define SYSCFG_ITLINE28_SR_USART2_GLB_MSK     (0x1UL << SYSCFG_ITLINE28_SR_USART2_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE28_SR_USART2_GLB         SYSCFG_ITLINE28_SR_USART2_GLB_MSK /*!< USART2 GLB Interrupt -> exti[26] */
#define SYSCFG_ITLINE29_SR_USART3_GLB_POS     (0U)
#define SYSCFG_ITLINE29_SR_USART3_GLB_MSK     (0x1UL << SYSCFG_ITLINE29_SR_USART3_GLB_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE29_SR_USART3_GLB         SYSCFG_ITLINE29_SR_USART3_GLB_MSK /*!< USART3 GLB Interrupt */
#define SYSCFG_ITLINE29_SR_USART4_GLB_POS     (1U)
#define SYSCFG_ITLINE29_SR_USART4_GLB_MSK     (0x1UL << SYSCFG_ITLINE29_SR_USART4_GLB_POS) /*!< 0x00000002 */
#define SYSCFG_ITLINE29_SR_USART4_GLB         SYSCFG_ITLINE29_SR_USART4_GLB_MSK /*!< USART4 GLB Interrupt */
#define SYSCFG_ITLINE29_SR_LPUART1_GLB_POS    (2U)
#define SYSCFG_ITLINE29_SR_LPUART1_GLB_MSK    (0x1UL << SYSCFG_ITLINE29_SR_LPUART1_GLB_POS) /*!< 0x00000004 */
#define SYSCFG_ITLINE29_SR_LPUART1_GLB        SYSCFG_ITLINE29_SR_LPUART1_GLB_MSK /*!< LPUART1 GLB Interrupt -> exti[28] */
#define SYSCFG_ITLINE30_SR_CEC_POS            (0U)
#define SYSCFG_ITLINE30_SR_CEC_MSK            (0x1UL << SYSCFG_ITLINE30_SR_CEC_POS) /*!< 0x00000001 */
#define SYSCFG_ITLINE30_SR_CEC                SYSCFG_ITLINE30_SR_CEC_MSK       /*!< CEC Interrupt-> exti[27] */





