ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- TIMER REGISTERS -------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief TIM
  */
typedef struct
{
  volatile uint32 CR1;         /*!< TIM control register 1,                   Address offset: 0x00 */
  volatile uint32 CR2;         /*!< TIM control register 2,                   Address offset: 0x04 */
  volatile uint32 SMCR;        /*!< TIM slave mode control register,          Address offset: 0x08 */
  volatile uint16 DIER;        /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
  uint16 RESERVED_0;
  volatile uint16 SR;          /*!< TIM status register,                      Address offset: 0x10 */
  uint16 RESERVED_1;
  volatile uint32 EGR;         /*!< TIM event generation register,            Address offset: 0x14 */
  volatile uint16 CCMR1;       /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
  uint16 RESERVED_2;
  volatile uint16 CCMR2;       /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
  uint16 RESERVED_3;
  volatile uint32 CCER;        /*!< TIM capture/compare enable register,      Address offset: 0x20 */
  volatile uint32 CNT;         /*!< TIM counter register,                     Address offset: 0x24 */
  volatile uint32 PSC;         /*!< TIM prescaler register,                   Address offset: 0x28 */
  volatile uint32 ARR;         /*!< TIM auto-reload register,                 Address offset: 0x2C */
  volatile uint32 RCR;         /*!< TIM repetition counter register,          Address offset: 0x30 */
  volatile uint32 CCR[4];      /*!< TIM capture/compare register 1, 2, 3, 4   Address offset: 0x34 */
  volatile uint32 BDTR;        /*!< TIM break and dead-time register,         Address offset: 0x44 */
  volatile uint32 DCR;         /*!< TIM DMA control register,                 Address offset: 0x48 */
  volatile uint32 DMAR;        /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
  volatile uint32 OR1;         /*!< TIM option register,                      Address offset: 0x50 */
  volatile uint32 CCMR3;       /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
  volatile uint32 CCR5;        /*!< TIM capture/compare register5,            Address offset: 0x58 */
  volatile uint32 CCR6;        /*!< TIM capture/compare register6,            Address offset: 0x5C */
  volatile uint32 AF1;         /*!< TIM alternate function register 1,        Address offset: 0x60 */
  volatile uint32 AF2;         /*!< TIM alternate function register 2,        Address offset: 0x64 */
  volatile uint32 TISEL;       /*!< TIM Input Selection register,             Address offset: 0x68 */
} TIM_DEF_TYPE;

#define TIM_1                (*(TIM_DEF_TYPE *) TIM1_BASE)
#define TIM_2                (*(TIM_DEF_TYPE *) TIM2_BASE)
#define TIM_3                (*(TIM_DEF_TYPE *) TIM3_BASE)
#define TIM_4                (*(TIM_DEF_TYPE *) TIM4_BASE)
#define TIM_6                (*(TIM_DEF_TYPE *) TIM6_BASE)
#define TIM_7                (*(TIM_DEF_TYPE *) TIM7_BASE)
#define TIM_14               (*(TIM_DEF_TYPE *) TIM14_BASE)
#define TIM_15               (*(TIM_DEF_TYPE *) TIM15_BASE)
#define TIM_16               (*(TIM_DEF_TYPE *) TIM16_BASE)
#define TIM_17               (*(TIM_DEF_TYPE *) TIM17_BASE)


typedef enum
{
    TIMER_FROZEN,
    TIMER_ACTIVE_IN_MATCH,
    TIMER_INACTIVE_IN_MATCH,
    TIMER_TOGGLE,
    TIMER_FORCE_INACTIVE,
    TIMER_FORCE_ACTIVE,
    TIMER_PWM1,
    TIMER_PWM2
} TIMER_MODE_DEF;

/*******************  Bit definition for TIM_CR1 register  ********************/
#define TIM_CR1_CEN_POS           (0U)
#define TIM_CR1_CEN_MSK           (0x1UL << TIM_CR1_CEN_POS)                   /*!< 0x00000001 */
#define TIM_CR1_CEN               TIM_CR1_CEN_MSK                              /*!<Counter enable */
#define TIM_CR1_UDIS_POS          (1U)
#define TIM_CR1_UDIS_MSK          (0x1UL << TIM_CR1_UDIS_POS)                  /*!< 0x00000002 */
#define TIM_CR1_UDIS              TIM_CR1_UDIS_MSK                             /*!<Update disable */
#define TIM_CR1_URS_POS           (2U)
#define TIM_CR1_URS_MSK           (0x1UL << TIM_CR1_URS_POS)                   /*!< 0x00000004 */
#define TIM_CR1_URS               TIM_CR1_URS_MSK                              /*!<Update request source */
#define TIM_CR1_OPM_POS           (3U)
#define TIM_CR1_OPM_MSK           (0x1UL << TIM_CR1_OPM_POS)                   /*!< 0x00000008 */
#define TIM_CR1_OPM               TIM_CR1_OPM_MSK                              /*!<One pulse mode */
#define TIM_CR1_DIR_POS           (4U)
#define TIM_CR1_DIR_MSK           (0x1UL << TIM_CR1_DIR_POS)                   /*!< 0x00000010 */
#define TIM_CR1_DIR               TIM_CR1_DIR_MSK                              /*!<Direction */

#define TIM_CR1_CMS_POS           (5U)
#define TIM_CR1_CMS_MSK           (0x3UL << TIM_CR1_CMS_POS)                   /*!< 0x00000060 */
#define TIM_CR1_CMS               TIM_CR1_CMS_MSK                              /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_POS)                   /*!< 0x00000020 */
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_POS)                   /*!< 0x00000040 */

#define TIM_CR1_ARPE_POS          (7U)
#define TIM_CR1_ARPE_MSK          (0x1UL << TIM_CR1_ARPE_POS)                  /*!< 0x00000080 */
#define TIM_CR1_ARPE              TIM_CR1_ARPE_MSK                             /*!<Auto-reload preload enable */

#define TIM_CR1_CKD_POS           (8U)
#define TIM_CR1_CKD_MSK           (0x3UL << TIM_CR1_CKD_POS)                   /*!< 0x00000300 */
#define TIM_CR1_CKD               TIM_CR1_CKD_MSK                              /*!<CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_POS)                   /*!< 0x00000100 */
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_POS)                   /*!< 0x00000200 */

