ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define TIM_CR1_UIFREMAP_POS      (11U)
#define TIM_CR1_UIFREMAP_MSK      (0x1UL << TIM_CR1_UIFREMAP_POS)              /*!< 0x00000800 */
#define TIM_CR1_UIFREMAP          TIM_CR1_UIFREMAP_MSK                         /*!<Update interrupt flag remap */

/*******************  Bit definition for TIM_CR2 register  ********************/
#define TIM_CR2_CCPC_POS          (0U)
#define TIM_CR2_CCPC_MSK          (0x1UL << TIM_CR2_CCPC_POS)                  /*!< 0x00000001 */
#define TIM_CR2_CCPC              TIM_CR2_CCPC_MSK                             /*!<Capture/Compare Preloaded Control */
#define TIM_CR2_CCUS_POS          (2U)
#define TIM_CR2_CCUS_MSK          (0x1UL << TIM_CR2_CCUS_POS)                  /*!< 0x00000004 */
#define TIM_CR2_CCUS              TIM_CR2_CCUS_MSK                             /*!<Capture/Compare Control Update Selection */
#define TIM_CR2_CCDS_POS          (3U)
#define TIM_CR2_CCDS_MSK          (0x1UL << TIM_CR2_CCDS_POS)                  /*!< 0x00000008 */
#define TIM_CR2_CCDS              TIM_CR2_CCDS_MSK                             /*!<Capture/Compare DMA Selection */

#define TIM_CR2_MMS_POS           (4U)
#define TIM_CR2_MMS_MSK           (0x7UL << TIM_CR2_MMS_POS)                   /*!< 0x00000070 */
#define TIM_CR2_MMS               TIM_CR2_MMS_MSK                              /*!<MMS[2:0] bits (Master Mode Selection) */
#define TIM_CR2_MMS_0             (0x1UL << TIM_CR2_MMS_POS)                   /*!< 0x00000010 */
#define TIM_CR2_MMS_1             (0x2UL << TIM_CR2_MMS_POS)                   /*!< 0x00000020 */
#define TIM_CR2_MMS_2             (0x4UL << TIM_CR2_MMS_POS)                   /*!< 0x00000040 */

#define TIM_CR2_TI1S_POS          (7U)
#define TIM_CR2_TI1S_MSK          (0x1UL << TIM_CR2_TI1S_POS)                  /*!< 0x00000080 */
#define TIM_CR2_TI1S              TIM_CR2_TI1S_MSK                             /*!<TI1 Selection */
#define TIM_CR2_OIS1_POS          (8U)
#define TIM_CR2_OIS1_MSK          (0x1UL << TIM_CR2_OIS1_POS)                  /*!< 0x00000100 */
#define TIM_CR2_OIS1              TIM_CR2_OIS1_MSK                             /*!<Output Idle state 1 (OC1 output) */
#define TIM_CR2_OIS1N_POS         (9U)
#define TIM_CR2_OIS1N_MSK         (0x1UL << TIM_CR2_OIS1N_POS)                 /*!< 0x00000200 */
#define TIM_CR2_OIS1N             TIM_CR2_OIS1N_MSK                            /*!<Output Idle state 1 (OC1N output) */
#define TIM_CR2_OIS2_POS          (10U)
#define TIM_CR2_OIS2_MSK          (0x1UL << TIM_CR2_OIS2_POS)                  /*!< 0x00000400 */
#define TIM_CR2_OIS2              TIM_CR2_OIS2_MSK                             /*!<Output Idle state 2 (OC2 output) */
#define TIM_CR2_OIS2N_POS         (11U)
#define TIM_CR2_OIS2N_MSK         (0x1UL << TIM_CR2_OIS2N_POS)                 /*!< 0x00000800 */
#define TIM_CR2_OIS2N             TIM_CR2_OIS2N_MSK                            /*!<Output Idle state 2 (OC2N output) */
#define TIM_CR2_OIS3_POS          (12U)
#define TIM_CR2_OIS3_MSK          (0x1UL << TIM_CR2_OIS3_POS)                  /*!< 0x00001000 */
#define TIM_CR2_OIS3              TIM_CR2_OIS3_MSK                             /*!<Output Idle state 3 (OC3 output) */
#define TIM_CR2_OIS3N_POS         (13U)
#define TIM_CR2_OIS3N_MSK         (0x1UL << TIM_CR2_OIS3N_POS)                 /*!< 0x00002000 */
#define TIM_CR2_OIS3N             TIM_CR2_OIS3N_MSK                            /*!<Output Idle state 3 (OC3N output) */
#define TIM_CR2_OIS4_POS          (14U)
#define TIM_CR2_OIS4_MSK          (0x1UL << TIM_CR2_OIS4_POS)                  /*!< 0x00004000 */
#define TIM_CR2_OIS4              TIM_CR2_OIS4_MSK                             /*!<Output Idle state 4 (OC4 output) */
#define TIM_CR2_OIS5_POS          (16U)
#define TIM_CR2_OIS5_MSK          (0x1UL << TIM_CR2_OIS5_POS)                  /*!< 0x00010000 */
#define TIM_CR2_OIS5              TIM_CR2_OIS5_MSK                             /*!<Output Idle state 5 (OC5 output) */
#define TIM_CR2_OIS6_POS          (18U)
#define TIM_CR2_OIS6_MSK          (0x1UL << TIM_CR2_OIS6_POS)                  /*!< 0x00040000 */
#define TIM_CR2_OIS6              TIM_CR2_OIS6_MSK                             /*!<Output Idle state 6 (OC6 output) */

#define TIM_CR2_MMS2_POS          (20U)
#define TIM_CR2_MMS2_MSK          (0xFUL << TIM_CR2_MMS2_POS)                  /*!< 0x00F00000 */
#define TIM_CR2_MMS2              TIM_CR2_MMS2_MSK                             /*!<MMS[2:0] bits (Master Mode Selection) */
#define TIM_CR2_MMS2_0            (0x1UL << TIM_CR2_MMS2_POS)                  /*!< 0x00100000 */
#define TIM_CR2_MMS2_1            (0x2UL << TIM_CR2_MMS2_POS)                  /*!< 0x00200000 */
#define TIM_CR2_MMS2_2            (0x4UL << TIM_CR2_MMS2_POS)                  /*!< 0x00400000 */
#define TIM_CR2_MMS2_3            (0x8UL << TIM_CR2_MMS2_POS)                  /*!< 0x00800000 */

/*******************  Bit definition for TIM_SMCR register  *******************/
#define TIM_SMCR_SMS_POS          (0U)
#define TIM_SMCR_SMS_MSK          (0x10007UL << TIM_SMCR_SMS_POS)              /*!< 0x00010007 */
#define TIM_SMCR_SMS              TIM_SMCR_SMS_MSK                             /*!<SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCR_SMS_0            (0x00001UL << TIM_SMCR_SMS_POS)              /*!< 0x00000001 */
#define TIM_SMCR_SMS_1            (0x00002UL << TIM_SMCR_SMS_POS)              /*!< 0x00000002 */
#define TIM_SMCR_SMS_2            (0x00004UL << TIM_SMCR_SMS_POS)              /*!< 0x00000004 */
#define TIM_SMCR_SMS_3            (0x10000UL << TIM_SMCR_SMS_POS)              /*!< 0x00010000 */

#define TIM_SMCR_OCCS_POS         (3U)
#define TIM_SMCR_OCCS_MSK         (0x1UL << TIM_SMCR_OCCS_POS)                 /*!< 0x00000008 */
#define TIM_SMCR_OCCS             TIM_SMCR_OCCS_MSK                            /*!< OCREF clear selection */

#define TIM_SMCR_TS_POS           (4U)
#define TIM_SMCR_TS_MSK           (0x30007UL << TIM_SMCR_TS_POS)               /*!< 0x00300070 */
#define TIM_SMCR_TS               TIM_SMCR_TS_MSK                              /*!<TS[2:0] bits (Trigger selection) */
#define TIM_SMCR_TS_0             (0x00001UL << TIM_SMCR_TS_POS)               /*!< 0x00000010 */
#define TIM_SMCR_TS_1             (0x00002UL << TIM_SMCR_TS_POS)               /*!< 0x00000020 */
#define TIM_SMCR_TS_2             (0x00004UL << TIM_SMCR_TS_POS)               /*!< 0x00000040 */
#define TIM_SMCR_TS_3             (0x10000UL << TIM_SMCR_TS_POS)               /*!< 0x00100000 */
#define TIM_SMCR_TS_4             (0x20000UL << TIM_SMCR_TS_POS)               /*!< 0x00200000 */

#define TIM_SMCR_MSM_POS          (7U)
#define TIM_SMCR_MSM_MSK          (0x1UL << TIM_SMCR_MSM_POS)                  /*!< 0x00000080 */
#define TIM_SMCR_MSM              TIM_SMCR_MSM_MSK                             /*!<Master/slave mode */

#define TIM_SMCR_ETF_POS          (8U)
#define TIM_SMCR_ETF_MSK          (0xFUL << TIM_SMCR_ETF_POS)                  /*!< 0x00000F00 */
#define TIM_SMCR_ETF              TIM_SMCR_ETF_MSK                             /*!<ETF[3:0] bits (External trigger filter) */
#define TIM_SMCR_ETF_0            (0x1UL << TIM_SMCR_ETF_POS)                  /*!< 0x00000100 */
#define TIM_SMCR_ETF_1            (0x2UL << TIM_SMCR_ETF_POS)                  /*!< 0x00000200 */
#define TIM_SMCR_ETF_2            (0x4UL << TIM_SMCR_ETF_POS)                  /*!< 0x00000400 */
#define TIM_SMCR_ETF_3            (0x8UL << TIM_SMCR_ETF_POS)                  /*!< 0x00000800 */

#define TIM_SMCR_ETPS_POS         (12U)
#define TIM_SMCR_ETPS_MSK         (0x3UL << TIM_SMCR_ETPS_POS)                 /*!< 0x00003000 */
#define TIM_SMCR_ETPS             TIM_SMCR_ETPS_MSK                            /*!<ETPS[1:0] bits (External trigger prescaler) */
#define TIM_SMCR_ETPS_0           (0x1UL << TIM_SMCR_ETPS_POS)                 /*!< 0x00001000 */
#define TIM_SMCR_ETPS_1           (0x2UL << TIM_SMCR_ETPS_POS)                 /*!< 0x00002000 */

#define TIM_SMCR_ECE_POS          (14U)
#define TIM_SMCR_ECE_MSK          (0x1UL << TIM_SMCR_ECE_POS)                  /*!< 0x00004000 */
#define TIM_SMCR_ECE              TIM_SMCR_ECE_MSK                             /*!<External clock enable */
#define TIM_SMCR_ETP_POS          (15U)
#define TIM_SMCR_ETP_MSK          (0x1UL << TIM_SMCR_ETP_POS)                  /*!< 0x00008000 */
#define TIM_SMCR_ETP              TIM_SMCR_ETP_MSK                             /*!<External trigger polarity */

/*******************  Bit definition for TIM_DIER register  *******************/
#define TIM_DIER_UIE_POS          (0U)
#define TIM_DIER_UIE_MSK          (0x1UL << TIM_DIER_UIE_POS)                  /*!< 0x00000001 */
#define TIM_DIER_UIE              TIM_DIER_UIE_MSK                             /*!<Update interrupt enable */
#define TIM_DIER_CC1IE_POS        (1U)
#define TIM_DIER_CC1IE_MSK        (0x1UL << TIM_DIER_CC1IE_POS)                /*!< 0x00000002 */
#define TIM_DIER_CC1IE            TIM_DIER_CC1IE_MSK                           /*!<Capture/Compare 1 interrupt enable */
#define TIM_DIER_CC2IE_POS        (2U)
#define TIM_DIER_CC2IE_MSK        (0x1UL << TIM_DIER_CC2IE_POS)                /*!< 0x00000004 */
#define TIM_DIER_CC2IE            TIM_DIER_CC2IE_MSK                           /*!<Capture/Compare 2 interrupt enable */
#define TIM_DIER_CC3IE_POS        (3U)
#define TIM_DIER_CC3IE_MSK        (0x1UL << TIM_DIER_CC3IE_POS)                /*!< 0x00000008 */
#define TIM_DIER_CC3IE            TIM_DIER_CC3IE_MSK                           /*!<Capture/Compare 3 interrupt enable */
#define TIM_DIER_CC4IE_POS        (4U)
#define TIM_DIER_CC4IE_MSK        (0x1UL << TIM_DIER_CC4IE_POS)                /*!< 0x00000010 */
#define TIM_DIER_CC4IE            TIM_DIER_CC4IE_MSK                           /*!<Capture/Compare 4 interrupt enable */
#define TIM_DIER_COMIE_POS        (5U)
#define TIM_DIER_COMIE_MSK        (0x1UL << TIM_DIER_COMIE_POS)                /*!< 0x00000020 */
#define TIM_DIER_COMIE            TIM_DIER_COMIE_MSK                           /*!<COM interrupt enable */
#define TIM_DIER_TIE_POS          (6U)
#define TIM_DIER_TIE_MSK          (0x1UL << TIM_DIER_TIE_POS)                  /*!< 0x00000040 */
#define TIM_DIER_TIE              TIM_DIER_TIE_MSK                             /*!<Trigger interrupt enable */
#define TIM_DIER_BIE_POS          (7U)
#define TIM_DIER_BIE_MSK          (0x1UL << TIM_DIER_BIE_POS)                  /*!< 0x00000080 */
#define TIM_DIER_BIE              TIM_DIER_BIE_MSK                             /*!<Break interrupt enable */
#define TIM_DIER_UDE_POS          (8U)
#define TIM_DIER_UDE_MSK          (0x1UL << TIM_DIER_UDE_POS)                  /*!< 0x00000100 */
#define TIM_DIER_UDE              TIM_DIER_UDE_MSK                             /*!<Update DMA request enable */
#define TIM_DIER_CC1DE_POS        (9U)
#define TIM_DIER_CC1DE_MSK        (0x1UL << TIM_DIER_CC1DE_POS)                /*!< 0x00000200 */
#define TIM_DIER_CC1DE            TIM_DIER_CC1DE_MSK                           /*!<Capture/Compare 1 DMA request enable */
#define TIM_DIER_CC2DE_POS        (10U)
#define TIM_DIER_CC2DE_MSK        (0x1UL << TIM_DIER_CC2DE_POS)                /*!< 0x00000400 */
#define TIM_DIER_CC2DE            TIM_DIER_CC2DE_MSK                           /*!<Capture/Compare 2 DMA request enable */
#define TIM_DIER_CC3DE_POS        (11U)
#define TIM_DIER_CC3DE_MSK        (0x1UL << TIM_DIER_CC3DE_POS)                /*!< 0x00000800 */
#define TIM_DIER_CC3DE            TIM_DIER_CC3DE_MSK                           /*!<Capture/Compare 3 DMA request enable */
#define TIM_DIER_CC4DE_POS        (12U)
#define TIM_DIER_CC4DE_MSK        (0x1UL << TIM_DIER_CC4DE_POS)                /*!< 0x00001000 */
#define TIM_DIER_CC4DE            TIM_DIER_CC4DE_MSK                           /*!<Capture/Compare 4 DMA request enable */
#define TIM_DIER_COMDE_POS        (13U)
#define TIM_DIER_COMDE_MSK        (0x1UL << TIM_DIER_COMDE_POS)                /*!< 0x00002000 */
#define TIM_DIER_COMDE            TIM_DIER_COMDE_MSK                           /*!<COM DMA request enable */
#define TIM_DIER_TDE_POS          (14U)
#define TIM_DIER_TDE_MSK          (0x1UL << TIM_DIER_TDE_POS)                  /*!< 0x00004000 */
#define TIM_DIER_TDE              TIM_DIER_TDE_MSK                             /*!<Trigger DMA request enable */

/********************  Bit definition for TIM_SR register  ********************/
#define TIM_SR_UIF_POS            (0U)
#define TIM_SR_UIF_MSK            (0x1UL << TIM_SR_UIF_POS)                    /*!< 0x00000001 */
#define TIM_SR_UIF                TIM_SR_UIF_MSK                               /*!<Update interrupt Flag */
#define TIM_SR_CC1IF_POS          (1U)
#define TIM_SR_CC1IF_MSK          (0x1UL << TIM_SR_CC1IF_POS)                  /*!< 0x00000002 */
#define TIM_SR_CC1IF              TIM_SR_CC1IF_MSK                             /*!<Capture/Compare 1 interrupt Flag */
#define TIM_SR_CC2IF_POS          (2U)
#define TIM_SR_CC2IF_MSK          (0x1UL << TIM_SR_CC2IF_POS)                  /*!< 0x00000004 */
#define TIM_SR_CC2IF              TIM_SR_CC2IF_MSK                             /*!<Capture/Compare 2 interrupt Flag */
#define TIM_SR_CC3IF_POS          (3U)
#define TIM_SR_CC3IF_MSK          (0x1UL << TIM_SR_CC3IF_POS)                  /*!< 0x00000008 */
#define TIM_SR_CC3IF              TIM_SR_CC3IF_MSK                             /*!<Capture/Compare 3 interrupt Flag */
#define TIM_SR_CC4IF_POS          (4U)
#define TIM_SR_CC4IF_MSK          (0x1UL << TIM_SR_CC4IF_POS)                  /*!< 0x00000010 */
#define TIM_SR_CC4IF              TIM_SR_CC4IF_MSK                             /*!<Capture/Compare 4 interrupt Flag */
#define TIM_SR_COMIF_POS          (5U)
#define TIM_SR_COMIF_MSK          (0x1UL << TIM_SR_COMIF_POS)                  /*!< 0x00000020 */
#define TIM_SR_COMIF              TIM_SR_COMIF_MSK                             /*!<COM interrupt Flag */
#define TIM_SR_TIF_POS            (6U)
#define TIM_SR_TIF_MSK            (0x1UL << TIM_SR_TIF_POS)                    /*!< 0x00000040 */
#define TIM_SR_TIF                TIM_SR_TIF_MSK                               /*!<Trigger interrupt Flag */
#define TIM_SR_BIF_POS            (7U)
#define TIM_SR_BIF_MSK            (0x1UL << TIM_SR_BIF_POS)                    /*!< 0x00000080 */
#define TIM_SR_BIF                TIM_SR_BIF_MSK                               /*!<Break interrupt Flag */
#define TIM_SR_B2IF_POS           (8U)
#define TIM_SR_B2IF_MSK           (0x1UL << TIM_SR_B2IF_POS)                   /*!< 0x00000100 */
#define TIM_SR_B2IF               TIM_SR_B2IF_MSK                              /*!<Break 2 interrupt Flag */
#define TIM_SR_CC1OF_POS          (9U)
#define TIM_SR_CC1OF_MSK          (0x1UL << TIM_SR_CC1OF_POS)                  /*!< 0x00000200 */
#define TIM_SR_CC1OF              TIM_SR_CC1OF_MSK                             /*!<Capture/Compare 1 Overcapture Flag */
#define TIM_SR_CC2OF_POS          (10U)
#define TIM_SR_CC2OF_MSK          (0x1UL << TIM_SR_CC2OF_POS)                  /*!< 0x00000400 */
#define TIM_SR_CC2OF              TIM_SR_CC2OF_MSK                             /*!<Capture/Compare 2 Overcapture Flag */
#define TIM_SR_CC3OF_POS          (11U)
#define TIM_SR_CC3OF_MSK          (0x1UL << TIM_SR_CC3OF_POS)                  /*!< 0x00000800 */
#define TIM_SR_CC3OF              TIM_SR_CC3OF_MSK                             /*!<Capture/Compare 3 Overcapture Flag */
#define TIM_SR_CC4OF_POS          (12U)
#define TIM_SR_CC4OF_MSK          (0x1UL << TIM_SR_CC4OF_POS)                  /*!< 0x00001000 */
#define TIM_SR_CC4OF              TIM_SR_CC4OF_MSK                             /*!<Capture/Compare 4 Overcapture Flag */
#define TIM_SR_SBIF_POS           (13U)
#define TIM_SR_SBIF_MSK           (0x1UL << TIM_SR_SBIF_POS)                   /*!< 0x00002000 */
#define TIM_SR_SBIF               TIM_SR_SBIF_MSK                              /*!<System Break interrupt Flag */
#define TIM_SR_CC5IF_POS          (16U)
#define TIM_SR_CC5IF_MSK          (0x1UL << TIM_SR_CC5IF_POS)                  /*!< 0x00010000 */
#define TIM_SR_CC5IF              TIM_SR_CC5IF_MSK                             /*!<Capture/Compare 5 interrupt Flag */
#define TIM_SR_CC6IF_POS          (17U)
#define TIM_SR_CC6IF_MSK          (0x1UL << TIM_SR_CC6IF_POS)                  /*!< 0x00020000 */
#define TIM_SR_CC6IF              TIM_SR_CC6IF_MSK                             /*!<Capture/Compare 6 interrupt Flag */


/*******************  Bit definition for TIM_EGR register  ********************/
#define TIM_EGR_UG_POS            (0U)
#define TIM_EGR_UG_MSK            (0x1UL << TIM_EGR_UG_POS)                    /*!< 0x00000001 */
#define TIM_EGR_UG                TIM_EGR_UG_MSK                               /*!<Update Generation */
#define TIM_EGR_CC1G_POS          (1U)
#define TIM_EGR_CC1G_MSK          (0x1UL << TIM_EGR_CC1G_POS)                  /*!< 0x00000002 */
#define TIM_EGR_CC1G              TIM_EGR_CC1G_MSK                             /*!<Capture/Compare 1 Generation */
#define TIM_EGR_CC2G_POS          (2U)
#define TIM_EGR_CC2G_MSK          (0x1UL << TIM_EGR_CC2G_POS)                  /*!< 0x00000004 */
#define TIM_EGR_CC2G              TIM_EGR_CC2G_MSK                             /*!<Capture/Compare 2 Generation */
#define TIM_EGR_CC3G_POS          (3U)
#define TIM_EGR_CC3G_MSK          (0x1UL << TIM_EGR_CC3G_POS)                  /*!< 0x00000008 */
#define TIM_EGR_CC3G              TIM_EGR_CC3G_MSK                             /*!<Capture/Compare 3 Generation */
#define TIM_EGR_CC4G_POS          (4U)
#define TIM_EGR_CC4G_MSK          (0x1UL << TIM_EGR_CC4G_POS)                  /*!< 0x00000010 */
#define TIM_EGR_CC4G              TIM_EGR_CC4G_MSK                             /*!<Capture/Compare 4 Generation */
#define TIM_EGR_COMG_POS          (5U)
#define TIM_EGR_COMG_MSK          (0x1UL << TIM_EGR_COMG_POS)                  /*!< 0x00000020 */
#define TIM_EGR_COMG              TIM_EGR_COMG_MSK                             /*!<Capture/Compare Control Update Generation */
#define TIM_EGR_TG_POS            (6U)
#define TIM_EGR_TG_MSK            (0x1UL << TIM_EGR_TG_POS)                    /*!< 0x00000040 */
#define TIM_EGR_TG                TIM_EGR_TG_MSK                               /*!<Trigger Generation */
#define TIM_EGR_BG_POS            (7U)
#define TIM_EGR_BG_MSK            (0x1UL << TIM_EGR_BG_POS)                    /*!< 0x00000080 */
#define TIM_EGR_BG                TIM_EGR_BG_MSK                               /*!<Break Generation */
#define TIM_EGR_B2G_POS           (8U)
#define TIM_EGR_B2G_MSK           (0x1UL << TIM_EGR_B2G_POS)                   /*!< 0x00000100 */
#define TIM_EGR_B2G               TIM_EGR_B2G_MSK                              /*!<Break 2 Generation */


