ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bit definition for TIM_CCMR1 register  *******************/
#define TIM_CCMR1_CC1S_POS        (0U)
#define TIM_CCMR1_CC1S_MSK        (0x3UL << TIM_CCMR1_CC1S_POS)                /*!< 0x00000003 */
#define TIM_CCMR1_CC1S            TIM_CCMR1_CC1S_MSK                           /*!<CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TIM_CCMR1_CC1S_0          (0x1UL << TIM_CCMR1_CC1S_POS)                /*!< 0x00000001 */
#define TIM_CCMR1_CC1S_1          (0x2UL << TIM_CCMR1_CC1S_POS)                /*!< 0x00000002 */

#define TIM_CCMR1_OC1FE_POS       (2U)
#define TIM_CCMR1_OC1FE_MSK       (0x1UL << TIM_CCMR1_OC1FE_POS)               /*!< 0x00000004 */
#define TIM_CCMR1_OC1FE           TIM_CCMR1_OC1FE_MSK                          /*!<Output Compare 1 Fast enable */
#define TIM_CCMR1_OC1PE_POS       (3U)
#define TIM_CCMR1_OC1PE_MSK       (0x1UL << TIM_CCMR1_OC1PE_POS)               /*!< 0x00000008 */
#define TIM_CCMR1_OC1PE           TIM_CCMR1_OC1PE_MSK                          /*!<Output Compare 1 Preload enable */

#define TIM_CCMR1_OC1M_POS        (4U)
#define TIM_CCMR1_OC1M_MSK        (0x1007UL << TIM_CCMR1_OC1M_POS)             /*!< 0x00010070 */
#define TIM_CCMR1_OC1M            TIM_CCMR1_OC1M_MSK                           /*!<OC1M[2:0] bits (Output Compare 1 Mode) */
#define TIM_CCMR1_OC1M_0          (0x0001UL << TIM_CCMR1_OC1M_POS)             /*!< 0x00000010 */
#define TIM_CCMR1_OC1M_1          (0x0002UL << TIM_CCMR1_OC1M_POS)             /*!< 0x00000020 */
#define TIM_CCMR1_OC1M_2          (0x0004UL << TIM_CCMR1_OC1M_POS)             /*!< 0x00000040 */
#define TIM_CCMR1_OC1M_3          (0x1000UL << TIM_CCMR1_OC1M_POS)             /*!< 0x00010000 */

#define TIM_CCMR1_OC1CE_POS       (7U)
#define TIM_CCMR1_OC1CE_MSK       (0x1UL << TIM_CCMR1_OC1CE_POS)               /*!< 0x00000080 */
#define TIM_CCMR1_OC1CE           TIM_CCMR1_OC1CE_MSK                          /*!<Output Compare 1 Clear Enable */

#define TIM_CCMR1_CC2S_POS        (8U)
#define TIM_CCMR1_CC2S_MSK        (0x3UL << TIM_CCMR1_CC2S_POS)                /*!< 0x00000300 */
#define TIM_CCMR1_CC2S            TIM_CCMR1_CC2S_MSK                           /*!<CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TIM_CCMR1_CC2S_0          (0x1UL << TIM_CCMR1_CC2S_POS)                /*!< 0x00000100 */
#define TIM_CCMR1_CC2S_1          (0x2UL << TIM_CCMR1_CC2S_POS)                /*!< 0x00000200 */

#define TIM_CCMR1_OC2FE_POS       (10U)
#define TIM_CCMR1_OC2FE_MSK       (0x1UL << TIM_CCMR1_OC2FE_POS)               /*!< 0x00000400 */
#define TIM_CCMR1_OC2FE           TIM_CCMR1_OC2FE_MSK                          /*!<Output Compare 2 Fast enable */
#define TIM_CCMR1_OC2PE_POS       (11U)
#define TIM_CCMR1_OC2PE_MSK       (0x1UL << TIM_CCMR1_OC2PE_POS)               /*!< 0x00000800 */
#define TIM_CCMR1_OC2PE           TIM_CCMR1_OC2PE_MSK                          /*!<Output Compare 2 Preload enable */

#define TIM_CCMR1_OC2M_POS        (12U)
#define TIM_CCMR1_OC2M_MSK        (0x1007UL << TIM_CCMR1_OC2M_POS)             /*!< 0x01007000 */
#define TIM_CCMR1_OC2M            TIM_CCMR1_OC2M_MSK                           /*!<OC2M[2:0] bits (Output Compare 2 Mode) */
#define TIM_CCMR1_OC2M_0          (0x0001UL << TIM_CCMR1_OC2M_POS)             /*!< 0x00001000 */
#define TIM_CCMR1_OC2M_1          (0x0002UL << TIM_CCMR1_OC2M_POS)             /*!< 0x00002000 */
#define TIM_CCMR1_OC2M_2          (0x0004UL << TIM_CCMR1_OC2M_POS)             /*!< 0x00004000 */
#define TIM_CCMR1_OC2M_3          (0x1000UL << TIM_CCMR1_OC2M_POS)             /*!< 0x01000000 */

#define TIM_CCMR1_OC2CE_POS       (15U)
#define TIM_CCMR1_OC2CE_MSK       (0x1UL << TIM_CCMR1_OC2CE_POS)               /*!< 0x00008000 */
#define TIM_CCMR1_OC2CE           TIM_CCMR1_OC2CE_MSK                          /*!<Output Compare 2 Clear Enable */

/*----------------------------------------------------------------------------*/
#define TIM_CCMR1_IC1PSC_POS      (2U)
#define TIM_CCMR1_IC1PSC_MSK      (0x3UL << TIM_CCMR1_IC1PSC_POS)              /*!< 0x0000000C */
#define TIM_CCMR1_IC1PSC          TIM_CCMR1_IC1PSC_MSK                         /*!<IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TIM_CCMR1_IC1PSC_0        (0x1UL << TIM_CCMR1_IC1PSC_POS)              /*!< 0x00000004 */
#define TIM_CCMR1_IC1PSC_1        (0x2UL << TIM_CCMR1_IC1PSC_POS)              /*!< 0x00000008 */

#define TIM_CCMR1_IC1F_POS        (4U)
#define TIM_CCMR1_IC1F_MSK        (0xFUL << TIM_CCMR1_IC1F_POS)                /*!< 0x000000F0 */
#define TIM_CCMR1_IC1F            TIM_CCMR1_IC1F_MSK                           /*!<IC1F[3:0] bits (Input Capture 1 Filter) */
#define TIM_CCMR1_IC1F_0          (0x1UL << TIM_CCMR1_IC1F_POS)                /*!< 0x00000010 */
#define TIM_CCMR1_IC1F_1          (0x2UL << TIM_CCMR1_IC1F_POS)                /*!< 0x00000020 */
#define TIM_CCMR1_IC1F_2          (0x4UL << TIM_CCMR1_IC1F_POS)                /*!< 0x00000040 */
#define TIM_CCMR1_IC1F_3          (0x8UL << TIM_CCMR1_IC1F_POS)                /*!< 0x00000080 */

#define TIM_CCMR1_IC2PSC_POS      (10U)
#define TIM_CCMR1_IC2PSC_MSK      (0x3UL << TIM_CCMR1_IC2PSC_POS)              /*!< 0x00000C00 */
#define TIM_CCMR1_IC2PSC          TIM_CCMR1_IC2PSC_MSK                         /*!<IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define TIM_CCMR1_IC2PSC_0        (0x1UL << TIM_CCMR1_IC2PSC_POS)              /*!< 0x00000400 */
#define TIM_CCMR1_IC2PSC_1        (0x2UL << TIM_CCMR1_IC2PSC_POS)              /*!< 0x00000800 */

#define TIM_CCMR1_IC2F_POS        (12U)
#define TIM_CCMR1_IC2F_MSK        (0xFUL << TIM_CCMR1_IC2F_POS)                /*!< 0x0000F000 */
#define TIM_CCMR1_IC2F            TIM_CCMR1_IC2F_MSK                           /*!<IC2F[3:0] bits (Input Capture 2 Filter) */
#define TIM_CCMR1_IC2F_0          (0x1UL << TIM_CCMR1_IC2F_POS)                /*!< 0x00001000 */
#define TIM_CCMR1_IC2F_1          (0x2UL << TIM_CCMR1_IC2F_POS)                /*!< 0x00002000 */
#define TIM_CCMR1_IC2F_2          (0x4UL << TIM_CCMR1_IC2F_POS)                /*!< 0x00004000 */
#define TIM_CCMR1_IC2F_3          (0x8UL << TIM_CCMR1_IC2F_POS)                /*!< 0x00008000 */

/******************  Bit definition for TIM_CCMR2 register  *******************/
#define TIM_CCMR2_CC3S_POS        (0U)
#define TIM_CCMR2_CC3S_MSK        (0x3UL << TIM_CCMR2_CC3S_POS)                /*!< 0x00000003 */
#define TIM_CCMR2_CC3S            TIM_CCMR2_CC3S_MSK                           /*!<CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define TIM_CCMR2_CC3S_0          (0x1UL << TIM_CCMR2_CC3S_POS)                /*!< 0x00000001 */
#define TIM_CCMR2_CC3S_1          (0x2UL << TIM_CCMR2_CC3S_POS)                /*!< 0x00000002 */

#define TIM_CCMR2_OC3FE_POS       (2U)
#define TIM_CCMR2_OC3FE_MSK       (0x1UL << TIM_CCMR2_OC3FE_POS)               /*!< 0x00000004 */
#define TIM_CCMR2_OC3FE           TIM_CCMR2_OC3FE_MSK                          /*!<Output Compare 3 Fast enable */
#define TIM_CCMR2_OC3PE_POS       (3U)
#define TIM_CCMR2_OC3PE_MSK       (0x1UL << TIM_CCMR2_OC3PE_POS)               /*!< 0x00000008 */
#define TIM_CCMR2_OC3PE           TIM_CCMR2_OC3PE_MSK                          /*!<Output Compare 3 Preload enable */

#define TIM_CCMR2_OC3M_POS        (4U)
#define TIM_CCMR2_OC3M_MSK        (0x1007UL << TIM_CCMR2_OC3M_POS)             /*!< 0x00010070 */
#define TIM_CCMR2_OC3M            TIM_CCMR2_OC3M_MSK                           /*!<OC3M[2:0] bits (Output Compare 3 Mode) */
#define TIM_CCMR2_OC3M_0          (0x0001UL << TIM_CCMR2_OC3M_POS)             /*!< 0x00000010 */
#define TIM_CCMR2_OC3M_1          (0x0002UL << TIM_CCMR2_OC3M_POS)             /*!< 0x00000020 */
#define TIM_CCMR2_OC3M_2          (0x0004UL << TIM_CCMR2_OC3M_POS)             /*!< 0x00000040 */
#define TIM_CCMR2_OC3M_3          (0x1000UL << TIM_CCMR2_OC3M_POS)             /*!< 0x00010000 */

