ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define TIM_CCMR2_OC3CE_POS       (7U)
#define TIM_CCMR2_OC3CE_MSK       (0x1UL << TIM_CCMR2_OC3CE_POS)               /*!< 0x00000080 */
#define TIM_CCMR2_OC3CE           TIM_CCMR2_OC3CE_MSK                          /*!<Output Compare 3 Clear Enable */

#define TIM_CCMR2_CC4S_POS        (8U)
#define TIM_CCMR2_CC4S_MSK        (0x3UL << TIM_CCMR2_CC4S_POS)                /*!< 0x00000300 */
#define TIM_CCMR2_CC4S            TIM_CCMR2_CC4S_MSK                           /*!<CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define TIM_CCMR2_CC4S_0          (0x1UL << TIM_CCMR2_CC4S_POS)                /*!< 0x00000100 */
#define TIM_CCMR2_CC4S_1          (0x2UL << TIM_CCMR2_CC4S_POS)                /*!< 0x00000200 */

#define TIM_CCMR2_OC4FE_POS       (10U)
#define TIM_CCMR2_OC4FE_MSK       (0x1UL << TIM_CCMR2_OC4FE_POS)               /*!< 0x00000400 */
#define TIM_CCMR2_OC4FE           TIM_CCMR2_OC4FE_MSK                          /*!<Output Compare 4 Fast enable */
#define TIM_CCMR2_OC4PE_POS       (11U)
#define TIM_CCMR2_OC4PE_MSK       (0x1UL << TIM_CCMR2_OC4PE_POS)               /*!< 0x00000800 */
#define TIM_CCMR2_OC4PE           TIM_CCMR2_OC4PE_MSK                          /*!<Output Compare 4 Preload enable */

#define TIM_CCMR2_OC4M_POS        (12U)
#define TIM_CCMR2_OC4M_MSK        (0x1007UL << TIM_CCMR2_OC4M_POS)             /*!< 0x01007000 */
#define TIM_CCMR2_OC4M            TIM_CCMR2_OC4M_MSK                           /*!<OC4M[2:0] bits (Output Compare 4 Mode) */
#define TIM_CCMR2_OC4M_0          (0x0001UL << TIM_CCMR2_OC4M_POS)             /*!< 0x00001000 */
#define TIM_CCMR2_OC4M_1          (0x0002UL << TIM_CCMR2_OC4M_POS)             /*!< 0x00002000 */
#define TIM_CCMR2_OC4M_2          (0x0004UL << TIM_CCMR2_OC4M_POS)             /*!< 0x00004000 */
#define TIM_CCMR2_OC4M_3          (0x1000UL << TIM_CCMR2_OC4M_POS)             /*!< 0x01000000 */

#define TIM_CCMR2_OC4CE_POS       (15U)
#define TIM_CCMR2_OC4CE_MSK       (0x1UL << TIM_CCMR2_OC4CE_POS)               /*!< 0x00008000 */
#define TIM_CCMR2_OC4CE           TIM_CCMR2_OC4CE_MSK                          /*!<Output Compare 4 Clear Enable */

/*----------------------------------------------------------------------------*/
#define TIM_CCMR2_IC3PSC_POS      (2U)
#define TIM_CCMR2_IC3PSC_MSK      (0x3UL << TIM_CCMR2_IC3PSC_POS)              /*!< 0x0000000C */
#define TIM_CCMR2_IC3PSC          TIM_CCMR2_IC3PSC_MSK                         /*!<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define TIM_CCMR2_IC3PSC_0        (0x1UL << TIM_CCMR2_IC3PSC_POS)              /*!< 0x00000004 */
#define TIM_CCMR2_IC3PSC_1        (0x2UL << TIM_CCMR2_IC3PSC_POS)              /*!< 0x00000008 */

#define TIM_CCMR2_IC3F_POS        (4U)
#define TIM_CCMR2_IC3F_MSK        (0xFUL << TIM_CCMR2_IC3F_POS)                /*!< 0x000000F0 */
#define TIM_CCMR2_IC3F            TIM_CCMR2_IC3F_MSK                           /*!<IC3F[3:0] bits (Input Capture 3 Filter) */
#define TIM_CCMR2_IC3F_0          (0x1UL << TIM_CCMR2_IC3F_POS)                /*!< 0x00000010 */
#define TIM_CCMR2_IC3F_1          (0x2UL << TIM_CCMR2_IC3F_POS)                /*!< 0x00000020 */
#define TIM_CCMR2_IC3F_2          (0x4UL << TIM_CCMR2_IC3F_POS)                /*!< 0x00000040 */
#define TIM_CCMR2_IC3F_3          (0x8UL << TIM_CCMR2_IC3F_POS)                /*!< 0x00000080 */

#define TIM_CCMR2_IC4PSC_POS      (10U)
#define TIM_CCMR2_IC4PSC_MSK      (0x3UL << TIM_CCMR2_IC4PSC_POS)              /*!< 0x00000C00 */
#define TIM_CCMR2_IC4PSC          TIM_CCMR2_IC4PSC_MSK                         /*!<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define TIM_CCMR2_IC4PSC_0        (0x1UL << TIM_CCMR2_IC4PSC_POS)              /*!< 0x00000400 */
#define TIM_CCMR2_IC4PSC_1        (0x2UL << TIM_CCMR2_IC4PSC_POS)              /*!< 0x00000800 */

#define TIM_CCMR2_IC4F_POS        (12U)
#define TIM_CCMR2_IC4F_MSK        (0xFUL << TIM_CCMR2_IC4F_POS)                /*!< 0x0000F000 */
#define TIM_CCMR2_IC4F            TIM_CCMR2_IC4F_MSK                           /*!<IC4F[3:0] bits (Input Capture 4 Filter) */
#define TIM_CCMR2_IC4F_0          (0x1UL << TIM_CCMR2_IC4F_POS)                /*!< 0x00001000 */
#define TIM_CCMR2_IC4F_1          (0x2UL << TIM_CCMR2_IC4F_POS)                /*!< 0x00002000 */
#define TIM_CCMR2_IC4F_2          (0x4UL << TIM_CCMR2_IC4F_POS)                /*!< 0x00004000 */
#define TIM_CCMR2_IC4F_3          (0x8UL << TIM_CCMR2_IC4F_POS)                /*!< 0x00008000 */

/******************  Bit definition for TIM_CCMR3 register  *******************/
#define TIM_CCMR3_OC5FE_POS       (2U)
#define TIM_CCMR3_OC5FE_MSK       (0x1UL << TIM_CCMR3_OC5FE_POS)               /*!< 0x00000004 */
#define TIM_CCMR3_OC5FE           TIM_CCMR3_OC5FE_MSK                          /*!<Output Compare 5 Fast enable */
#define TIM_CCMR3_OC5PE_POS       (3U)
#define TIM_CCMR3_OC5PE_MSK       (0x1UL << TIM_CCMR3_OC5PE_POS)               /*!< 0x00000008 */
#define TIM_CCMR3_OC5PE           TIM_CCMR3_OC5PE_MSK                          /*!<Output Compare 5 Preload enable */

#define TIM_CCMR3_OC5M_POS        (4U)
#define TIM_CCMR3_OC5M_MSK        (0x1007UL << TIM_CCMR3_OC5M_POS)             /*!< 0x00010070 */
#define TIM_CCMR3_OC5M            TIM_CCMR3_OC5M_MSK                           /*!<OC5M[3:0] bits (Output Compare 5 Mode) */
#define TIM_CCMR3_OC5M_0          (0x0001UL << TIM_CCMR3_OC5M_POS)             /*!< 0x00000010 */
#define TIM_CCMR3_OC5M_1          (0x0002UL << TIM_CCMR3_OC5M_POS)             /*!< 0x00000020 */
#define TIM_CCMR3_OC5M_2          (0x0004UL << TIM_CCMR3_OC5M_POS)             /*!< 0x00000040 */
#define TIM_CCMR3_OC5M_3          (0x1000UL << TIM_CCMR3_OC5M_POS)             /*!< 0x00010000 */

#define TIM_CCMR3_OC5CE_POS       (7U)
#define TIM_CCMR3_OC5CE_MSK       (0x1UL << TIM_CCMR3_OC5CE_POS)               /*!< 0x00000080 */
#define TIM_CCMR3_OC5CE           TIM_CCMR3_OC5CE_MSK                          /*!<Output Compare 5 Clear Enable */

#define TIM_CCMR3_OC6FE_POS       (10U)
#define TIM_CCMR3_OC6FE_MSK       (0x1UL << TIM_CCMR3_OC6FE_POS)               /*!< 0x00000400 */
#define TIM_CCMR3_OC6FE           TIM_CCMR3_OC6FE_MSK                          /*!<Output Compare 6 Fast enable */
#define TIM_CCMR3_OC6PE_POS       (11U)
#define TIM_CCMR3_OC6PE_MSK       (0x1UL << TIM_CCMR3_OC6PE_POS)               /*!< 0x00000800 */
#define TIM_CCMR3_OC6PE           TIM_CCMR3_OC6PE_MSK                          /*!<Output Compare 6 Preload enable */

