ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define TIM_CCMR3_OC6M_POS        (12U)
#define TIM_CCMR3_OC6M_MSK        (0x1007UL << TIM_CCMR3_OC6M_POS)             /*!< 0x01007000 */
#define TIM_CCMR3_OC6M            TIM_CCMR3_OC6M_MSK                           /*!<OC6M[3:0] bits (Output Compare 6 Mode) */
#define TIM_CCMR3_OC6M_0          (0x0001UL << TIM_CCMR3_OC6M_POS)             /*!< 0x00001000 */
#define TIM_CCMR3_OC6M_1          (0x0002UL << TIM_CCMR3_OC6M_POS)             /*!< 0x00002000 */
#define TIM_CCMR3_OC6M_2          (0x0004UL << TIM_CCMR3_OC6M_POS)             /*!< 0x00004000 */
#define TIM_CCMR3_OC6M_3          (0x1000UL << TIM_CCMR3_OC6M_POS)             /*!< 0x01000000 */

#define TIM_CCMR3_OC6CE_POS       (15U)
#define TIM_CCMR3_OC6CE_MSK       (0x1UL << TIM_CCMR3_OC6CE_POS)               /*!< 0x00008000 */
#define TIM_CCMR3_OC6CE           TIM_CCMR3_OC6CE_MSK                          /*!<Output Compare 6 Clear Enable */

/*******************  Bit definition for TIM_CCER register  *******************/
#define TIM_CCER_CC1E_POS         (0U)
#define TIM_CCER_CC1E_MSK         (0x1UL << TIM_CCER_CC1E_POS)                 /*!< 0x00000001 */
#define TIM_CCER_CC1E             TIM_CCER_CC1E_MSK                            /*!<Capture/Compare 1 output enable */
#define TIM_CCER_CC1P_POS         (1U)
#define TIM_CCER_CC1P_MSK         (0x1UL << TIM_CCER_CC1P_POS)                 /*!< 0x00000002 */
#define TIM_CCER_CC1P             TIM_CCER_CC1P_MSK                            /*!<Capture/Compare 1 output Polarity */
#define TIM_CCER_CC1NE_POS        (2U)
#define TIM_CCER_CC1NE_MSK        (0x1UL << TIM_CCER_CC1NE_POS)                /*!< 0x00000004 */
#define TIM_CCER_CC1NE            TIM_CCER_CC1NE_MSK                           /*!<Capture/Compare 1 Complementary output enable */
#define TIM_CCER_CC1NP_POS        (3U)
#define TIM_CCER_CC1NP_MSK        (0x1UL << TIM_CCER_CC1NP_POS)                /*!< 0x00000008 */
#define TIM_CCER_CC1NP            TIM_CCER_CC1NP_MSK                           /*!<Capture/Compare 1 Complementary output Polarity */
#define TIM_CCER_CC2E_POS         (4U)
#define TIM_CCER_CC2E_MSK         (0x1UL << TIM_CCER_CC2E_POS)                 /*!< 0x00000010 */
#define TIM_CCER_CC2E             TIM_CCER_CC2E_MSK                            /*!<Capture/Compare 2 output enable */
#define TIM_CCER_CC2P_POS         (5U)
#define TIM_CCER_CC2P_MSK         (0x1UL << TIM_CCER_CC2P_POS)                 /*!< 0x00000020 */
#define TIM_CCER_CC2P             TIM_CCER_CC2P_MSK                            /*!<Capture/Compare 2 output Polarity */
#define TIM_CCER_CC2NE_POS        (6U)
#define TIM_CCER_CC2NE_MSK        (0x1UL << TIM_CCER_CC2NE_POS)                /*!< 0x00000040 */
#define TIM_CCER_CC2NE            TIM_CCER_CC2NE_MSK                           /*!<Capture/Compare 2 Complementary output enable */
#define TIM_CCER_CC2NP_POS        (7U)
#define TIM_CCER_CC2NP_MSK        (0x1UL << TIM_CCER_CC2NP_POS)                /*!< 0x00000080 */
#define TIM_CCER_CC2NP            TIM_CCER_CC2NP_MSK                           /*!<Capture/Compare 2 Complementary output Polarity */
#define TIM_CCER_CC3E_POS         (8U)
#define TIM_CCER_CC3E_MSK         (0x1UL << TIM_CCER_CC3E_POS)                 /*!< 0x00000100 */
#define TIM_CCER_CC3E             TIM_CCER_CC3E_MSK                            /*!<Capture/Compare 3 output enable */
#define TIM_CCER_CC3P_POS         (9U)
#define TIM_CCER_CC3P_MSK         (0x1UL << TIM_CCER_CC3P_POS)                 /*!< 0x00000200 */
#define TIM_CCER_CC3P             TIM_CCER_CC3P_MSK                            /*!<Capture/Compare 3 output Polarity */
#define TIM_CCER_CC3NE_POS        (10U)
#define TIM_CCER_CC3NE_MSK        (0x1UL << TIM_CCER_CC3NE_POS)                /*!< 0x00000400 */
#define TIM_CCER_CC3NE            TIM_CCER_CC3NE_MSK                           /*!<Capture/Compare 3 Complementary output enable */
#define TIM_CCER_CC3NP_POS        (11U)
#define TIM_CCER_CC3NP_MSK        (0x1UL << TIM_CCER_CC3NP_POS)                /*!< 0x00000800 */
#define TIM_CCER_CC3NP            TIM_CCER_CC3NP_MSK                           /*!<Capture/Compare 3 Complementary output Polarity */
#define TIM_CCER_CC4E_POS         (12U)
#define TIM_CCER_CC4E_MSK         (0x1UL << TIM_CCER_CC4E_POS)                 /*!< 0x00001000 */
#define TIM_CCER_CC4E             TIM_CCER_CC4E_MSK                            /*!<Capture/Compare 4 output enable */
#define TIM_CCER_CC4P_POS         (13U)
#define TIM_CCER_CC4P_MSK         (0x1UL << TIM_CCER_CC4P_POS)                 /*!< 0x00002000 */
#define TIM_CCER_CC4P             TIM_CCER_CC4P_MSK                            /*!<Capture/Compare 4 output Polarity */
#define TIM_CCER_CC4NP_POS        (15U)
#define TIM_CCER_CC4NP_MSK        (0x1UL << TIM_CCER_CC4NP_POS)                /*!< 0x00008000 */
#define TIM_CCER_CC4NP            TIM_CCER_CC4NP_MSK                           /*!<Capture/Compare 4 Complementary output Polarity */
#define TIM_CCER_CC5E_POS         (16U)
#define TIM_CCER_CC5E_MSK         (0x1UL << TIM_CCER_CC5E_POS)                 /*!< 0x00010000 */
#define TIM_CCER_CC5E             TIM_CCER_CC5E_MSK                            /*!<Capture/Compare 5 output enable */
#define TIM_CCER_CC5P_POS         (17U)
#define TIM_CCER_CC5P_MSK         (0x1UL << TIM_CCER_CC5P_POS)                 /*!< 0x00020000 */
#define TIM_CCER_CC5P             TIM_CCER_CC5P_MSK                            /*!<Capture/Compare 5 output Polarity */
#define TIM_CCER_CC6E_POS         (20U)
#define TIM_CCER_CC6E_MSK         (0x1UL << TIM_CCER_CC6E_POS)                 /*!< 0x00100000 */
#define TIM_CCER_CC6E             TIM_CCER_CC6E_MSK                            /*!<Capture/Compare 6 output enable */
#define TIM_CCER_CC6P_POS         (21U)
#define TIM_CCER_CC6P_MSK         (0x1UL << TIM_CCER_CC6P_POS)                 /*!< 0x00200000 */
#define TIM_CCER_CC6P             TIM_CCER_CC6P_MSK                            /*!<Capture/Compare 6 output Polarity */

/*******************  Bit definition for TIM_CNT register  ********************/
#define TIM_CNT_CNT_POS           (0U)
#define TIM_CNT_CNT_MSK           (0xFFFFFFFFUL << TIM_CNT_CNT_POS)            /*!< 0xFFFFFFFF */
#define TIM_CNT_CNT               TIM_CNT_CNT_MSK                              /*!<Counter Value */
#define TIM_CNT_UIFCPY_POS        (31U)
#define TIM_CNT_UIFCPY_MSK        (0x1UL << TIM_CNT_UIFCPY_POS)                /*!< 0x80000000 */
#define TIM_CNT_UIFCPY            TIM_CNT_UIFCPY_MSK                           /*!<Update interrupt flag copy (if UIFREMAP=1) */

/*******************  Bit definition for TIM_PSC register  ********************/
#define TIM_PSC_PSC_POS           (0U)
#define TIM_PSC_PSC_MSK           (0xFFFFUL << TIM_PSC_PSC_POS)                /*!< 0x0000FFFF */
#define TIM_PSC_PSC               TIM_PSC_PSC_MSK                              /*!<Prescaler Value */

/*******************  Bit definition for TIM_ARR register  ********************/
#define TIM_ARR_ARR_POS           (0U)
#define TIM_ARR_ARR_MSK           (0xFFFFFFFFUL << TIM_ARR_ARR_POS)            /*!< 0xFFFFFFFF */
#define TIM_ARR_ARR               TIM_ARR_ARR_MSK                              /*!<Actual auto-reload Value */

/*******************  Bit definition for TIM_RCR register  ********************/
#define TIM_RCR_REP_POS           (0U)
#define TIM_RCR_REP_MSK           (0xFFFFUL << TIM_RCR_REP_POS)                /*!< 0x0000FFFF */
#define TIM_RCR_REP               TIM_RCR_REP_MSK                              /*!<Repetition Counter Value */

/*******************  Bit definition for TIM_CCR1 register  *******************/
#define TIM_CCR1_CCR1_POS         (0U)
#define TIM_CCR1_CCR1_MSK         (0xFFFFUL << TIM_CCR1_CCR1_POS)              /*!< 0x0000FFFF */
#define TIM_CCR1_CCR1             TIM_CCR1_CCR1_MSK                            /*!<Capture/Compare 1 Value */

/*******************  Bit definition for TIM_CCR2 register  *******************/
#define TIM_CCR2_CCR2_POS         (0U)
#define TIM_CCR2_CCR2_MSK         (0xFFFFUL << TIM_CCR2_CCR2_POS)              /*!< 0x0000FFFF */
#define TIM_CCR2_CCR2             TIM_CCR2_CCR2_MSK                            /*!<Capture/Compare 2 Value */

/*******************  Bit definition for TIM_CCR3 register  *******************/
#define TIM_CCR3_CCR3_POS         (0U)
#define TIM_CCR3_CCR3_MSK         (0xFFFFUL << TIM_CCR3_CCR3_POS)              /*!< 0x0000FFFF */
#define TIM_CCR3_CCR3             TIM_CCR3_CCR3_MSK                            /*!<Capture/Compare 3 Value */

/*******************  Bit definition for TIM_CCR4 register  *******************/
#define TIM_CCR4_CCR4_POS         (0U)
#define TIM_CCR4_CCR4_MSK         (0xFFFFUL << TIM_CCR4_CCR4_POS)              /*!< 0x0000FFFF */
#define TIM_CCR4_CCR4             TIM_CCR4_CCR4_MSK                            /*!<Capture/Compare 4 Value */

