ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for TIM_CCR5 register  *******************/
#define TIM_CCR5_CCR5_POS         (0U)
#define TIM_CCR5_CCR5_MSK         (0xFFFFFFFFUL << TIM_CCR5_CCR5_POS)          /*!< 0xFFFFFFFF */
#define TIM_CCR5_CCR5             TIM_CCR5_CCR5_MSK                            /*!<Capture/Compare 5 Value */
#define TIM_CCR5_GC5C1_POS        (29U)
#define TIM_CCR5_GC5C1_MSK        (0x1UL << TIM_CCR5_GC5C1_POS)                /*!< 0x20000000 */
#define TIM_CCR5_GC5C1            TIM_CCR5_GC5C1_MSK                           /*!<Group CHANNEL 5 and CHANNEL 1 */
#define TIM_CCR5_GC5C2_POS        (30U)
#define TIM_CCR5_GC5C2_MSK        (0x1UL << TIM_CCR5_GC5C2_POS)                /*!< 0x40000000 */
#define TIM_CCR5_GC5C2            TIM_CCR5_GC5C2_MSK                           /*!<Group CHANNEL 5 and CHANNEL 2 */
#define TIM_CCR5_GC5C3_POS        (31U)
#define TIM_CCR5_GC5C3_MSK        (0x1UL << TIM_CCR5_GC5C3_POS)                /*!< 0x80000000 */
#define TIM_CCR5_GC5C3            TIM_CCR5_GC5C3_MSK                           /*!<Group CHANNEL 5 and CHANNEL 3 */

/*******************  Bit definition for TIM_CCR6 register  *******************/
#define TIM_CCR6_CCR6_POS         (0U)
#define TIM_CCR6_CCR6_MSK         (0xFFFFUL << TIM_CCR6_CCR6_POS)              /*!< 0x0000FFFF */
#define TIM_CCR6_CCR6             TIM_CCR6_CCR6_MSK                            /*!<Capture/Compare 6 Value */

/*******************  Bit definition for TIM_BDTR register  *******************/
#define TIM_BDTR_DTG_POS          (0U)
#define TIM_BDTR_DTG_MSK          (0xFFUL << TIM_BDTR_DTG_POS)                 /*!< 0x000000FF */
#define TIM_BDTR_DTG              TIM_BDTR_DTG_MSK                             /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define TIM_BDTR_DTG_0            (0x01UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000001 */
#define TIM_BDTR_DTG_1            (0x02UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000002 */
#define TIM_BDTR_DTG_2            (0x04UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000004 */
#define TIM_BDTR_DTG_3            (0x08UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000008 */
#define TIM_BDTR_DTG_4            (0x10UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000010 */
#define TIM_BDTR_DTG_5            (0x20UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000020 */
#define TIM_BDTR_DTG_6            (0x40UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000040 */
#define TIM_BDTR_DTG_7            (0x80UL << TIM_BDTR_DTG_POS)                 /*!< 0x00000080 */

#define TIM_BDTR_LOCK_POS         (8U)
#define TIM_BDTR_LOCK_MSK         (0x3UL << TIM_BDTR_LOCK_POS)                 /*!< 0x00000300 */
#define TIM_BDTR_LOCK             TIM_BDTR_LOCK_MSK                            /*!<LOCK[1:0] bits (Lock Configuration) */
#define TIM_BDTR_LOCK_0           (0x1UL << TIM_BDTR_LOCK_POS)                 /*!< 0x00000100 */
#define TIM_BDTR_LOCK_1           (0x2UL << TIM_BDTR_LOCK_POS)                 /*!< 0x00000200 */

#define TIM_BDTR_OSSI_POS         (10U)
#define TIM_BDTR_OSSI_MSK         (0x1UL << TIM_BDTR_OSSI_POS)                 /*!< 0x00000400 */
#define TIM_BDTR_OSSI             TIM_BDTR_OSSI_MSK                            /*!<Off-State Selection for Idle mode */
#define TIM_BDTR_OSSR_POS         (11U)
#define TIM_BDTR_OSSR_MSK         (0x1UL << TIM_BDTR_OSSR_POS)                 /*!< 0x00000800 */
#define TIM_BDTR_OSSR             TIM_BDTR_OSSR_MSK                            /*!<Off-State Selection for Run mode */
#define TIM_BDTR_BKE_POS          (12U)
#define TIM_BDTR_BKE_MSK          (0x1UL << TIM_BDTR_BKE_POS)                  /*!< 0x00001000 */
#define TIM_BDTR_BKE              TIM_BDTR_BKE_MSK                             /*!<Break enable for Break 1 */
#define TIM_BDTR_BKP_POS          (13U)
#define TIM_BDTR_BKP_MSK          (0x1UL << TIM_BDTR_BKP_POS)                  /*!< 0x00002000 */
#define TIM_BDTR_BKP              TIM_BDTR_BKP_MSK                             /*!<Break Polarity for Break 1 */
#define TIM_BDTR_AOE_POS          (14U)
#define TIM_BDTR_AOE_MSK          (0x1UL << TIM_BDTR_AOE_POS)                  /*!< 0x00004000 */
#define TIM_BDTR_AOE              TIM_BDTR_AOE_MSK                             /*!<Automatic Output enable */
#define TIM_BDTR_MOE_POS          (15U)
#define TIM_BDTR_MOE_MSK          (0x1UL << TIM_BDTR_MOE_POS)                  /*!< 0x00008000 */
#define TIM_BDTR_MOE              TIM_BDTR_MOE_MSK                             /*!<Main Output enable */

#define TIM_BDTR_BKF_POS          (16U)
#define TIM_BDTR_BKF_MSK          (0xFUL << TIM_BDTR_BKF_POS)                  /*!< 0x000F0000 */
#define TIM_BDTR_BKF              TIM_BDTR_BKF_MSK                             /*!<Break Filter for Break 1 */
#define TIM_BDTR_BK2F_POS         (20U)
#define TIM_BDTR_BK2F_MSK         (0xFUL << TIM_BDTR_BK2F_POS)                 /*!< 0x00F00000 */
#define TIM_BDTR_BK2F             TIM_BDTR_BK2F_MSK                            /*!<Break Filter for Break 2 */

#define TIM_BDTR_BK2E_POS         (24U)
#define TIM_BDTR_BK2E_MSK         (0x1UL << TIM_BDTR_BK2E_POS)                 /*!< 0x01000000 */
#define TIM_BDTR_BK2E             TIM_BDTR_BK2E_MSK                            /*!<Break enable for Break 2 */
#define TIM_BDTR_BK2P_POS         (25U)
#define TIM_BDTR_BK2P_MSK         (0x1UL << TIM_BDTR_BK2P_POS)                 /*!< 0x02000000 */
#define TIM_BDTR_BK2P             TIM_BDTR_BK2P_MSK                            /*!<Break Polarity for Break 2 */

#define TIM_BDTR_BKDSRM_POS       (26U)
#define TIM_BDTR_BKDSRM_MSK       (0x1UL << TIM_BDTR_BKDSRM_POS)               /*!< 0x04000000 */
#define TIM_BDTR_BKDSRM           TIM_BDTR_BKDSRM_MSK                          /*!<Break disarming/re-arming */
#define TIM_BDTR_BK2DSRM_POS      (27U)
#define TIM_BDTR_BK2DSRM_MSK      (0x1UL << TIM_BDTR_BK2DSRM_POS)              /*!< 0x08000000 */
#define TIM_BDTR_BK2DSRM          TIM_BDTR_BK2DSRM_MSK                         /*!<Break2 disarming/re-arming */

