ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define TIM_BDTR_BKBID_POS        (28U)
#define TIM_BDTR_BKBID_MSK        (0x1UL << TIM_BDTR_BKBID_POS)                /*!< 0x10000000 */
#define TIM_BDTR_BKBID            TIM_BDTR_BKBID_MSK                           /*!<Break BIDirectional */
#define TIM_BDTR_BK2BID_POS       (29U)
#define TIM_BDTR_BK2BID_MSK       (0x1UL << TIM_BDTR_BK2BID_POS)               /*!< 0x20000000 */
#define TIM_BDTR_BK2BID           TIM_BDTR_BK2BID_MSK                          /*!<Break2 BIDirectional */

/*******************  Bit definition for TIM_DCR register  ********************/
#define TIM_DCR_DBA_POS           (0U)
#define TIM_DCR_DBA_MSK           (0x1FUL << TIM_DCR_DBA_POS)                  /*!< 0x0000001F */
#define TIM_DCR_DBA               TIM_DCR_DBA_MSK                              /*!<DBA[4:0] bits (DMA Base Address) */
#define TIM_DCR_DBA_0             (0x01UL << TIM_DCR_DBA_POS)                  /*!< 0x00000001 */
#define TIM_DCR_DBA_1             (0x02UL << TIM_DCR_DBA_POS)                  /*!< 0x00000002 */
#define TIM_DCR_DBA_2             (0x04UL << TIM_DCR_DBA_POS)                  /*!< 0x00000004 */
#define TIM_DCR_DBA_3             (0x08UL << TIM_DCR_DBA_POS)                  /*!< 0x00000008 */
#define TIM_DCR_DBA_4             (0x10UL << TIM_DCR_DBA_POS)                  /*!< 0x00000010 */

#define TIM_DCR_DBL_POS           (8U)
#define TIM_DCR_DBL_MSK           (0x1FUL << TIM_DCR_DBL_POS)                  /*!< 0x00001F00 */
#define TIM_DCR_DBL               TIM_DCR_DBL_MSK                              /*!<DBL[4:0] bits (DMA Burst Length) */
#define TIM_DCR_DBL_0             (0x01UL << TIM_DCR_DBL_POS)                  /*!< 0x00000100 */
#define TIM_DCR_DBL_1             (0x02UL << TIM_DCR_DBL_POS)                  /*!< 0x00000200 */
#define TIM_DCR_DBL_2             (0x04UL << TIM_DCR_DBL_POS)                  /*!< 0x00000400 */
#define TIM_DCR_DBL_3             (0x08UL << TIM_DCR_DBL_POS)                  /*!< 0x00000800 */
#define TIM_DCR_DBL_4             (0x10UL << TIM_DCR_DBL_POS)                  /*!< 0x00001000 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define TIM_DMAR_DMAB_POS         (0U)
#define TIM_DMAR_DMAB_MSK         (0xFFFFUL << TIM_DMAR_DMAB_POS)              /*!< 0x0000FFFF */
#define TIM_DMAR_DMAB             TIM_DMAR_DMAB_MSK                            /*!<DMA register for burst accesses */

/*******************  Bit definition for TIM1_OR1 register  *******************/
#define TIM1_OR1_OCREF_CLR_POS     (0U)
#define TIM1_OR1_OCREF_CLR_MSK     (0x1UL << TIM1_OR1_OCREF_CLR_POS)           /*!< 0x00000001 */
#define TIM1_OR1_OCREF_CLR         TIM1_OR1_OCREF_CLR_MSK                      /*!<OCREF clear input selection */

/*******************  Bit definition for TIM1_AF1 register  *******************/
#define TIM1_AF1_BKINE_POS        (0U)
#define TIM1_AF1_BKINE_MSK        (0x1UL << TIM1_AF1_BKINE_POS)                /*!< 0x00000001 */
#define TIM1_AF1_BKINE            TIM1_AF1_BKINE_MSK                           /*!<BRK BKIN input enable */
#define TIM1_AF1_BKCMP1E_POS      (1U)
#define TIM1_AF1_BKCMP1E_MSK      (0x1UL << TIM1_AF1_BKCMP1E_POS)              /*!< 0x00000002 */
#define TIM1_AF1_BKCMP1E          TIM1_AF1_BKCMP1E_MSK                         /*!<BRK COMP1 enable */
#define TIM1_AF1_BKCMP2E_POS      (2U)
#define TIM1_AF1_BKCMP2E_MSK      (0x1UL << TIM1_AF1_BKCMP2E_POS)              /*!< 0x00000004 */
#define TIM1_AF1_BKCMP2E          TIM1_AF1_BKCMP2E_MSK                         /*!<BRK COMP2 enable */
#define TIM1_AF1_BKINP_POS        (9U)
#define TIM1_AF1_BKINP_MSK        (0x1UL << TIM1_AF1_BKINP_POS)                /*!< 0x00000200 */
#define TIM1_AF1_BKINP            TIM1_AF1_BKINP_MSK                           /*!<BRK BKIN input polarity */
#define TIM1_AF1_BKCMP1P_POS      (10U)
#define TIM1_AF1_BKCMP1P_MSK      (0x1UL << TIM1_AF1_BKCMP1P_POS)              /*!< 0x00000400 */
#define TIM1_AF1_BKCMP1P          TIM1_AF1_BKCMP1P_MSK                         /*!<BRK COMP1 input polarity */
#define TIM1_AF1_BKCMP2P_POS      (11U)
#define TIM1_AF1_BKCMP2P_MSK      (0x1UL << TIM1_AF1_BKCMP2P_POS)              /*!< 0x00000800 */
#define TIM1_AF1_BKCMP2P          TIM1_AF1_BKCMP2P_MSK                         /*!<BRK COMP2 input polarity */

#define TIM1_AF1_ETRSEL_POS       (14U)
#define TIM1_AF1_ETRSEL_MSK       (0xFUL << TIM1_AF1_ETRSEL_POS)               /*!< 0x0003C000 */
#define TIM1_AF1_ETRSEL           TIM1_AF1_ETRSEL_MSK                          /*!<ETRSEL[3:0] bits (TIM1 ETR source selection) */
#define TIM1_AF1_ETRSEL_0         (0x1UL << TIM1_AF1_ETRSEL_POS)               /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1         (0x2UL << TIM1_AF1_ETRSEL_POS)               /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2         (0x4UL << TIM1_AF1_ETRSEL_POS)               /*!< 0x00010000 */
#define TIM1_AF1_ETRSEL_3         (0x8UL << TIM1_AF1_ETRSEL_POS)               /*!< 0x00020000 */

/*******************  Bit definition for TIM1_AF2 register  *******************/
#define TIM1_AF2_BK2INE_POS       (0U)
#define TIM1_AF2_BK2INE_MSK       (0x1UL << TIM1_AF2_BK2INE_POS)               /*!< 0x00000001 */
#define TIM1_AF2_BK2INE           TIM1_AF2_BK2INE_MSK                          /*!<BRK2 BKIN2 input enable */
#define TIM1_AF2_BK2CMP1E_POS     (1U)
#define TIM1_AF2_BK2CMP1E_MSK     (0x1UL << TIM1_AF2_BK2CMP1E_POS)             /*!< 0x00000002 */
#define TIM1_AF2_BK2CMP1E         TIM1_AF2_BK2CMP1E_MSK                        /*!<BRK2 COMP1 enable */
#define TIM1_AF2_BK2CMP2E_POS     (2U)
#define TIM1_AF2_BK2CMP2E_MSK     (0x1UL << TIM1_AF2_BK2CMP2E_POS)             /*!< 0x00000004 */
#define TIM1_AF2_BK2CMP2E         TIM1_AF2_BK2CMP2E_MSK                        /*!<BRK2 COMP2 enable */
#define TIM1_AF2_BK2INP_POS       (9U)
#define TIM1_AF2_BK2INP_MSK       (0x1UL << TIM1_AF2_BK2INP_POS)               /*!< 0x00000200 */
#define TIM1_AF2_BK2INP           TIM1_AF2_BK2INP_MSK                          /*!<BRK2 BKIN2 input polarity */
#define TIM1_AF2_BK2CMP1P_POS     (10U)
#define TIM1_AF2_BK2CMP1P_MSK     (0x1UL << TIM1_AF2_BK2CMP1P_POS)             /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP1P         TIM1_AF2_BK2CMP1P_MSK                        /*!<BRK2 COMP1 input polarity */
#define TIM1_AF2_BK2CMP2P_POS     (11U)
#define TIM1_AF2_BK2CMP2P_MSK     (0x1UL << TIM1_AF2_BK2CMP2P_POS)             /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP2P         TIM1_AF2_BK2CMP2P_MSK                        /*!<BRK2 COMP2 input polarity */

