ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for TIM2_OR1 register  *******************/
#define TIM2_OR1_OCREF_CLR_POS     (0U)
#define TIM2_OR1_OCREF_CLR_MSK     (0x1UL << TIM2_OR1_OCREF_CLR_POS)           /*!< 0x00000001 */
#define TIM2_OR1_OCREF_CLR         TIM2_OR1_OCREF_CLR_MSK                      /*!<OCREF clear input selection */

/*******************  Bit definition for TIM2_AF1 register  *******************/
#define TIM2_AF1_ETRSEL_POS       (14U)
#define TIM2_AF1_ETRSEL_MSK       (0xFUL << TIM2_AF1_ETRSEL_POS)               /*!< 0x0003C000 */
#define TIM2_AF1_ETRSEL           TIM2_AF1_ETRSEL_MSK                          /*!<ETRSEL[3:0] bits (TIM2 ETR source selection) */
#define TIM2_AF1_ETRSEL_0         (0x1UL << TIM2_AF1_ETRSEL_POS)               /*!< 0x00004000 */
#define TIM2_AF1_ETRSEL_1         (0x2UL << TIM2_AF1_ETRSEL_POS)               /*!< 0x00008000 */
#define TIM2_AF1_ETRSEL_2         (0x4UL << TIM2_AF1_ETRSEL_POS)               /*!< 0x00010000 */
#define TIM2_AF1_ETRSEL_3         (0x8UL << TIM2_AF1_ETRSEL_POS)               /*!< 0x00020000 */

/*******************  Bit definition for TIM3_OR1 register  *******************/
#define TIM3_OR1_OCREF_CLR_POS     (0U)
#define TIM3_OR1_OCREF_CLR_MSK     (0x1UL << TIM3_OR1_OCREF_CLR_POS)           /*!< 0x00000001 */
#define TIM3_OR1_OCREF_CLR         TIM3_OR1_OCREF_CLR_MSK                      /*!<OCREF clear input selection */

/*******************  Bit definition for TIM3_AF1 register  *******************/
#define TIM3_AF1_ETRSEL_POS       (14U)
#define TIM3_AF1_ETRSEL_MSK       (0xFUL << TIM3_AF1_ETRSEL_POS)               /*!< 0x0003C000 */
#define TIM3_AF1_ETRSEL           TIM3_AF1_ETRSEL_MSK                          /*!<ETRSEL[3:0] bits (TIM3 ETR source selection) */
#define TIM3_AF1_ETRSEL_0         (0x1UL << TIM3_AF1_ETRSEL_POS)               /*!< 0x00004000 */
#define TIM3_AF1_ETRSEL_1         (0x2UL << TIM3_AF1_ETRSEL_POS)               /*!< 0x00008000 */
#define TIM3_AF1_ETRSEL_2         (0x4UL << TIM3_AF1_ETRSEL_POS)               /*!< 0x00010000 */
#define TIM3_AF1_ETRSEL_3         (0x8UL << TIM3_AF1_ETRSEL_POS)               /*!< 0x00020000 */

/*******************  Bit definition for TIM14_AF1 register  *******************/
#define TIM14_AF1_ETRSEL_POS      (14U)
#define TIM14_AF1_ETRSEL_MSK      (0xFUL << TIM14_AF1_ETRSEL_POS)              /*!< 0x0003C000 */
#define TIM14_AF1_ETRSEL          TIM14_AF1_ETRSEL_MSK                         /*!<ETRSEL[3:0] bits (TIM3 ETR source selection) */
#define TIM14_AF1_ETRSEL_0        (0x1UL << TIM14_AF1_ETRSEL_POS)              /*!< 0x00004000 */
#define TIM14_AF1_ETRSEL_1        (0x2UL << TIM14_AF1_ETRSEL_POS)              /*!< 0x00008000 */
#define TIM14_AF1_ETRSEL_2        (0x4UL << TIM14_AF1_ETRSEL_POS)              /*!< 0x00010000 */
#define TIM14_AF1_ETRSEL_3        (0x8UL << TIM14_AF1_ETRSEL_POS)              /*!< 0x00020000 */

/*******************  Bit definition for TIM15_AF1 register  ******************/
#define TIM15_AF1_BKINE_POS      (0U)
#define TIM15_AF1_BKINE_MSK      (0x1UL << TIM15_AF1_BKINE_POS)                /*!< 0x00000001 */
#define TIM15_AF1_BKINE          TIM15_AF1_BKINE_MSK                           /*!<BRK BKIN input enable */
#define TIM15_AF1_BKCMP1E_POS    (1U)
#define TIM15_AF1_BKCMP1E_MSK    (0x1UL << TIM15_AF1_BKCMP1E_POS)              /*!< 0x00000002 */
#define TIM15_AF1_BKCMP1E        TIM15_AF1_BKCMP1E_MSK                         /*!<BRK COMP1 enable */
#define TIM15_AF1_BKCMP2E_POS    (2U)
#define TIM15_AF1_BKCMP2E_MSK    (0x1UL << TIM15_AF1_BKCMP2E_POS)              /*!< 0x00000004 */
#define TIM15_AF1_BKCMP2E        TIM15_AF1_BKCMP2E_MSK                         /*!<BRK COMP2 enable */
#define TIM15_AF1_BKINP_POS      (9U)
#define TIM15_AF1_BKINP_MSK      (0x1UL << TIM15_AF1_BKINP_POS)                /*!< 0x00000200 */
#define TIM15_AF1_BKINP          TIM15_AF1_BKINP_MSK                           /*!<BRK BKIN input polarity */
#define TIM15_AF1_BKCMP1P_POS    (10U)
#define TIM15_AF1_BKCMP1P_MSK    (0x1UL << TIM15_AF1_BKCMP1P_POS)              /*!< 0x00000400 */
#define TIM15_AF1_BKCMP1P        TIM15_AF1_BKCMP1P_MSK                         /*!<BRK COMP1 input polarity */
#define TIM15_AF1_BKCMP2P_POS    (11U)
#define TIM15_AF1_BKCMP2P_MSK    (0x1UL << TIM15_AF1_BKCMP2P_POS)              /*!< 0x00000800 */
#define TIM15_AF1_BKCMP2P        TIM15_AF1_BKCMP2P_MSK                         /*!<BRK COMP2 input polarity */

/*******************  Bit definition for TIM16_AF1 register  ******************/
#define TIM16_AF1_BKINE_POS      (0U)
#define TIM16_AF1_BKINE_MSK      (0x1UL << TIM16_AF1_BKINE_POS)                /*!< 0x00000001 */
#define TIM16_AF1_BKINE          TIM16_AF1_BKINE_MSK                           /*!<BRK BKIN input enable */
#define TIM16_AF1_BKCMP1E_POS    (1U)
#define TIM16_AF1_BKCMP1E_MSK    (0x1UL << TIM16_AF1_BKCMP1E_POS)              /*!< 0x00000002 */
#define TIM16_AF1_BKCMP1E        TIM16_AF1_BKCMP1E_MSK                         /*!<BRK COMP1 enable */
#define TIM16_AF1_BKCMP2E_POS    (2U)
#define TIM16_AF1_BKCMP2E_MSK    (0x1UL << TIM16_AF1_BKCMP2E_POS)              /*!< 0x00000004 */
#define TIM16_AF1_BKCMP2E        TIM16_AF1_BKCMP2E_MSK                         /*!<BRK COMP2 enable */
#define TIM16_AF1_BKINP_POS      (9U)
#define TIM16_AF1_BKINP_MSK      (0x1UL << TIM16_AF1_BKINP_POS)                /*!< 0x00000200 */
#define TIM16_AF1_BKINP          TIM16_AF1_BKINP_MSK                           /*!<BRK BKIN input polarity */
#define TIM16_AF1_BKCMP1P_POS    (10U)
#define TIM16_AF1_BKCMP1P_MSK    (0x1UL << TIM16_AF1_BKCMP1P_POS)              /*!< 0x00000400 */
#define TIM16_AF1_BKCMP1P        TIM16_AF1_BKCMP1P_MSK                         /*!<BRK COMP1 input polarity */
#define TIM16_AF1_BKCMP2P_POS    (11U)
#define TIM16_AF1_BKCMP2P_MSK    (0x1UL << TIM16_AF1_BKCMP2P_POS)              /*!< 0x00000800 */
#define TIM16_AF1_BKCMP2P        TIM16_AF1_BKCMP2P_MSK                         /*!<BRK COMP2 input polarity */

/*******************  Bit definition for TIM17_AF1 register  ******************/
#define TIM17_AF1_BKINE_POS      (0U)
#define TIM17_AF1_BKINE_MSK      (0x1UL << TIM17_AF1_BKINE_POS)                /*!< 0x00000001 */
#define TIM17_AF1_BKINE          TIM17_AF1_BKINE_MSK                           /*!<BRK BKIN input enable */
#define TIM17_AF1_BKCMP1E_POS    (1U)
#define TIM17_AF1_BKCMP1E_MSK    (0x1UL << TIM17_AF1_BKCMP1E_POS)              /*!< 0x00000002 */
#define TIM17_AF1_BKCMP1E        TIM17_AF1_BKCMP1E_MSK                         /*!<BRK COMP1 enable */
#define TIM17_AF1_BKCMP2E_POS    (2U)
#define TIM17_AF1_BKCMP2E_MSK    (0x1UL << TIM17_AF1_BKCMP2E_POS)              /*!< 0x00000004 */
#define TIM17_AF1_BKCMP2E        TIM17_AF1_BKCMP2E_MSK                         /*!<BRK COMP2 enable */
#define TIM17_AF1_BKINP_POS      (9U)
#define TIM17_AF1_BKINP_MSK      (0x1UL << TIM17_AF1_BKINP_POS)                /*!< 0x00000200 */
#define TIM17_AF1_BKINP          TIM17_AF1_BKINP_MSK                           /*!<BRK BKIN input polarity */
#define TIM17_AF1_BKCMP1P_POS    (10U)
#define TIM17_AF1_BKCMP1P_MSK    (0x1UL << TIM17_AF1_BKCMP1P_POS)              /*!< 0x00000400 */
#define TIM17_AF1_BKCMP1P        TIM17_AF1_BKCMP1P_MSK                         /*!<BRK COMP1 input polarity */
#define TIM17_AF1_BKCMP2P_POS    (11U)
#define TIM17_AF1_BKCMP2P_MSK    (0x1UL << TIM17_AF1_BKCMP2P_POS)              /*!< 0x00000800 */
#define TIM17_AF1_BKCMP2P        TIM17_AF1_BKCMP2P_MSK                         /*!<BRK COMP2 input polarity */

/*******************  Bit definition for TIM_TISEL register  *********************/
#define TIM_TISEL_TI1SEL_POS      (0U)
#define TIM_TISEL_TI1SEL_MSK      (0xFUL << TIM_TISEL_TI1SEL_POS)              /*!< 0x0000000F */
#define TIM_TISEL_TI1SEL          TIM_TISEL_TI1SEL_MSK                         /*!<TI1SEL[3:0] bits (TIM1 TI1 SEL)*/
#define TIM_TISEL_TI1SEL_0        (0x1UL << TIM_TISEL_TI1SEL_POS)              /*!< 0x00000001 */
#define TIM_TISEL_TI1SEL_1        (0x2UL << TIM_TISEL_TI1SEL_POS)              /*!< 0x00000002 */
#define TIM_TISEL_TI1SEL_2        (0x4UL << TIM_TISEL_TI1SEL_POS)              /*!< 0x00000004 */
#define TIM_TISEL_TI1SEL_3        (0x8UL << TIM_TISEL_TI1SEL_POS)              /*!< 0x00000008 */

