ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define TIM_TISEL_TI2SEL_POS      (8U)
#define TIM_TISEL_TI2SEL_MSK      (0xFUL << TIM_TISEL_TI2SEL_POS)              /*!< 0x00000F00 */
#define TIM_TISEL_TI2SEL          TIM_TISEL_TI2SEL_MSK                         /*!<TI2SEL[3:0] bits (TIM1 TI2 SEL)*/
#define TIM_TISEL_TI2SEL_0        (0x1UL << TIM_TISEL_TI2SEL_POS)              /*!< 0x00000100 */
#define TIM_TISEL_TI2SEL_1        (0x2UL << TIM_TISEL_TI2SEL_POS)              /*!< 0x00000200 */
#define TIM_TISEL_TI2SEL_2        (0x4UL << TIM_TISEL_TI2SEL_POS)              /*!< 0x00000400 */
#define TIM_TISEL_TI2SEL_3        (0x8UL << TIM_TISEL_TI2SEL_POS)              /*!< 0x00000800 */

#define TIM_TISEL_TI3SEL_POS      (16U)
#define TIM_TISEL_TI3SEL_MSK      (0xFUL << TIM_TISEL_TI3SEL_POS)              /*!< 0x000F0000 */
#define TIM_TISEL_TI3SEL          TIM_TISEL_TI3SEL_MSK                         /*!<TI3SEL[3:0] bits (TIM1 TI3 SEL)*/
#define TIM_TISEL_TI3SEL_0        (0x1UL << TIM_TISEL_TI3SEL_POS)              /*!< 0x00010000 */
#define TIM_TISEL_TI3SEL_1        (0x2UL << TIM_TISEL_TI3SEL_POS)              /*!< 0x00020000 */
#define TIM_TISEL_TI3SEL_2        (0x4UL << TIM_TISEL_TI3SEL_POS)              /*!< 0x00040000 */
#define TIM_TISEL_TI3SEL_3        (0x8UL << TIM_TISEL_TI3SEL_POS)              /*!< 0x00080000 */

#define TIM_TISEL_TI4SEL_POS      (24U)
#define TIM_TISEL_TI4SEL_MSK      (0xFUL << TIM_TISEL_TI4SEL_POS)              /*!< 0x0F000000 */
#define TIM_TISEL_TI4SEL          TIM_TISEL_TI4SEL_MSK                         /*!<TI4SEL[3:0] bits (TIM1 TI4 SEL)*/
#define TIM_TISEL_TI4SEL_0        (0x1UL << TIM_TISEL_TI4SEL_POS)              /*!< 0x01000000 */
#define TIM_TISEL_TI4SEL_1        (0x2UL << TIM_TISEL_TI4SEL_POS)              /*!< 0x02000000 */
#define TIM_TISEL_TI4SEL_2        (0x4UL << TIM_TISEL_TI4SEL_POS)              /*!< 0x04000000 */
#define TIM_TISEL_TI4SEL_3        (0x8UL << TIM_TISEL_TI4SEL_POS)              /*!< 0x08000000 */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- LPTIMER CONTROL REGISTERS ----------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief LPTIMER
  */
typedef struct
{
  volatile uint32 ISR;              /*!< LPTIM Interrupt and Status register,                Address offset: 0x00 */
  volatile uint32 ICR;              /*!< LPTIM Interrupt Clear register,                     Address offset: 0x04 */
  volatile uint32 IER;              /*!< LPTIM Interrupt Enable register,                    Address offset: 0x08 */
  volatile uint32 CFGR;             /*!< LPTIM Configuration register,                       Address offset: 0x0C */
  volatile uint32 CR;               /*!< LPTIM Control register,                             Address offset: 0x10 */
  volatile uint32 CMP;              /*!< LPTIM Compare register,                             Address offset: 0x14 */
  volatile uint32 ARR;              /*!< LPTIM Autoreload register,                          Address offset: 0x18 */
  volatile uint32 CNT;              /*!< LPTIM Counter register,                             Address offset: 0x1C */
  volatile uint32 RESERVED1;        /*!< Reserved1,                                          Address offset: 0x20 */
  volatile uint32 CFGR2;            /*!< LPTIM Option register,                              Address offset: 0x24 */
} LPTIM_DEF_TYPE;


#define LPTIM2              (*(LPTIM_DEF_TYPE *) LPTIM2_BASE)
#define LPTIM1              (*(LPTIM_DEF_TYPE *) LPTIM1_BASE)

/******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_CMPM_POS          (0U)
#define LPTIM_ISR_CMPM_MSK          (0x1UL << LPTIM_ISR_CMPM_POS)              /*!< 0x00000001 */
#define LPTIM_ISR_CMPM              LPTIM_ISR_CMPM_MSK                         /*!< Compare match */
#define LPTIM_ISR_ARRM_POS          (1U)
#define LPTIM_ISR_ARRM_MSK          (0x1UL << LPTIM_ISR_ARRM_POS)              /*!< 0x00000002 */
#define LPTIM_ISR_ARRM              LPTIM_ISR_ARRM_MSK                         /*!< Autoreload match */
#define LPTIM_ISR_EXTTRIG_POS       (2U)
#define LPTIM_ISR_EXTTRIG_MSK       (0x1UL << LPTIM_ISR_EXTTRIG_POS)           /*!< 0x00000004 */
#define LPTIM_ISR_EXTTRIG           LPTIM_ISR_EXTTRIG_MSK                      /*!< External trigger edge event */
#define LPTIM_ISR_CMPOK_POS         (3U)
#define LPTIM_ISR_CMPOK_MSK         (0x1UL << LPTIM_ISR_CMPOK_POS)             /*!< 0x00000008 */
#define LPTIM_ISR_CMPOK             LPTIM_ISR_CMPOK_MSK                        /*!< Compare register update OK */
#define LPTIM_ISR_ARROK_POS         (4U)
#define LPTIM_ISR_ARROK_MSK         (0x1UL << LPTIM_ISR_ARROK_POS)             /*!< 0x00000010 */
#define LPTIM_ISR_ARROK             LPTIM_ISR_ARROK_MSK                        /*!< Autoreload register update OK */
#define LPTIM_ISR_UP_POS            (5U)
#define LPTIM_ISR_UP_MSK            (0x1UL << LPTIM_ISR_UP_POS)                /*!< 0x00000020 */
#define LPTIM_ISR_UP                LPTIM_ISR_UP_MSK                           /*!< Counter direction change down to up */
#define LPTIM_ISR_DOWN_POS          (6U)
#define LPTIM_ISR_DOWN_MSK          (0x1UL << LPTIM_ISR_DOWN_POS)              /*!< 0x00000040 */
#define LPTIM_ISR_DOWN              LPTIM_ISR_DOWN_MSK                         /*!< Counter direction change up to down */

/******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_CMPMCF_POS        (0U)
#define LPTIM_ICR_CMPMCF_MSK        (0x1UL << LPTIM_ICR_CMPMCF_POS)            /*!< 0x00000001 */
#define LPTIM_ICR_CMPMCF            LPTIM_ICR_CMPMCF_MSK                       /*!< Compare match Clear Flag */
#define LPTIM_ICR_ARRMCF_POS        (1U)
#define LPTIM_ICR_ARRMCF_MSK        (0x1UL << LPTIM_ICR_ARRMCF_POS)            /*!< 0x00000002 */
#define LPTIM_ICR_ARRMCF            LPTIM_ICR_ARRMCF_MSK                       /*!< Autoreload match Clear Flag */
#define LPTIM_ICR_EXTTRIGCF_POS     (2U)
#define LPTIM_ICR_EXTTRIGCF_MSK     (0x1UL << LPTIM_ICR_EXTTRIGCF_POS)         /*!< 0x00000004 */
#define LPTIM_ICR_EXTTRIGCF         LPTIM_ICR_EXTTRIGCF_MSK                    /*!< External trigger edge event Clear Flag */
#define LPTIM_ICR_CMPOKCF_POS       (3U)
#define LPTIM_ICR_CMPOKCF_MSK       (0x1UL << LPTIM_ICR_CMPOKCF_POS)           /*!< 0x00000008 */
#define LPTIM_ICR_CMPOKCF           LPTIM_ICR_CMPOKCF_MSK                      /*!< Compare register update OK Clear Flag */
#define LPTIM_ICR_ARROKCF_POS       (4U)
#define LPTIM_ICR_ARROKCF_MSK       (0x1UL << LPTIM_ICR_ARROKCF_POS)           /*!< 0x00000010 */
#define LPTIM_ICR_ARROKCF           LPTIM_ICR_ARROKCF_MSK                      /*!< Autoreload register update OK Clear Flag */
#define LPTIM_ICR_UPCF_POS          (5U)
#define LPTIM_ICR_UPCF_MSK          (0x1UL << LPTIM_ICR_UPCF_POS)              /*!< 0x00000020 */
#define LPTIM_ICR_UPCF              LPTIM_ICR_UPCF_MSK                         /*!< Counter direction change down to up Clear Flag */
#define LPTIM_ICR_DOWNCF_POS        (6U)
#define LPTIM_ICR_DOWNCF_MSK        (0x1UL << LPTIM_ICR_DOWNCF_POS)            /*!< 0x00000040 */
#define LPTIM_ICR_DOWNCF            LPTIM_ICR_DOWNCF_MSK                       /*!< Counter direction change up to down Clear Flag */

/******************  Bit definition for LPTIM_IER register ********************/
#define LPTIM_IER_CMPMIE_POS        (0U)
#define LPTIM_IER_CMPMIE_MSK        (0x1UL << LPTIM_IER_CMPMIE_POS)            /*!< 0x00000001 */
#define LPTIM_IER_CMPMIE            LPTIM_IER_CMPMIE_MSK                       /*!< Compare match Interrupt Enable */
#define LPTIM_IER_ARRMIE_POS        (1U)
#define LPTIM_IER_ARRMIE_MSK        (0x1UL << LPTIM_IER_ARRMIE_POS)            /*!< 0x00000002 */
#define LPTIM_IER_ARRMIE            LPTIM_IER_ARRMIE_MSK                       /*!< Autoreload match Interrupt Enable */
#define LPTIM_IER_EXTTRIGIE_POS     (2U)
#define LPTIM_IER_EXTTRIGIE_MSK     (0x1UL << LPTIM_IER_EXTTRIGIE_POS)         /*!< 0x00000004 */
#define LPTIM_IER_EXTTRIGIE         LPTIM_IER_EXTTRIGIE_MSK                    /*!< External trigger edge event Interrupt Enable */
#define LPTIM_IER_CMPOKIE_POS       (3U)
#define LPTIM_IER_CMPOKIE_MSK       (0x1UL << LPTIM_IER_CMPOKIE_POS)           /*!< 0x00000008 */
#define LPTIM_IER_CMPOKIE           LPTIM_IER_CMPOKIE_MSK                      /*!< Compare register update OK Interrupt Enable */
#define LPTIM_IER_ARROKIE_POS       (4U)
#define LPTIM_IER_ARROKIE_MSK       (0x1UL << LPTIM_IER_ARROKIE_POS)           /*!< 0x00000010 */
#define LPTIM_IER_ARROKIE           LPTIM_IER_ARROKIE_MSK                      /*!< Autoreload register update OK Interrupt Enable */
#define LPTIM_IER_UPIE_POS          (5U)
#define LPTIM_IER_UPIE_MSK          (0x1UL << LPTIM_IER_UPIE_POS)              /*!< 0x00000020 */
#define LPTIM_IER_UPIE              LPTIM_IER_UPIE_MSK                         /*!< Counter direction change down to up Interrupt Enable */
#define LPTIM_IER_DOWNIE_POS        (6U)
#define LPTIM_IER_DOWNIE_MSK        (0x1UL << LPTIM_IER_DOWNIE_POS)            /*!< 0x00000040 */
#define LPTIM_IER_DOWNIE            LPTIM_IER_DOWNIE_MSK                       /*!< Counter direction change up to down Interrupt Enable */

