ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bit definition for LPTIM_CFGR register *******************/
#define LPTIM_CFGR_CKSEL_POS        (0U)
#define LPTIM_CFGR_CKSEL_MSK        (0x1UL << LPTIM_CFGR_CKSEL_POS)            /*!< 0x00000001 */
#define LPTIM_CFGR_CKSEL            LPTIM_CFGR_CKSEL_MSK                       /*!< Clock selector */

#define LPTIM_CFGR_CKPOL_POS        (1U)
#define LPTIM_CFGR_CKPOL_MSK        (0x3UL << LPTIM_CFGR_CKPOL_POS)            /*!< 0x00000006 */
#define LPTIM_CFGR_CKPOL            LPTIM_CFGR_CKPOL_MSK                       /*!< CKPOL[1:0] bits (Clock polarity) */
#define LPTIM_CFGR_CKPOL_0          (0x1UL << LPTIM_CFGR_CKPOL_POS)            /*!< 0x00000002 */
#define LPTIM_CFGR_CKPOL_1          (0x2UL << LPTIM_CFGR_CKPOL_POS)            /*!< 0x00000004 */

#define LPTIM_CFGR_CKFLT_POS        (3U)
#define LPTIM_CFGR_CKFLT_MSK        (0x3UL << LPTIM_CFGR_CKFLT_POS)            /*!< 0x00000018 */
#define LPTIM_CFGR_CKFLT            LPTIM_CFGR_CKFLT_MSK                       /*!< CKFLT[1:0] bits (Configurable digital filter for external clock) */
#define LPTIM_CFGR_CKFLT_0          (0x1UL << LPTIM_CFGR_CKFLT_POS)            /*!< 0x00000008 */
#define LPTIM_CFGR_CKFLT_1          (0x2UL << LPTIM_CFGR_CKFLT_POS)            /*!< 0x00000010 */

#define LPTIM_CFGR_TRGFLT_POS       (6U)
#define LPTIM_CFGR_TRGFLT_MSK       (0x3UL << LPTIM_CFGR_TRGFLT_POS)           /*!< 0x000000C0 */
#define LPTIM_CFGR_TRGFLT           LPTIM_CFGR_TRGFLT_MSK                      /*!< TRGFLT[1:0] bits (Configurable digital filter for trigger) */
#define LPTIM_CFGR_TRGFLT_0         (0x1UL << LPTIM_CFGR_TRGFLT_POS)           /*!< 0x00000040 */
#define LPTIM_CFGR_TRGFLT_1         (0x2UL << LPTIM_CFGR_TRGFLT_POS)           /*!< 0x00000080 */

#define LPTIM_CFGR_PRESC_POS        (9U)
#define LPTIM_CFGR_PRESC_MSK        (0x7UL << LPTIM_CFGR_PRESC_POS)            /*!< 0x00000E00 */
#define LPTIM_CFGR_PRESC            LPTIM_CFGR_PRESC_MSK                       /*!< PRESC[2:0] bits (Clock prescaler) */
#define LPTIM_CFGR_PRESC_0          (0x1UL << LPTIM_CFGR_PRESC_POS)            /*!< 0x00000200 */
#define LPTIM_CFGR_PRESC_1          (0x2UL << LPTIM_CFGR_PRESC_POS)            /*!< 0x00000400 */
#define LPTIM_CFGR_PRESC_2          (0x4UL << LPTIM_CFGR_PRESC_POS)            /*!< 0x00000800 */

#define LPTIM_CFGR_TRIGSEL_POS      (13U)
#define LPTIM_CFGR_TRIGSEL_MSK      (0x7UL << LPTIM_CFGR_TRIGSEL_POS)          /*!< 0x0000E000 */
#define LPTIM_CFGR_TRIGSEL          LPTIM_CFGR_TRIGSEL_MSK                     /*!< TRIGSEL[2:0]] bits (Trigger selector) */
#define LPTIM_CFGR_TRIGSEL_0        (0x1UL << LPTIM_CFGR_TRIGSEL_POS)          /*!< 0x00002000 */
#define LPTIM_CFGR_TRIGSEL_1        (0x2UL << LPTIM_CFGR_TRIGSEL_POS)          /*!< 0x00004000 */
#define LPTIM_CFGR_TRIGSEL_2        (0x4UL << LPTIM_CFGR_TRIGSEL_POS)          /*!< 0x00008000 */

#define LPTIM_CFGR_TRIGEN_POS       (17U)
#define LPTIM_CFGR_TRIGEN_MSK       (0x3UL << LPTIM_CFGR_TRIGEN_POS)           /*!< 0x00060000 */
#define LPTIM_CFGR_TRIGEN           LPTIM_CFGR_TRIGEN_MSK                      /*!< TRIGEN[1:0] bits (Trigger enable and polarity) */
#define LPTIM_CFGR_TRIGEN_0         (0x1UL << LPTIM_CFGR_TRIGEN_POS)           /*!< 0x00020000 */
#define LPTIM_CFGR_TRIGEN_1         (0x2UL << LPTIM_CFGR_TRIGEN_POS)           /*!< 0x00040000 */

#define LPTIM_CFGR_TIMOUT_POS       (19U)
#define LPTIM_CFGR_TIMOUT_MSK       (0x1UL << LPTIM_CFGR_TIMOUT_POS)           /*!< 0x00080000 */
#define LPTIM_CFGR_TIMOUT           LPTIM_CFGR_TIMOUT_MSK                      /*!< Timout enable */
#define LPTIM_CFGR_WAVE_POS         (20U)
#define LPTIM_CFGR_WAVE_MSK         (0x1UL << LPTIM_CFGR_WAVE_POS)             /*!< 0x00100000 */
#define LPTIM_CFGR_WAVE             LPTIM_CFGR_WAVE_MSK                        /*!< Waveform shape */
#define LPTIM_CFGR_WAVPOL_POS       (21U)
#define LPTIM_CFGR_WAVPOL_MSK       (0x1UL << LPTIM_CFGR_WAVPOL_POS)           /*!< 0x00200000 */
#define LPTIM_CFGR_WAVPOL           LPTIM_CFGR_WAVPOL_MSK                      /*!< Waveform shape polarity */
#define LPTIM_CFGR_PRELOAD_POS      (22U)
#define LPTIM_CFGR_PRELOAD_MSK      (0x1UL << LPTIM_CFGR_PRELOAD_POS)          /*!< 0x00400000 */
#define LPTIM_CFGR_PRELOAD          LPTIM_CFGR_PRELOAD_MSK                     /*!< Reg update mode */
#define LPTIM_CFGR_COUNTMODE_POS    (23U)
#define LPTIM_CFGR_COUNTMODE_MSK    (0x1UL << LPTIM_CFGR_COUNTMODE_POS)        /*!< 0x00800000 */
#define LPTIM_CFGR_COUNTMODE        LPTIM_CFGR_COUNTMODE_MSK                   /*!< Counter mode enable */
#define LPTIM_CFGR_ENC_POS          (24U)
#define LPTIM_CFGR_ENC_MSK          (0x1UL << LPTIM_CFGR_ENC_POS)              /*!< 0x01000000 */
#define LPTIM_CFGR_ENC              LPTIM_CFGR_ENC_MSK                         /*!< Encoder mode enable */

/******************  Bit definition for LPTIM_CR register  ********************/
#define LPTIM_CR_ENABLE_POS         (0U)
#define LPTIM_CR_ENABLE_MSK         (0x1UL << LPTIM_CR_ENABLE_POS)             /*!< 0x00000001 */
#define LPTIM_CR_ENABLE             LPTIM_CR_ENABLE_MSK                        /*!< LPTIMer enable */
#define LPTIM_CR_SNGSTRT_POS        (1U)
#define LPTIM_CR_SNGSTRT_MSK        (0x1UL << LPTIM_CR_SNGSTRT_POS)            /*!< 0x00000002 */
#define LPTIM_CR_SNGSTRT            LPTIM_CR_SNGSTRT_MSK                       /*!< Timer start in single mode */
#define LPTIM_CR_CNTSTRT_POS        (2U)
#define LPTIM_CR_CNTSTRT_MSK        (0x1UL << LPTIM_CR_CNTSTRT_POS)            /*!< 0x00000004 */
#define LPTIM_CR_CNTSTRT            LPTIM_CR_CNTSTRT_MSK                       /*!< Timer start in continuous mode */
#define LPTIM_CR_COUNTRST_POS       (3U)
#define LPTIM_CR_COUNTRST_MSK       (0x1UL << LPTIM_CR_COUNTRST_POS)           /*!< 0x00000008 */
#define LPTIM_CR_COUNTRST           LPTIM_CR_COUNTRST_MSK                      /*!< Counter reset */
#define LPTIM_CR_RSTARE_POS         (4U)
#define LPTIM_CR_RSTARE_MSK         (0x1UL << LPTIM_CR_RSTARE_POS)             /*!< 0x00000010 */
#define LPTIM_CR_RSTARE             LPTIM_CR_RSTARE_MSK                        /*!< Reset after read enable */

