ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bit definition for LPTIM_CMP register  *******************/
#define LPTIM_CMP_CMP_POS           (0U)
#define LPTIM_CMP_CMP_MSK           (0xFFFFUL << LPTIM_CMP_CMP_POS)            /*!< 0x0000FFFF */
#define LPTIM_CMP_CMP               LPTIM_CMP_CMP_MSK                          /*!< Compare register */

/******************  Bit definition for LPTIM_ARR register  *******************/
#define LPTIM_ARR_ARR_POS           (0U)
#define LPTIM_ARR_ARR_MSK           (0xFFFFUL << LPTIM_ARR_ARR_POS)            /*!< 0x0000FFFF */
#define LPTIM_ARR_ARR               LPTIM_ARR_ARR_MSK                          /*!< Auto reload register */

/******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_CNT_CNT_POS           (0U)
#define LPTIM_CNT_CNT_MSK           (0xFFFFUL << LPTIM_CNT_CNT_POS)            /*!< 0x0000FFFF */
#define LPTIM_CNT_CNT               LPTIM_CNT_CNT_MSK                          /*!< Counter register */

/******************  Bit definition for LPTIM_CFGR2 register  *******************/
#define LPTIM_CFGR2_IN1SEL_POS      (0U)
#define LPTIM_CFGR2_IN1SEL_MSK      (0xFUL << LPTIM_CFGR2_IN1SEL_POS)          /*!< 0x0000000F */
#define LPTIM_CFGR2_IN1SEL          LPTIM_CFGR2_IN1SEL_MSK                     /*!< CFGR2[3:0] bits (INPUT1 selection) */
#define LPTIM_CFGR2_IN1SEL_0        (0x1UL << LPTIM_CFGR2_IN1SEL_POS)          /*!< 0x00000001 */
#define LPTIM_CFGR2_IN1SEL_1        (0x2UL << LPTIM_CFGR2_IN1SEL_POS)          /*!< 0x00000002 */
#define LPTIM_CFGR2_IN1SEL_2        (0x4UL << LPTIM_CFGR2_IN1SEL_POS)          /*!< 0x00000004 */
#define LPTIM_CFGR2_IN1SEL_3        (0x8UL << LPTIM_CFGR2_IN1SEL_POS)          /*!< 0x00000008 */

#define LPTIM_CFGR2_IN2SEL_POS      (4U)
#define LPTIM_CFGR2_IN2SEL_MSK      (0xFUL << LPTIM_CFGR2_IN2SEL_POS)          /*!< 0x000000F0 */
#define LPTIM_CFGR2_IN2SEL          LPTIM_CFGR2_IN2SEL_MSK                     /*!< CFGR2[7:4] bits (INPUT2 selection) */
#define LPTIM_CFGR2_IN2SEL_0        (0x1UL << LPTIM_CFGR2_IN2SEL_POS)          /*!< 0x00000010 */
#define LPTIM_CFGR2_IN2SEL_1        (0x2UL << LPTIM_CFGR2_IN2SEL_POS)          /*!< 0x00000020 */
#define LPTIM_CFGR2_IN2SEL_2        (0x4UL << LPTIM_CFGR2_IN2SEL_POS)          /*!< 0x00000040 */
#define LPTIM_CFGR2_IN2SEL_3        (0x8UL << LPTIM_CFGR2_IN2SEL_POS)          /*!< 0x00000080 */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- RTC REGISTERS ----------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief Real-Time Clock
  */
typedef struct
{
  volatile uint32 TR;          /*!< RTC time register,                                         Address offset: 0x00 */
  volatile uint32 DR;          /*!< RTC date register,                                         Address offset: 0x04 */
  volatile uint32 SSR;         /*!< RTC sub second register,                                   Address offset: 0x08 */
  volatile uint32 ICSR;        /*!< RTC initialization control and status register,            Address offset: 0x0C */
  volatile uint32 PRER;        /*!< RTC prescaler register,                                    Address offset: 0x10 */
  volatile uint32 WUTR;        /*!< RTC wakeup timer register,                                 Address offset: 0x14 */
  volatile uint32 CR;          /*!< RTC control register,                                      Address offset: 0x18 */
       uint32 RESERVED0;   /*!< Reserved                                                   Address offset: 0x1C */
       uint32 RESERVED1;   /*!< Reserved                                                   Address offset: 0x20 */
  volatile uint32 WPR;         /*!< RTC write protection register,                             Address offset: 0x24 */
  volatile uint32 CALR;        /*!< RTC calibration register,                                  Address offset: 0x28 */
  volatile uint32 SHIFTR;      /*!< RTC shift control register,                                Address offset: 0x2C */
  volatile uint32 TSTR;        /*!< RTC time stamp time register,                              Address offset: 0x30 */
  volatile uint32 TSDR;        /*!< RTC time stamp date register,                              Address offset: 0x34 */
  volatile uint32 TSSSR;       /*!< RTC time-stamp sub second register,                        Address offset: 0x38 */
       uint32 RESERVED2;   /*!< Reserved                                                   Address offset: 0x1C */
  volatile uint32 ALRMAR;      /*!< RTC alarm A register,                                      Address offset: 0x40 */
  volatile uint32 ALRMASSR;    /*!< RTC alarm A sub second register,                           Address offset: 0x44 */
  volatile uint32 ALRMBR;      /*!< RTC alarm B register,                                      Address offset: 0x48 */
  volatile uint32 ALRMBSSR;    /*!< RTC alarm B sub second register,                           Address offset: 0x4C */
  volatile uint32 SR;          /*!< RTC Status register,                                       Address offset: 0x50 */
  volatile uint32 MISR;        /*!< RTC Masked Interrupt Status register,                      Address offset: 0x54 */
       uint32 RESERVED3;   /*!< Reserved                                                   Address offset: 0x58 */
  volatile uint32 SCR;         /*!< RTC Status Clear register,                                 Address offset: 0x5C */
  volatile uint32 OR;          /*!< RTC option register,                                       Address offset: 0x60 */
} RTC_TYPEDEF;

#define RTC                 (*(RTC_TYPEDEF *) RTC_BASE)

/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM_POS                (22U)
#define RTC_TR_PM_MSK                (0x1UL << RTC_TR_PM_POS)                   /*!< 0x00400000 */
#define RTC_TR_PM                    RTC_TR_PM_MSK
#define RTC_TR_HT_POS                (20U)
#define RTC_TR_HT_MSK                (0x3UL << RTC_TR_HT_POS)                   /*!< 0x00300000 */
#define RTC_TR_HT                    RTC_TR_HT_MSK
#define RTC_TR_HT_0                  (0x1UL << RTC_TR_HT_POS)                   /*!< 0x00100000 */
#define RTC_TR_HT_1                  (0x2UL << RTC_TR_HT_POS)                   /*!< 0x00200000 */
#define RTC_TR_HU_POS                (16U)
#define RTC_TR_HU_MSK                (0xFUL << RTC_TR_HU_POS)                   /*!< 0x000F0000 */
#define RTC_TR_HU                    RTC_TR_HU_MSK
#define RTC_TR_HU_0                  (0x1UL << RTC_TR_HU_POS)                   /*!< 0x00010000 */
#define RTC_TR_HU_1                  (0x2UL << RTC_TR_HU_POS)                   /*!< 0x00020000 */
#define RTC_TR_HU_2                  (0x4UL << RTC_TR_HU_POS)                   /*!< 0x00040000 */
#define RTC_TR_HU_3                  (0x8UL << RTC_TR_HU_POS)                   /*!< 0x00080000 */
#define RTC_TR_MNT_POS               (12U)
#define RTC_TR_MNT_MSK               (0x7UL << RTC_TR_MNT_POS)                  /*!< 0x00007000 */
#define RTC_TR_MNT                   RTC_TR_MNT_MSK
#define RTC_TR_MNT_0                 (0x1UL << RTC_TR_MNT_POS)                  /*!< 0x00001000 */
#define RTC_TR_MNT_1                 (0x2UL << RTC_TR_MNT_POS)                  /*!< 0x00002000 */
#define RTC_TR_MNT_2                 (0x4UL << RTC_TR_MNT_POS)                  /*!< 0x00004000 */
#define RTC_TR_MNU_POS               (8U)
#define RTC_TR_MNU_MSK               (0xFUL << RTC_TR_MNU_POS)                  /*!< 0x00000F00 */
#define RTC_TR_MNU                   RTC_TR_MNU_MSK
#define RTC_TR_MNU_0                 (0x1UL << RTC_TR_MNU_POS)                  /*!< 0x00000100 */
#define RTC_TR_MNU_1                 (0x2UL << RTC_TR_MNU_POS)                  /*!< 0x00000200 */
#define RTC_TR_MNU_2                 (0x4UL << RTC_TR_MNU_POS)                  /*!< 0x00000400 */
#define RTC_TR_MNU_3                 (0x8UL << RTC_TR_MNU_POS)                  /*!< 0x00000800 */
#define RTC_TR_ST_POS                (4U)
#define RTC_TR_ST_MSK                (0x7UL << RTC_TR_ST_POS)                   /*!< 0x00000070 */
#define RTC_TR_ST                    RTC_TR_ST_MSK
#define RTC_TR_ST_0                  (0x1UL << RTC_TR_ST_POS)                   /*!< 0x00000010 */
#define RTC_TR_ST_1                  (0x2UL << RTC_TR_ST_POS)                   /*!< 0x00000020 */
#define RTC_TR_ST_2                  (0x4UL << RTC_TR_ST_POS)                   /*!< 0x00000040 */
#define RTC_TR_SU_POS                (0U)
#define RTC_TR_SU_MSK                (0xFUL << RTC_TR_SU_POS)                   /*!< 0x0000000F */
#define RTC_TR_SU                    RTC_TR_SU_MSK
#define RTC_TR_SU_0                  (0x1UL << RTC_TR_SU_POS)                   /*!< 0x00000001 */
#define RTC_TR_SU_1                  (0x2UL << RTC_TR_SU_POS)                   /*!< 0x00000002 */
#define RTC_TR_SU_2                  (0x4UL << RTC_TR_SU_POS)                   /*!< 0x00000004 */
#define RTC_TR_SU_3                  (0x8UL << RTC_TR_SU_POS)                   /*!< 0x00000008 */

