ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for RTC_DR register  *******************/
#define RTC_DR_YT_POS                (20U)
#define RTC_DR_YT_MSK                (0xFUL << RTC_DR_YT_POS)                   /*!< 0x00F00000 */
#define RTC_DR_YT                    RTC_DR_YT_MSK
#define RTC_DR_YT_0                  (0x1UL << RTC_DR_YT_POS)                   /*!< 0x00100000 */
#define RTC_DR_YT_1                  (0x2UL << RTC_DR_YT_POS)                   /*!< 0x00200000 */
#define RTC_DR_YT_2                  (0x4UL << RTC_DR_YT_POS)                   /*!< 0x00400000 */
#define RTC_DR_YT_3                  (0x8UL << RTC_DR_YT_POS)                   /*!< 0x00800000 */
#define RTC_DR_YU_POS                (16U)
#define RTC_DR_YU_MSK                (0xFUL << RTC_DR_YU_POS)                   /*!< 0x000F0000 */
#define RTC_DR_YU                    RTC_DR_YU_MSK
#define RTC_DR_YU_0                  (0x1UL << RTC_DR_YU_POS)                   /*!< 0x00010000 */
#define RTC_DR_YU_1                  (0x2UL << RTC_DR_YU_POS)                   /*!< 0x00020000 */
#define RTC_DR_YU_2                  (0x4UL << RTC_DR_YU_POS)                   /*!< 0x00040000 */
#define RTC_DR_YU_3                  (0x8UL << RTC_DR_YU_POS)                   /*!< 0x00080000 */
#define RTC_DR_WDU_POS               (13U)
#define RTC_DR_WDU_MSK               (0x7UL << RTC_DR_WDU_POS)                  /*!< 0x0000E000 */
#define RTC_DR_WDU                   RTC_DR_WDU_MSK
#define RTC_DR_WDU_0                 (0x1UL << RTC_DR_WDU_POS)                  /*!< 0x00002000 */
#define RTC_DR_WDU_1                 (0x2UL << RTC_DR_WDU_POS)                  /*!< 0x00004000 */
#define RTC_DR_WDU_2                 (0x4UL << RTC_DR_WDU_POS)                  /*!< 0x00008000 */
#define RTC_DR_MT_POS                (12U)
#define RTC_DR_MT_MSK                (0x1UL << RTC_DR_MT_POS)                   /*!< 0x00001000 */
#define RTC_DR_MT                    RTC_DR_MT_MSK
#define RTC_DR_MU_POS                (8U)
#define RTC_DR_MU_MSK                (0xFUL << RTC_DR_MU_POS)                   /*!< 0x00000F00 */
#define RTC_DR_MU                    RTC_DR_MU_MSK
#define RTC_DR_MU_0                  (0x1UL << RTC_DR_MU_POS)                   /*!< 0x00000100 */
#define RTC_DR_MU_1                  (0x2UL << RTC_DR_MU_POS)                   /*!< 0x00000200 */
#define RTC_DR_MU_2                  (0x4UL << RTC_DR_MU_POS)                   /*!< 0x00000400 */
#define RTC_DR_MU_3                  (0x8UL << RTC_DR_MU_POS)                   /*!< 0x00000800 */
#define RTC_DR_DT_POS                (4U)
#define RTC_DR_DT_MSK                (0x3UL << RTC_DR_DT_POS)                   /*!< 0x00000030 */
#define RTC_DR_DT                    RTC_DR_DT_MSK
#define RTC_DR_DT_0                  (0x1UL << RTC_DR_DT_POS)                   /*!< 0x00000010 */
#define RTC_DR_DT_1                  (0x2UL << RTC_DR_DT_POS)                   /*!< 0x00000020 */
#define RTC_DR_DU_POS                (0U)
#define RTC_DR_DU_MSK                (0xFUL << RTC_DR_DU_POS)                   /*!< 0x0000000F */
#define RTC_DR_DU                    RTC_DR_DU_MSK
#define RTC_DR_DU_0                  (0x1UL << RTC_DR_DU_POS)                   /*!< 0x00000001 */
#define RTC_DR_DU_1                  (0x2UL << RTC_DR_DU_POS)                   /*!< 0x00000002 */
#define RTC_DR_DU_2                  (0x4UL << RTC_DR_DU_POS)                   /*!< 0x00000004 */
#define RTC_DR_DU_3                  (0x8UL << RTC_DR_DU_POS)                   /*!< 0x00000008 */

/********************  Bits definition for RTC_SSR register  ******************/
#define RTC_SSR_SS_POS               (0U)
#define RTC_SSR_SS_MSK               (0xFFFFUL << RTC_SSR_SS_POS)               /*!< 0x0000FFFF */
#define RTC_SSR_SS                   RTC_SSR_SS_MSK

/********************  Bits definition for RTC_ICSR register  ******************/
#define RTC_ICSR_RECALPF_POS         (16U)
#define RTC_ICSR_RECALPF_MSK         (0x1UL << RTC_ICSR_RECALPF_POS)            /*!< 0x00010000 */
#define RTC_ICSR_RECALPF             RTC_ICSR_RECALPF_MSK
#define RTC_ICSR_INIT_POS            (7U)
#define RTC_ICSR_INIT_MSK            (0x1UL << RTC_ICSR_INIT_POS)               /*!< 0x00000080 */
#define RTC_ICSR_INIT                RTC_ICSR_INIT_MSK
#define RTC_ICSR_INITF_POS           (6U)
#define RTC_ICSR_INITF_MSK           (0x1UL << RTC_ICSR_INITF_POS)              /*!< 0x00000040 */
#define RTC_ICSR_INITF               RTC_ICSR_INITF_MSK
#define RTC_ICSR_RSF_POS             (5U)
#define RTC_ICSR_RSF_MSK             (0x1UL << RTC_ICSR_RSF_POS)                /*!< 0x00000020 */
#define RTC_ICSR_RSF                 RTC_ICSR_RSF_MSK
#define RTC_ICSR_INITS_POS           (4U)
#define RTC_ICSR_INITS_MSK           (0x1UL << RTC_ICSR_INITS_POS)              /*!< 0x00000010 */
#define RTC_ICSR_INITS               RTC_ICSR_INITS_MSK
#define RTC_ICSR_SHPF_POS            (3U)
#define RTC_ICSR_SHPF_MSK            (0x1UL << RTC_ICSR_SHPF_POS)               /*!< 0x00000008 */
#define RTC_ICSR_SHPF                RTC_ICSR_SHPF_MSK
#define RTC_ICSR_WUTWF_POS           (2U)
#define RTC_ICSR_WUTWF_MSK           (0x1UL << RTC_ICSR_WUTWF_POS)              /*!< 0x00000004 */
#define RTC_ICSR_WUTWF               RTC_ICSR_WUTWF_MSK                         /*!< Wakeup timer write flag > */
#define RTC_ICSR_ALRBWF_POS          (1U)
#define RTC_ICSR_ALRBWF_MSK          (0x1UL << RTC_ICSR_ALRBWF_POS)             /*!< 0x00000002 */
#define RTC_ICSR_ALRBWF              RTC_ICSR_ALRBWF_MSK
#define RTC_ICSR_ALRAWF_POS          (0U)
#define RTC_ICSR_ALRAWF_MSK          (0x1UL << RTC_ICSR_ALRAWF_POS)             /*!< 0x00000001 */
#define RTC_ICSR_ALRAWF              RTC_ICSR_ALRAWF_MSK

/********************  Bits definition for RTC_PRER register  *****************/
#define RTC_PRER_PREDIV_A_POS        (16U)
#define RTC_PRER_PREDIV_A_MSK        (0x7FUL << RTC_PRER_PREDIV_A_POS)          /*!< 0x007F0000 */
#define RTC_PRER_PREDIV_A            RTC_PRER_PREDIV_A_MSK
#define RTC_PRER_PREDIV_S_POS        (0U)
#define RTC_PRER_PREDIV_S_MSK        (0x7FFFUL << RTC_PRER_PREDIV_S_POS)        /*!< 0x00007FFF */
#define RTC_PRER_PREDIV_S            RTC_PRER_PREDIV_S_MSK

/********************  Bits definition for RTC_WUTR register  *****************/
#define RTC_WUTR_WUT_POS             (0U)
#define RTC_WUTR_WUT_MSK             (0xFFFFUL << RTC_WUTR_WUT_POS)            /*!< 0x0000FFFF */
#define RTC_WUTR_WUT                 RTC_WUTR_WUT_MSK                          /*!< Wakeup auto-reload value bits > */

/********************  Bits definition for RTC_CR register  *******************/
#define RTC_CR_OUT2EN_POS            (31U)
#define RTC_CR_OUT2EN_MSK            (0x1UL << RTC_CR_OUT2EN_POS)              /*!< 0x80000000 */
#define RTC_CR_OUT2EN                RTC_CR_OUT2EN_MSK                         /*!< RTC_OUT2 output enable */
#define RTC_CR_TAMPALRM_TYPE_POS     (30U)
#define RTC_CR_TAMPALRM_TYPE_MSK     (0x1UL << RTC_CR_TAMPALRM_TYPE_POS)       /*!< 0x40000000 */
#define RTC_CR_TAMPALRM_TYPE         RTC_CR_TAMPALRM_TYPE_MSK                  /*!< TAMPALARM output type  */
#define RTC_CR_TAMPALRM_PU_POS       (29U)
#define RTC_CR_TAMPALRM_PU_MSK       (0x1UL << RTC_CR_TAMPALRM_PU_POS)         /*!< 0x20000000 */
#define RTC_CR_TAMPALRM_PU           RTC_CR_TAMPALRM_PU_MSK                    /*!< TAMPALARM output pull-up config */
#define RTC_CR_TAMPOE_POS            (26U)
#define RTC_CR_TAMPOE_MSK            (0x1UL << RTC_CR_TAMPOE_POS)              /*!< 0x04000000 */
#define RTC_CR_TAMPOE                RTC_CR_TAMPOE_MSK                         /*!< Tamper detection output enable on TAMPALARM  */
#define RTC_CR_TAMPTS_POS            (25U)
#define RTC_CR_TAMPTS_MSK            (0x1UL << RTC_CR_TAMPTS_POS)              /*!< 0x02000000 */
#define RTC_CR_TAMPTS                RTC_CR_TAMPTS_MSK                         /*!< Activate timestamp on tamper detection event  */
#define RTC_CR_ITSE_POS              (24U)
#define RTC_CR_ITSE_MSK              (0x1UL << RTC_CR_ITSE_POS)                /*!< 0x01000000 */
#define RTC_CR_ITSE                  RTC_CR_ITSE_MSK                           /*!< Timestamp on internal event enable  */
#define RTC_CR_COE_POS               (23U)
#define RTC_CR_COE_MSK               (0x1UL << RTC_CR_COE_POS)                 /*!< 0x00800000 */
#define RTC_CR_COE                   RTC_CR_COE_MSK
#define RTC_CR_OSEL_POS              (21U)
#define RTC_CR_OSEL_MSK              (0x3UL << RTC_CR_OSEL_POS)                 /*!< 0x00600000 */
#define RTC_CR_OSEL                  RTC_CR_OSEL_MSK
#define RTC_CR_OSEL_0                (0x1UL << RTC_CR_OSEL_POS)                 /*!< 0x00200000 */
#define RTC_CR_OSEL_1                (0x2UL << RTC_CR_OSEL_POS)                 /*!< 0x00400000 */
#define RTC_CR_POL_POS               (20U)
#define RTC_CR_POL_MSK               (0x1UL << RTC_CR_POL_POS)                  /*!< 0x00100000 */
#define RTC_CR_POL                   RTC_CR_POL_MSK
#define RTC_CR_COSEL_POS             (19U)
#define RTC_CR_COSEL_MSK             (0x1UL << RTC_CR_COSEL_POS)                /*!< 0x00080000 */
#define RTC_CR_COSEL                 RTC_CR_COSEL_MSK
#define RTC_CR_BKP_POS               (18U)
#define RTC_CR_BKP_MSK               (0x1UL << RTC_CR_BKP_POS)                  /*!< 0x00040000 */
#define RTC_CR_BKP                   RTC_CR_BKP_MSK
#define RTC_CR_SUB1H_POS             (17U)
#define RTC_CR_SUB1H_MSK             (0x1UL << RTC_CR_SUB1H_POS)                /*!< 0x00020000 */
#define RTC_CR_SUB1H                 RTC_CR_SUB1H_MSK
#define RTC_CR_ADD1H_POS             (16U)
#define RTC_CR_ADD1H_MSK             (0x1UL << RTC_CR_ADD1H_POS)                /*!< 0x00010000 */
#define RTC_CR_ADD1H                 RTC_CR_ADD1H_MSK
#define RTC_CR_TSIE_POS              (15U)
#define RTC_CR_TSIE_MSK              (0x1UL << RTC_CR_TSIE_POS)                /*!< 0x00008000 */
#define RTC_CR_TSIE                  RTC_CR_TSIE_MSK                           /*!< Timestamp interrupt enable > */
#define RTC_CR_WUTIE_POS             (14U)
#define RTC_CR_WUTIE_MSK             (0x1UL << RTC_CR_WUTIE_POS)               /*!< 0x00004000 */
#define RTC_CR_WUTIE                 RTC_CR_WUTIE_MSK                          /*!< Wakeup timer interrupt enable > */
#define RTC_CR_ALRBIE_POS            (13U)
#define RTC_CR_ALRBIE_MSK            (0x1UL << RTC_CR_ALRBIE_POS)              /*!< 0x00002000 */
#define RTC_CR_ALRBIE                RTC_CR_ALRBIE_MSK
#define RTC_CR_ALRAIE_POS            (12U)
#define RTC_CR_ALRAIE_MSK            (0x1UL << RTC_CR_ALRAIE_POS)              /*!< 0x00001000 */
#define RTC_CR_ALRAIE                RTC_CR_ALRAIE_MSK
#define RTC_CR_TSE_POS               (11U)
#define RTC_CR_TSE_MSK               (0x1UL << RTC_CR_TSE_POS)                 /*!< 0x00000800 */
#define RTC_CR_TSE                   RTC_CR_TSE_MSK                            /*!< timestamp enable > */
#define RTC_CR_WUTE_POS              (10U)
#define RTC_CR_WUTE_MSK              (0x1UL << RTC_CR_WUTE_POS)                /*!< 0x00000400 */
#define RTC_CR_WUTE                  RTC_CR_WUTE_MSK                           /*!< Wakeup timer enable > */
#define RTC_CR_ALRBE_POS             (9U)
#define RTC_CR_ALRBE_MSK             (0x1UL << RTC_CR_ALRBE_POS)               /*!< 0x00000200 */
#define RTC_CR_ALRBE                 RTC_CR_ALRBE_MSK
#define RTC_CR_ALRAE_POS             (8U)
#define RTC_CR_ALRAE_MSK             (0x1UL << RTC_CR_ALRAE_POS)                /*!< 0x00000100 */
#define RTC_CR_ALRAE                 RTC_CR_ALRAE_MSK
#define RTC_CR_FMT_POS               (6U)
#define RTC_CR_FMT_MSK               (0x1UL << RTC_CR_FMT_POS)                  /*!< 0x00000040 */
#define RTC_CR_FMT                   RTC_CR_FMT_MSK
#define RTC_CR_BYPSHAD_POS           (5U)
#define RTC_CR_BYPSHAD_MSK           (0x1UL << RTC_CR_BYPSHAD_POS)              /*!< 0x00000020 */
#define RTC_CR_BYPSHAD               RTC_CR_BYPSHAD_MSK
#define RTC_CR_REFCKON_POS           (4U)
#define RTC_CR_REFCKON_MSK           (0x1UL << RTC_CR_REFCKON_POS)              /*!< 0x00000010 */
#define RTC_CR_REFCKON               RTC_CR_REFCKON_MSK
#define RTC_CR_TSEDGE_POS            (3U)
#define RTC_CR_TSEDGE_MSK            (0x1UL << RTC_CR_TSEDGE_POS)              /*!< 0x00000008 */
#define RTC_CR_TSEDGE                RTC_CR_TSEDGE_MSK                         /*!< Timestamp event active edge > */
#define RTC_CR_WUCKSEL_POS           (0U)
#define RTC_CR_WUCKSEL_MSK           (0x7UL << RTC_CR_WUCKSEL_POS)             /*!< 0x00000007 */
#define RTC_CR_WUCKSEL               RTC_CR_WUCKSEL_MSK                        /*!< Wakeup clock selection > */
#define RTC_CR_WUCKSEL_0             (0x1UL << RTC_CR_WUCKSEL_POS)             /*!< 0x00000001 */
#define RTC_CR_WUCKSEL_1             (0x2UL << RTC_CR_WUCKSEL_POS)             /*!< 0x00000002 */
#define RTC_CR_WUCKSEL_2             (0x4UL << RTC_CR_WUCKSEL_POS)             /*!< 0x00000004 */

