ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for RTC_WPR register  ******************/
#define RTC_WPR_KEY_POS              (0U)
#define RTC_WPR_KEY_MSK              (0xFFUL << RTC_WPR_KEY_POS)                /*!< 0x000000FF */
#define RTC_WPR_KEY                  RTC_WPR_KEY_MSK

/********************  Bits definition for RTC_CALR register  *****************/
#define RTC_CALR_CALP_POS            (15U)
#define RTC_CALR_CALP_MSK            (0x1UL << RTC_CALR_CALP_POS)               /*!< 0x00008000 */
#define RTC_CALR_CALP                RTC_CALR_CALP_MSK
#define RTC_CALR_CALW8_POS           (14U)
#define RTC_CALR_CALW8_MSK           (0x1UL << RTC_CALR_CALW8_POS)              /*!< 0x00004000 */
#define RTC_CALR_CALW8               RTC_CALR_CALW8_MSK
#define RTC_CALR_CALW16_POS          (13U)
#define RTC_CALR_CALW16_MSK          (0x1UL << RTC_CALR_CALW16_POS)             /*!< 0x00002000 */
#define RTC_CALR_CALW16              RTC_CALR_CALW16_MSK
#define RTC_CALR_CALM_POS            (0U)
#define RTC_CALR_CALM_MSK            (0x1FFUL << RTC_CALR_CALM_POS)             /*!< 0x000001FF */
#define RTC_CALR_CALM                RTC_CALR_CALM_MSK
#define RTC_CALR_CALM_0              (0x001UL << RTC_CALR_CALM_POS)             /*!< 0x00000001 */
#define RTC_CALR_CALM_1              (0x002UL << RTC_CALR_CALM_POS)             /*!< 0x00000002 */
#define RTC_CALR_CALM_2              (0x004UL << RTC_CALR_CALM_POS)             /*!< 0x00000004 */
#define RTC_CALR_CALM_3              (0x008UL << RTC_CALR_CALM_POS)             /*!< 0x00000008 */
#define RTC_CALR_CALM_4              (0x010UL << RTC_CALR_CALM_POS)             /*!< 0x00000010 */
#define RTC_CALR_CALM_5              (0x020UL << RTC_CALR_CALM_POS)             /*!< 0x00000020 */
#define RTC_CALR_CALM_6              (0x040UL << RTC_CALR_CALM_POS)             /*!< 0x00000040 */
#define RTC_CALR_CALM_7              (0x080UL << RTC_CALR_CALM_POS)             /*!< 0x00000080 */
#define RTC_CALR_CALM_8              (0x100UL << RTC_CALR_CALM_POS)             /*!< 0x00000100 */

/********************  Bits definition for RTC_SHIFTR register  ***************/
#define RTC_SHIFTR_SUBFS_POS         (0U)
#define RTC_SHIFTR_SUBFS_MSK         (0x7FFFUL << RTC_SHIFTR_SUBFS_POS)         /*!< 0x00007FFF */
#define RTC_SHIFTR_SUBFS             RTC_SHIFTR_SUBFS_MSK
#define RTC_SHIFTR_ADD1S_POS         (31U)
#define RTC_SHIFTR_ADD1S_MSK         (0x1UL << RTC_SHIFTR_ADD1S_POS)            /*!< 0x80000000 */
#define RTC_SHIFTR_ADD1S             RTC_SHIFTR_ADD1S_MSK

/********************  Bits definition for RTC_TSTR register  *****************/
#define RTC_TSTR_PM_POS              (22U)
#define RTC_TSTR_PM_MSK              (0x1UL << RTC_TSTR_PM_POS)                /*!< 0x00400000 */
#define RTC_TSTR_PM                  RTC_TSTR_PM_MSK                           /*!< AM-PM notation > */
#define RTC_TSTR_HT_POS              (20U)
#define RTC_TSTR_HT_MSK              (0x3UL << RTC_TSTR_HT_POS)                /*!< 0x00300000 */
#define RTC_TSTR_HT                  RTC_TSTR_HT_MSK
#define RTC_TSTR_HT_0                (0x1UL << RTC_TSTR_HT_POS)                /*!< 0x00100000 */
#define RTC_TSTR_HT_1                (0x2UL << RTC_TSTR_HT_POS)                /*!< 0x00200000 */
#define RTC_TSTR_HU_POS              (16U)
#define RTC_TSTR_HU_MSK              (0xFUL << RTC_TSTR_HU_POS)                /*!< 0x000F0000 */
#define RTC_TSTR_HU                  RTC_TSTR_HU_MSK
#define RTC_TSTR_HU_0                (0x1UL << RTC_TSTR_HU_POS)                /*!< 0x00010000 */
#define RTC_TSTR_HU_1                (0x2UL << RTC_TSTR_HU_POS)                /*!< 0x00020000 */
#define RTC_TSTR_HU_2                (0x4UL << RTC_TSTR_HU_POS)                /*!< 0x00040000 */
#define RTC_TSTR_HU_3                (0x8UL << RTC_TSTR_HU_POS)                /*!< 0x00080000 */
#define RTC_TSTR_MNT_POS             (12U)
#define RTC_TSTR_MNT_MSK             (0x7UL << RTC_TSTR_MNT_POS)               /*!< 0x00007000 */
#define RTC_TSTR_MNT                 RTC_TSTR_MNT_MSK
#define RTC_TSTR_MNT_0               (0x1UL << RTC_TSTR_MNT_POS)               /*!< 0x00001000 */
#define RTC_TSTR_MNT_1               (0x2UL << RTC_TSTR_MNT_POS)               /*!< 0x00002000 */
#define RTC_TSTR_MNT_2               (0x4UL << RTC_TSTR_MNT_POS)                /*!< 0x00004000 */
#define RTC_TSTR_MNU_POS             (8U)
#define RTC_TSTR_MNU_MSK             (0xFUL << RTC_TSTR_MNU_POS)                /*!< 0x00000F00 */
#define RTC_TSTR_MNU                 RTC_TSTR_MNU_MSK
#define RTC_TSTR_MNU_0               (0x1UL << RTC_TSTR_MNU_POS)                /*!< 0x00000100 */
#define RTC_TSTR_MNU_1               (0x2UL << RTC_TSTR_MNU_POS)                /*!< 0x00000200 */
#define RTC_TSTR_MNU_2               (0x4UL << RTC_TSTR_MNU_POS)                /*!< 0x00000400 */
#define RTC_TSTR_MNU_3               (0x8UL << RTC_TSTR_MNU_POS)                /*!< 0x00000800 */
#define RTC_TSTR_ST_POS              (4U)
#define RTC_TSTR_ST_MSK              (0x7UL << RTC_TSTR_ST_POS)                 /*!< 0x00000070 */
#define RTC_TSTR_ST                  RTC_TSTR_ST_MSK
#define RTC_TSTR_ST_0                (0x1UL << RTC_TSTR_ST_POS)                 /*!< 0x00000010 */
#define RTC_TSTR_ST_1                (0x2UL << RTC_TSTR_ST_POS)                 /*!< 0x00000020 */
#define RTC_TSTR_ST_2                (0x4UL << RTC_TSTR_ST_POS)                 /*!< 0x00000040 */
#define RTC_TSTR_SU_POS              (0U)
#define RTC_TSTR_SU_MSK              (0xFUL << RTC_TSTR_SU_POS)                 /*!< 0x0000000F */
#define RTC_TSTR_SU                  RTC_TSTR_SU_MSK
#define RTC_TSTR_SU_0                (0x1UL << RTC_TSTR_SU_POS)                 /*!< 0x00000001 */
#define RTC_TSTR_SU_1                (0x2UL << RTC_TSTR_SU_POS)                 /*!< 0x00000002 */
#define RTC_TSTR_SU_2                (0x4UL << RTC_TSTR_SU_POS)                 /*!< 0x00000004 */
#define RTC_TSTR_SU_3                (0x8UL << RTC_TSTR_SU_POS)                 /*!< 0x00000008 */

/********************  Bits definition for RTC_TSDR register  *****************/
#define RTC_TSDR_WDU_POS             (13U)
#define RTC_TSDR_WDU_MSK             (0x7UL << RTC_TSDR_WDU_POS)               /*!< 0x0000E000 */
#define RTC_TSDR_WDU                 RTC_TSDR_WDU_MSK                          /*!< Week day units > */
#define RTC_TSDR_WDU_0               (0x1UL << RTC_TSDR_WDU_POS)               /*!< 0x00002000 */
#define RTC_TSDR_WDU_1               (0x2UL << RTC_TSDR_WDU_POS)               /*!< 0x00004000 */
#define RTC_TSDR_WDU_2               (0x4UL << RTC_TSDR_WDU_POS)               /*!< 0x00008000 */
#define RTC_TSDR_MT_POS              (12U)
#define RTC_TSDR_MT_MSK              (0x1UL << RTC_TSDR_MT_POS)                /*!< 0x00001000 */
#define RTC_TSDR_MT                  RTC_TSDR_MT_MSK
#define RTC_TSDR_MU_POS              (8U)
#define RTC_TSDR_MU_MSK              (0xFUL << RTC_TSDR_MU_POS)                /*!< 0x00000F00 */
#define RTC_TSDR_MU                  RTC_TSDR_MU_MSK
#define RTC_TSDR_MU_0                (0x1UL << RTC_TSDR_MU_POS)                /*!< 0x00000100 */
#define RTC_TSDR_MU_1                (0x2UL << RTC_TSDR_MU_POS)                /*!< 0x00000200 */
#define RTC_TSDR_MU_2                (0x4UL << RTC_TSDR_MU_POS)                /*!< 0x00000400 */
#define RTC_TSDR_MU_3                (0x8UL << RTC_TSDR_MU_POS)                /*!< 0x00000800 */
#define RTC_TSDR_DT_POS              (4U)
#define RTC_TSDR_DT_MSK              (0x3UL << RTC_TSDR_DT_POS)                /*!< 0x00000030 */
#define RTC_TSDR_DT                  RTC_TSDR_DT_MSK
#define RTC_TSDR_DT_0                (0x1UL << RTC_TSDR_DT_POS)                /*!< 0x00000010 */
#define RTC_TSDR_DT_1                (0x2UL << RTC_TSDR_DT_POS)                /*!< 0x00000020 */
#define RTC_TSDR_DU_POS              (0U)
#define RTC_TSDR_DU_MSK              (0xFUL << RTC_TSDR_DU_POS)                /*!< 0x0000000F */
#define RTC_TSDR_DU                  RTC_TSDR_DU_MSK
#define RTC_TSDR_DU_0                (0x1UL << RTC_TSDR_DU_POS)                /*!< 0x00000001 */
#define RTC_TSDR_DU_1                (0x2UL << RTC_TSDR_DU_POS)                /*!< 0x00000002 */
#define RTC_TSDR_DU_2                (0x4UL << RTC_TSDR_DU_POS)                /*!< 0x00000004 */
#define RTC_TSDR_DU_3                (0x8UL << RTC_TSDR_DU_POS)                /*!< 0x00000008 */

/********************  Bits definition for RTC_TSSSR register  ****************/
#define RTC_TSSSR_SS_POS             (0U)
#define RTC_TSSSR_SS_MSK             (0xFFFFUL << RTC_TSSSR_SS_POS)            /*!< 0x0000FFFF */
#define RTC_TSSSR_SS                 RTC_TSSSR_SS_MSK                          /*!< Sub second value > */

/********************  Bits definition for RTC_ALRMAR register  ***************/
#define RTC_ALRMAR_MSK4_POS          (31U)
#define RTC_ALRMAR_MSK4_MSK          (0x1UL << RTC_ALRMAR_MSK4_POS)            /*!< 0x80000000 */
#define RTC_ALRMAR_MSK4              RTC_ALRMAR_MSK4_MSK
#define RTC_ALRMAR_WDSEL_POS         (30U)
#define RTC_ALRMAR_WDSEL_MSK         (0x1UL << RTC_ALRMAR_WDSEL_POS)           /*!< 0x40000000 */
#define RTC_ALRMAR_WDSEL             RTC_ALRMAR_WDSEL_MSK
#define RTC_ALRMAR_DT_POS            (28U)
#define RTC_ALRMAR_DT_MSK            (0x3UL << RTC_ALRMAR_DT_POS)              /*!< 0x30000000 */
#define RTC_ALRMAR_DT                RTC_ALRMAR_DT_MSK
#define RTC_ALRMAR_DT_0              (0x1UL << RTC_ALRMAR_DT_POS)              /*!< 0x10000000 */
#define RTC_ALRMAR_DT_1              (0x2UL << RTC_ALRMAR_DT_POS)              /*!< 0x20000000 */
#define RTC_ALRMAR_DU_POS            (24U)
#define RTC_ALRMAR_DU_MSK            (0xFUL << RTC_ALRMAR_DU_POS)              /*!< 0x0F000000 */
#define RTC_ALRMAR_DU                RTC_ALRMAR_DU_MSK
#define RTC_ALRMAR_DU_0              (0x1UL << RTC_ALRMAR_DU_POS)              /*!< 0x01000000 */
#define RTC_ALRMAR_DU_1              (0x2UL << RTC_ALRMAR_DU_POS)              /*!< 0x02000000 */
#define RTC_ALRMAR_DU_2              (0x4UL << RTC_ALRMAR_DU_POS)              /*!< 0x04000000 */
#define RTC_ALRMAR_DU_3              (0x8UL << RTC_ALRMAR_DU_POS)              /*!< 0x08000000 */
#define RTC_ALRMAR_MSK3_POS          (23U)
#define RTC_ALRMAR_MSK3_MSK          (0x1UL << RTC_ALRMAR_MSK3_POS)            /*!< 0x00800000 */
#define RTC_ALRMAR_MSK3              RTC_ALRMAR_MSK3_MSK
#define RTC_ALRMAR_PM_POS            (22U)
#define RTC_ALRMAR_PM_MSK            (0x1UL << RTC_ALRMAR_PM_POS)              /*!< 0x00400000 */
#define RTC_ALRMAR_PM                RTC_ALRMAR_PM_MSK
#define RTC_ALRMAR_HT_POS            (20U)
#define RTC_ALRMAR_HT_MSK            (0x3UL << RTC_ALRMAR_HT_POS)              /*!< 0x00300000 */
#define RTC_ALRMAR_HT                RTC_ALRMAR_HT_MSK
#define RTC_ALRMAR_HT_0              (0x1UL << RTC_ALRMAR_HT_POS)              /*!< 0x00100000 */
#define RTC_ALRMAR_HT_1              (0x2UL << RTC_ALRMAR_HT_POS)              /*!< 0x00200000 */
#define RTC_ALRMAR_HU_POS            (16U)
#define RTC_ALRMAR_HU_MSK            (0xFUL << RTC_ALRMAR_HU_POS)              /*!< 0x000F0000 */
#define RTC_ALRMAR_HU                RTC_ALRMAR_HU_MSK
#define RTC_ALRMAR_HU_0              (0x1UL << RTC_ALRMAR_HU_POS)              /*!< 0x00010000 */
#define RTC_ALRMAR_HU_1              (0x2UL << RTC_ALRMAR_HU_POS)              /*!< 0x00020000 */
#define RTC_ALRMAR_HU_2              (0x4UL << RTC_ALRMAR_HU_POS)              /*!< 0x00040000 */
#define RTC_ALRMAR_HU_3              (0x8UL << RTC_ALRMAR_HU_POS)              /*!< 0x00080000 */
#define RTC_ALRMAR_MSK2_POS          (15U)
#define RTC_ALRMAR_MSK2_MSK          (0x1UL << RTC_ALRMAR_MSK2_POS)            /*!< 0x00008000 */
#define RTC_ALRMAR_MSK2              RTC_ALRMAR_MSK2_MSK
#define RTC_ALRMAR_MNT_POS           (12U)
#define RTC_ALRMAR_MNT_MSK           (0x7UL << RTC_ALRMAR_MNT_POS)             /*!< 0x00007000 */
#define RTC_ALRMAR_MNT               RTC_ALRMAR_MNT_MSK
#define RTC_ALRMAR_MNT_0             (0x1UL << RTC_ALRMAR_MNT_POS)             /*!< 0x00001000 */
#define RTC_ALRMAR_MNT_1             (0x2UL << RTC_ALRMAR_MNT_POS)             /*!< 0x00002000 */
#define RTC_ALRMAR_MNT_2             (0x4UL << RTC_ALRMAR_MNT_POS)             /*!< 0x00004000 */
#define RTC_ALRMAR_MNU_POS           (8U)
#define RTC_ALRMAR_MNU_MSK           (0xFUL << RTC_ALRMAR_MNU_POS)             /*!< 0x00000F00 */
#define RTC_ALRMAR_MNU               RTC_ALRMAR_MNU_MSK
#define RTC_ALRMAR_MNU_0             (0x1UL << RTC_ALRMAR_MNU_POS)             /*!< 0x00000100 */
#define RTC_ALRMAR_MNU_1             (0x2UL << RTC_ALRMAR_MNU_POS)             /*!< 0x00000200 */
#define RTC_ALRMAR_MNU_2             (0x4UL << RTC_ALRMAR_MNU_POS)             /*!< 0x00000400 */
#define RTC_ALRMAR_MNU_3             (0x8UL << RTC_ALRMAR_MNU_POS)             /*!< 0x00000800 */
#define RTC_ALRMAR_MSK1_POS          (7U)
#define RTC_ALRMAR_MSK1_MSK          (0x1UL << RTC_ALRMAR_MSK1_POS)            /*!< 0x00000080 */
#define RTC_ALRMAR_MSK1              RTC_ALRMAR_MSK1_MSK
#define RTC_ALRMAR_ST_POS            (4U)
#define RTC_ALRMAR_ST_MSK            (0x7UL << RTC_ALRMAR_ST_POS)              /*!< 0x00000070 */
#define RTC_ALRMAR_ST                RTC_ALRMAR_ST_MSK
#define RTC_ALRMAR_ST_0              (0x1UL << RTC_ALRMAR_ST_POS)              /*!< 0x00000010 */
#define RTC_ALRMAR_ST_1              (0x2UL << RTC_ALRMAR_ST_POS)              /*!< 0x00000020 */
#define RTC_ALRMAR_ST_2              (0x4UL << RTC_ALRMAR_ST_POS)              /*!< 0x00000040 */
#define RTC_ALRMAR_SU_POS            (0U)
#define RTC_ALRMAR_SU_MSK            (0xFUL << RTC_ALRMAR_SU_POS)              /*!< 0x0000000F */
#define RTC_ALRMAR_SU                RTC_ALRMAR_SU_MSK
#define RTC_ALRMAR_SU_0              (0x1UL << RTC_ALRMAR_SU_POS)              /*!< 0x00000001 */
#define RTC_ALRMAR_SU_1              (0x2UL << RTC_ALRMAR_SU_POS)              /*!< 0x00000002 */
#define RTC_ALRMAR_SU_2              (0x4UL << RTC_ALRMAR_SU_POS)              /*!< 0x00000004 */
#define RTC_ALRMAR_SU_3              (0x8UL << RTC_ALRMAR_SU_POS)              /*!< 0x00000008 */

