ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMASSR_MASKSS_POS      (24U)
#define RTC_ALRMASSR_MASKSS_MSK      (0xFUL << RTC_ALRMASSR_MASKSS_POS)        /*!< 0x0F000000 */
#define RTC_ALRMASSR_MASKSS          RTC_ALRMASSR_MASKSS_MSK
#define RTC_ALRMASSR_MASKSS_0        (0x1UL << RTC_ALRMASSR_MASKSS_POS)        /*!< 0x01000000 */
#define RTC_ALRMASSR_MASKSS_1        (0x2UL << RTC_ALRMASSR_MASKSS_POS)        /*!< 0x02000000 */
#define RTC_ALRMASSR_MASKSS_2        (0x4UL << RTC_ALRMASSR_MASKSS_POS)        /*!< 0x04000000 */
#define RTC_ALRMASSR_MASKSS_3        (0x8UL << RTC_ALRMASSR_MASKSS_POS)        /*!< 0x08000000 */
#define RTC_ALRMASSR_SS_POS          (0U)
#define RTC_ALRMASSR_SS_MSK          (0x7FFFUL << RTC_ALRMASSR_SS_POS)         /*!< 0x00007FFF */
#define RTC_ALRMASSR_SS              RTC_ALRMASSR_SS_MSK

/********************  Bits definition for RTC_ALRMBR register  ***************/
#define RTC_ALRMBR_MSK4_POS          (31U)
#define RTC_ALRMBR_MSK4_MSK          (0x1UL << RTC_ALRMBR_MSK4_POS)            /*!< 0x80000000 */
#define RTC_ALRMBR_MSK4              RTC_ALRMBR_MSK4_MSK
#define RTC_ALRMBR_WDSEL_POS         (30U)
#define RTC_ALRMBR_WDSEL_MSK         (0x1UL << RTC_ALRMBR_WDSEL_POS)           /*!< 0x40000000 */
#define RTC_ALRMBR_WDSEL             RTC_ALRMBR_WDSEL_MSK
#define RTC_ALRMBR_DT_POS            (28U)
#define RTC_ALRMBR_DT_MSK            (0x3UL << RTC_ALRMBR_DT_POS)              /*!< 0x30000000 */
#define RTC_ALRMBR_DT                RTC_ALRMBR_DT_MSK
#define RTC_ALRMBR_DT_0              (0x1UL << RTC_ALRMBR_DT_POS)              /*!< 0x10000000 */
#define RTC_ALRMBR_DT_1              (0x2UL << RTC_ALRMBR_DT_POS)              /*!< 0x20000000 */
#define RTC_ALRMBR_DU_POS            (24U)
#define RTC_ALRMBR_DU_MSK            (0xFUL << RTC_ALRMBR_DU_POS)              /*!< 0x0F000000 */
#define RTC_ALRMBR_DU                RTC_ALRMBR_DU_MSK
#define RTC_ALRMBR_DU_0              (0x1UL << RTC_ALRMBR_DU_POS)              /*!< 0x01000000 */
#define RTC_ALRMBR_DU_1              (0x2UL << RTC_ALRMBR_DU_POS)              /*!< 0x02000000 */
#define RTC_ALRMBR_DU_2              (0x4UL << RTC_ALRMBR_DU_POS)              /*!< 0x04000000 */
#define RTC_ALRMBR_DU_3              (0x8UL << RTC_ALRMBR_DU_POS)              /*!< 0x08000000 */
#define RTC_ALRMBR_MSK3_POS          (23U)
#define RTC_ALRMBR_MSK3_MSK          (0x1UL << RTC_ALRMBR_MSK3_POS)            /*!< 0x00800000 */
#define RTC_ALRMBR_MSK3              RTC_ALRMBR_MSK3_MSK
#define RTC_ALRMBR_PM_POS            (22U)
#define RTC_ALRMBR_PM_MSK            (0x1UL << RTC_ALRMBR_PM_POS)              /*!< 0x00400000 */
#define RTC_ALRMBR_PM                RTC_ALRMBR_PM_MSK
#define RTC_ALRMBR_HT_POS            (20U)
#define RTC_ALRMBR_HT_MSK            (0x3UL << RTC_ALRMBR_HT_POS)              /*!< 0x00300000 */
#define RTC_ALRMBR_HT                RTC_ALRMBR_HT_MSK
#define RTC_ALRMBR_HT_0              (0x1UL << RTC_ALRMBR_HT_POS)              /*!< 0x00100000 */
#define RTC_ALRMBR_HT_1              (0x2UL << RTC_ALRMBR_HT_POS)              /*!< 0x00200000 */
#define RTC_ALRMBR_HU_POS            (16U)
#define RTC_ALRMBR_HU_MSK            (0xFUL << RTC_ALRMBR_HU_POS)              /*!< 0x000F0000 */
#define RTC_ALRMBR_HU                RTC_ALRMBR_HU_MSK
#define RTC_ALRMBR_HU_0              (0x1UL << RTC_ALRMBR_HU_POS)              /*!< 0x00010000 */
#define RTC_ALRMBR_HU_1              (0x2UL << RTC_ALRMBR_HU_POS)              /*!< 0x00020000 */
#define RTC_ALRMBR_HU_2              (0x4UL << RTC_ALRMBR_HU_POS)              /*!< 0x00040000 */
#define RTC_ALRMBR_HU_3              (0x8UL << RTC_ALRMBR_HU_POS)              /*!< 0x00080000 */
#define RTC_ALRMBR_MSK2_POS          (15U)
#define RTC_ALRMBR_MSK2_MSK          (0x1UL << RTC_ALRMBR_MSK2_POS)            /*!< 0x00008000 */
#define RTC_ALRMBR_MSK2              RTC_ALRMBR_MSK2_MSK
#define RTC_ALRMBR_MNT_POS           (12U)
#define RTC_ALRMBR_MNT_MSK           (0x7UL << RTC_ALRMBR_MNT_POS)             /*!< 0x00007000 */
#define RTC_ALRMBR_MNT               RTC_ALRMBR_MNT_MSK
#define RTC_ALRMBR_MNT_0             (0x1UL << RTC_ALRMBR_MNT_POS)             /*!< 0x00001000 */
#define RTC_ALRMBR_MNT_1             (0x2UL << RTC_ALRMBR_MNT_POS)             /*!< 0x00002000 */
#define RTC_ALRMBR_MNT_2             (0x4UL << RTC_ALRMBR_MNT_POS)             /*!< 0x00004000 */
#define RTC_ALRMBR_MNU_POS           (8U)
#define RTC_ALRMBR_MNU_MSK           (0xFUL << RTC_ALRMBR_MNU_POS)             /*!< 0x00000F00 */
#define RTC_ALRMBR_MNU               RTC_ALRMBR_MNU_MSK
#define RTC_ALRMBR_MNU_0             (0x1UL << RTC_ALRMBR_MNU_POS)             /*!< 0x00000100 */
#define RTC_ALRMBR_MNU_1             (0x2UL << RTC_ALRMBR_MNU_POS)             /*!< 0x00000200 */
#define RTC_ALRMBR_MNU_2             (0x4UL << RTC_ALRMBR_MNU_POS)             /*!< 0x00000400 */
#define RTC_ALRMBR_MNU_3             (0x8UL << RTC_ALRMBR_MNU_POS)             /*!< 0x00000800 */
#define RTC_ALRMBR_MSK1_POS          (7U)
#define RTC_ALRMBR_MSK1_MSK          (0x1UL << RTC_ALRMBR_MSK1_POS)            /*!< 0x00000080 */
#define RTC_ALRMBR_MSK1              RTC_ALRMBR_MSK1_MSK
#define RTC_ALRMBR_ST_POS            (4U)
#define RTC_ALRMBR_ST_MSK            (0x7UL << RTC_ALRMBR_ST_POS)              /*!< 0x00000070 */
#define RTC_ALRMBR_ST                RTC_ALRMBR_ST_MSK
#define RTC_ALRMBR_ST_0              (0x1UL << RTC_ALRMBR_ST_POS)              /*!< 0x00000010 */
#define RTC_ALRMBR_ST_1              (0x2UL << RTC_ALRMBR_ST_POS)              /*!< 0x00000020 */
#define RTC_ALRMBR_ST_2              (0x4UL << RTC_ALRMBR_ST_POS)              /*!< 0x00000040 */
#define RTC_ALRMBR_SU_POS            (0U)
#define RTC_ALRMBR_SU_MSK            (0xFUL << RTC_ALRMBR_SU_POS)              /*!< 0x0000000F */
#define RTC_ALRMBR_SU                RTC_ALRMBR_SU_MSK
#define RTC_ALRMBR_SU_0              (0x1UL << RTC_ALRMBR_SU_POS)              /*!< 0x00000001 */
#define RTC_ALRMBR_SU_1              (0x2UL << RTC_ALRMBR_SU_POS)              /*!< 0x00000002 */
#define RTC_ALRMBR_SU_2              (0x4UL << RTC_ALRMBR_SU_POS)              /*!< 0x00000004 */
#define RTC_ALRMBR_SU_3              (0x8UL << RTC_ALRMBR_SU_POS)              /*!< 0x00000008 */

