ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMBSSR_MASKSS_POS      (24U)
#define RTC_ALRMBSSR_MASKSS_MSK      (0xFUL << RTC_ALRMBSSR_MASKSS_POS)        /*!< 0x0F000000 */
#define RTC_ALRMBSSR_MASKSS          RTC_ALRMBSSR_MASKSS_MSK
#define RTC_ALRMBSSR_MASKSS_0        (0x1UL << RTC_ALRMBSSR_MASKSS_POS)        /*!< 0x01000000 */
#define RTC_ALRMBSSR_MASKSS_1        (0x2UL << RTC_ALRMBSSR_MASKSS_POS)        /*!< 0x02000000 */
#define RTC_ALRMBSSR_MASKSS_2        (0x4UL << RTC_ALRMBSSR_MASKSS_POS)        /*!< 0x04000000 */
#define RTC_ALRMBSSR_MASKSS_3        (0x8UL << RTC_ALRMBSSR_MASKSS_POS)        /*!< 0x08000000 */
#define RTC_ALRMBSSR_SS_POS          (0U)
#define RTC_ALRMBSSR_SS_MSK          (0x7FFFUL << RTC_ALRMBSSR_SS_POS)         /*!< 0x00007FFF */
#define RTC_ALRMBSSR_SS              RTC_ALRMBSSR_SS_MSK

/********************  Bits definition for RTC_SR register  *******************/
#define RTC_SR_ITSF_POS              (5U)
#define RTC_SR_ITSF_MSK              (0x1UL << RTC_SR_ITSF_POS)                /*!< 0x00000020 */
#define RTC_SR_ITSF                  RTC_SR_ITSF_MSK
#define RTC_SR_TSOVF_POS             (4U)
#define RTC_SR_TSOVF_MSK             (0x1UL << RTC_SR_TSOVF_POS)               /*!< 0x00000010 */
#define RTC_SR_TSOVF                 RTC_SR_TSOVF_MSK                          /*!< Timestamp overflow flag > */
#define RTC_SR_TSF_POS               (3U)
#define RTC_SR_TSF_MSK               (0x1UL << RTC_SR_TSF_POS)                 /*!< 0x00000008 */
#define RTC_SR_TSF                   RTC_SR_TSF_MSK                            /*!< Timestamp flag > */
#define RTC_SR_WUTF_POS              (2U)
#define RTC_SR_WUTF_MSK              (0x1UL << RTC_SR_WUTF_POS)                /*!< 0x00000004 */
#define RTC_SR_WUTF                  RTC_SR_WUTF_MSK                           /*!< Wakeup timer flag > */
#define RTC_SR_ALRBF_POS             (1U)
#define RTC_SR_ALRBF_MSK             (0x1UL << RTC_SR_ALRBF_POS)               /*!< 0x00000002 */
#define RTC_SR_ALRBF                 RTC_SR_ALRBF_MSK
#define RTC_SR_ALRAF_POS             (0U)
#define RTC_SR_ALRAF_MSK             (0x1UL << RTC_SR_ALRAF_POS)               /*!< 0x00000001 */
#define RTC_SR_ALRAF                 RTC_SR_ALRAF_MSK

/********************  Bits definition for RTC_MISR register  *****************/
#define RTC_MISR_ITSMF_POS           (5U)
#define RTC_MISR_ITSMF_MSK           (0x1UL << RTC_MISR_ITSMF_POS)             /*!< 0x00000020 */
#define RTC_MISR_ITSMF               RTC_MISR_ITSMF_MSK
#define RTC_MISR_TSOVMF_POS          (4U)
#define RTC_MISR_TSOVMF_MSK          (0x1UL << RTC_MISR_TSOVMF_POS)            /*!< 0x00000010 */
#define RTC_MISR_TSOVMF              RTC_MISR_TSOVMF_MSK                       /*!< Timestamp overflow masked flag > */
#define RTC_MISR_TSMF_POS            (3U)
#define RTC_MISR_TSMF_MSK            (0x1UL << RTC_MISR_TSMF_POS)              /*!< 0x00000008 */
#define RTC_MISR_TSMF                RTC_MISR_TSMF_MSK                         /*!< Timestamp masked flag > */
#define RTC_MISR_WUTMF_POS           (2U)
#define RTC_MISR_WUTMF_MSK           (0x1UL << RTC_MISR_WUTMF_POS)             /*!< 0x00000004 */
#define RTC_MISR_WUTMF               RTC_MISR_WUTMF_MSK                        /*!< Wakeup timer masked flag > */
#define RTC_MISR_ALRBMF_POS          (1U)
#define RTC_MISR_ALRBMF_MSK          (0x1UL << RTC_MISR_ALRBMF_POS)            /*!< 0x00000002 */
#define RTC_MISR_ALRBMF              RTC_MISR_ALRBMF_MSK
#define RTC_MISR_ALRAMF_POS          (0U)
#define RTC_MISR_ALRAMF_MSK          (0x1UL << RTC_MISR_ALRAMF_POS)            /*!< 0x00000001 */
#define RTC_MISR_ALRAMF              RTC_MISR_ALRAMF_MSK

/********************  Bits definition for RTC_SCR register  ******************/
#define RTC_SCR_CITSF_POS            (5U)
#define RTC_SCR_CITSF_MSK            (0x1UL << RTC_SCR_CITSF_POS)              /*!< 0x00000020 */
#define RTC_SCR_CITSF                RTC_SCR_CITSF_MSK
#define RTC_SCR_CTSOVF_POS           (4U)
#define RTC_SCR_CTSOVF_MSK           (0x1UL << RTC_SCR_CTSOVF_POS)             /*!< 0x00000010 */
#define RTC_SCR_CTSOVF               RTC_SCR_CTSOVF_MSK                        /*!< Clear timestamp overflow flag > */
#define RTC_SCR_CTSF_POS             (3U)
#define RTC_SCR_CTSF_MSK             (0x1UL << RTC_SCR_CTSF_POS)               /*!< 0x00000008 */
#define RTC_SCR_CTSF                 RTC_SCR_CTSF_MSK                          /*!< Clear timestamp flag > */
#define RTC_SCR_CWUTF_POS            (2U)
#define RTC_SCR_CWUTF_MSK            (0x1UL << RTC_SCR_CWUTF_POS)              /*!< 0x00000004 */
#define RTC_SCR_CWUTF                RTC_SCR_CWUTF_MSK                         /*!< Clear wakeup timer flag > */
#define RTC_SCR_CALRBF_POS           (1U)
#define RTC_SCR_CALRBF_MSK           (0x1UL << RTC_SCR_CALRBF_POS)             /*!< 0x00000002 */
#define RTC_SCR_CALRBF               RTC_SCR_CALRBF_MSK
#define RTC_SCR_CALRAF_POS           (0U)
#define RTC_SCR_CALRAF_MSK           (0x1UL << RTC_SCR_CALRAF_POS)             /*!< 0x00000001 */
#define RTC_SCR_CALRAF               RTC_SCR_CALRAF_MSK





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- SPI REGISTERS ----------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief Serial Peripheral Interface( SPI )
 */
typedef struct
{
    volatile uint16 CR1;        //! SPI Control register 1 (not used in I2S mode),
    uint16  RESERVED0;          //! Reserved, 0x02
    volatile uint16 CR2;        //! SPI Control register 2,
    uint16  RESERVED1;          //! Reserved, 0x06
    volatile uint16 SR;         //! SPI Status register,
    uint16  RESERVED2;          //! Reserved, 0x0A
    volatile uint16 DR;         //! SPI data register,
    uint16  RESERVED3;          //! Reserved, 0x0E
    volatile uint16 CRCPR;      //! SPI CRC polynomial register (not used in I2S mode),
    uint16  RESERVED4;          //! Reserved, 0x12
    volatile uint16 RXCRCR;     //! SPI Rx CRC register (not used in I2S mode),
    uint16  RESERVED5;          //! Reserved, 0x16
    volatile uint16 TXCRCR;     //! SPI Tx CRC register (not used in I2S mode),
    uint16  RESERVED6;          //! Reserved, 0x1A
    volatile uint16 I2SCFGR;    //! SPI_I2S configuration register,
    uint16  RESERVED7;          //! Reserved, 0x1E
    volatile uint16 I2SPR;      //! SPI_I2S prescaler register,
    uint16  RESERVED8;          //! Reserved, 0x22
} SPI_BASIC_DEF;

