ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define SPI_1                (*(SPI_BASIC_DEF *) SPI1_BASE)
#define SPI_2                (*(SPI_BASIC_DEF *) SPI2_BASE)
#define SPI_3                (*(SPI_BASIC_DEF *) SPI3_BASE)

/*******************  Bit definition for SPI_CR1 register  ********************/
#define SPI_CR1_CPHA_POS            (0U)
#define SPI_CR1_CPHA_MSK            (0x1UL << SPI_CR1_CPHA_POS)                /*!< 0x00000001 */
#define SPI_CR1_CPHA                SPI_CR1_CPHA_MSK                           /*!<Clock Phase      */
#define SPI_CR1_CPOL_POS            (1U)
#define SPI_CR1_CPOL_MSK            (0x1UL << SPI_CR1_CPOL_POS)                /*!< 0x00000002 */
#define SPI_CR1_CPOL                SPI_CR1_CPOL_MSK                           /*!<Clock Polarity   */
#define SPI_CR1_MSTR_POS            (2U)
#define SPI_CR1_MSTR_MSK            (0x1UL << SPI_CR1_MSTR_POS)                /*!< 0x00000004 */
#define SPI_CR1_MSTR                SPI_CR1_MSTR_MSK                           /*!<Master Selection */

#define SPI_CR1_BR_POS              (3U)
#define SPI_CR1_BR_MSK              (0x7UL << SPI_CR1_BR_POS)                  /*!< 0x00000038 */
#define SPI_CR1_BR                  SPI_CR1_BR_MSK                             /*!<BR[2:0] bits (Baud Rate Control) */
#define SPI_CR1_BR_0                (0x1UL << SPI_CR1_BR_POS)                  /*!< 0x00000008 */
#define SPI_CR1_BR_1                (0x2UL << SPI_CR1_BR_POS)                  /*!< 0x00000010 */
#define SPI_CR1_BR_2                (0x4UL << SPI_CR1_BR_POS)                  /*!< 0x00000020 */

#define SPI_CR1_SPE_POS             (6U)
#define SPI_CR1_SPE_MSK             (0x1UL << SPI_CR1_SPE_POS)                 /*!< 0x00000040 */
#define SPI_CR1_SPE                 SPI_CR1_SPE_MSK                            /*!<SPI Enable                          */
#define SPI_CR1_LSBFIRST_POS        (7U)
#define SPI_CR1_LSBFIRST_MSK        (0x1UL << SPI_CR1_LSBFIRST_POS)            /*!< 0x00000080 */
#define SPI_CR1_LSBFIRST            SPI_CR1_LSBFIRST_MSK                       /*!<Frame Format                        */
#define SPI_CR1_SSI_POS             (8U)
#define SPI_CR1_SSI_MSK             (0x1UL << SPI_CR1_SSI_POS)                 /*!< 0x00000100 */
#define SPI_CR1_SSI                 SPI_CR1_SSI_MSK                            /*!<Internal slave select               */
#define SPI_CR1_SSM_POS             (9U)
#define SPI_CR1_SSM_MSK             (0x1UL << SPI_CR1_SSM_POS)                 /*!< 0x00000200 */
#define SPI_CR1_SSM                 SPI_CR1_SSM_MSK                            /*!<Software slave management           */
#define SPI_CR1_RXONLY_POS          (10U)
#define SPI_CR1_RXONLY_MSK          (0x1UL << SPI_CR1_RXONLY_POS)              /*!< 0x00000400 */
#define SPI_CR1_RXONLY              SPI_CR1_RXONLY_MSK                         /*!<Receive only                        */
#define SPI_CR1_CRCL_POS            (11U)
#define SPI_CR1_CRCL_MSK            (0x1UL << SPI_CR1_CRCL_POS)                /*!< 0x00000800 */
#define SPI_CR1_CRCL                SPI_CR1_CRCL_MSK                           /*!< CRC Length */
#define SPI_CR1_CRCNEXT_POS         (12U)
#define SPI_CR1_CRCNEXT_MSK         (0x1UL << SPI_CR1_CRCNEXT_POS)             /*!< 0x00001000 */
#define SPI_CR1_CRCNEXT             SPI_CR1_CRCNEXT_MSK                        /*!<Transmit CRC next                   */
#define SPI_CR1_CRCEN_POS           (13U)
#define SPI_CR1_CRCEN_MSK           (0x1UL << SPI_CR1_CRCEN_POS)               /*!< 0x00002000 */
#define SPI_CR1_CRCEN               SPI_CR1_CRCEN_MSK                          /*!<Hardware CRC calculation enable     */
#define SPI_CR1_BIDIOE_POS          (14U)
#define SPI_CR1_BIDIOE_MSK          (0x1UL << SPI_CR1_BIDIOE_POS)              /*!< 0x00004000 */
#define SPI_CR1_BIDIOE              SPI_CR1_BIDIOE_MSK                         /*!<Output enable in bidirectional mode */
#define SPI_CR1_BIDIMODE_POS        (15U)
#define SPI_CR1_BIDIMODE_MSK        (0x1UL << SPI_CR1_BIDIMODE_POS)            /*!< 0x00008000 */
#define SPI_CR1_BIDIMODE            SPI_CR1_BIDIMODE_MSK                       /*!<Bidirectional data mode enable      */

/*******************  Bit definition for SPI_CR2 register  ********************/
#define SPI_CR2_RXDMAEN_POS         (0U)
#define SPI_CR2_RXDMAEN_MSK         (0x1UL << SPI_CR2_RXDMAEN_POS)             /*!< 0x00000001 */
#define SPI_CR2_RXDMAEN             SPI_CR2_RXDMAEN_MSK                        /*!< Rx Buffer DMA Enable */
#define SPI_CR2_TXDMAEN_POS         (1U)
#define SPI_CR2_TXDMAEN_MSK         (0x1UL << SPI_CR2_TXDMAEN_POS)             /*!< 0x00000002 */
#define SPI_CR2_TXDMAEN             SPI_CR2_TXDMAEN_MSK                        /*!< Tx Buffer DMA Enable */
#define SPI_CR2_SSOE_POS            (2U)
#define SPI_CR2_SSOE_MSK            (0x1UL << SPI_CR2_SSOE_POS)                /*!< 0x00000004 */
#define SPI_CR2_SSOE                SPI_CR2_SSOE_MSK                           /*!< SS Output Enable */
#define SPI_CR2_NSSP_POS            (3U)
#define SPI_CR2_NSSP_MSK            (0x1UL << SPI_CR2_NSSP_POS)                /*!< 0x00000008 */
#define SPI_CR2_NSSP                SPI_CR2_NSSP_MSK                           /*!< NSS pulse management Enable */
#define SPI_CR2_FRF_POS             (4U)
#define SPI_CR2_FRF_MSK             (0x1UL << SPI_CR2_FRF_POS)                 /*!< 0x00000010 */
#define SPI_CR2_FRF                 SPI_CR2_FRF_MSK                            /*!< Frame Format Enable */
#define SPI_CR2_ERRIE_POS           (5U)
#define SPI_CR2_ERRIE_MSK           (0x1UL << SPI_CR2_ERRIE_POS)               /*!< 0x00000020 */
#define SPI_CR2_ERRIE               SPI_CR2_ERRIE_MSK                          /*!< Error Interrupt Enable */
#define SPI_CR2_RXNEIE_POS          (6U)
#define SPI_CR2_RXNEIE_MSK          (0x1UL << SPI_CR2_RXNEIE_POS)              /*!< 0x00000040 */
#define SPI_CR2_RXNEIE              SPI_CR2_RXNEIE_MSK                         /*!< RX buffer Not Empty Interrupt Enable */
#define SPI_CR2_TXEIE_POS           (7U)
#define SPI_CR2_TXEIE_MSK           (0x1UL << SPI_CR2_TXEIE_POS)               /*!< 0x00000080 */
#define SPI_CR2_TXEIE               SPI_CR2_TXEIE_MSK                          /*!< Tx buffer Empty Interrupt Enable */
#define SPI_CR2_DS_POS              (8U)
#define SPI_CR2_DS_MSK              (0xFUL << SPI_CR2_DS_POS)                  /*!< 0x00000F00 */
#define SPI_CR2_DS                  SPI_CR2_DS_MSK                             /*!< DS[3:0] Data Size */
#define SPI_CR2_DS_0                (0x1UL << SPI_CR2_DS_POS)                  /*!< 0x00000100 */
#define SPI_CR2_DS_1                (0x2UL << SPI_CR2_DS_POS)                  /*!< 0x00000200 */
#define SPI_CR2_DS_2                (0x4UL << SPI_CR2_DS_POS)                  /*!< 0x00000400 */
#define SPI_CR2_DS_3                (0x8UL << SPI_CR2_DS_POS)                  /*!< 0x00000800 */
#define SPI_CR2_FRXTH_POS           (12U)
#define SPI_CR2_FRXTH_MSK           (0x1UL << SPI_CR2_FRXTH_POS)               /*!< 0x00001000 */
#define SPI_CR2_FRXTH               SPI_CR2_FRXTH_MSK                          /*!< FIFO reception Threshold */
#define SPI_CR2_LDMARX_POS          (13U)
#define SPI_CR2_LDMARX_MSK          (0x1UL << SPI_CR2_LDMARX_POS)              /*!< 0x00002000 */
#define SPI_CR2_LDMARX              SPI_CR2_LDMARX_MSK                         /*!< Last DMA transfer for reception */
#define SPI_CR2_LDMATX_POS          (14U)
#define SPI_CR2_LDMATX_MSK          (0x1UL << SPI_CR2_LDMATX_POS)              /*!< 0x00004000 */
#define SPI_CR2_LDMATX              SPI_CR2_LDMATX_MSK                         /*!< Last DMA transfer for transmission */

/********************  Bit definition for SPI_SR register  ********************/
#define SPI_SR_RXNE_POS             (0U)
#define SPI_SR_RXNE_MSK             (0x1UL << SPI_SR_RXNE_POS)                 /*!< 0x00000001 */
#define SPI_SR_RXNE                 SPI_SR_RXNE_MSK                            /*!< Receive buffer Not Empty */
#define SPI_SR_TXE_POS              (1U)
#define SPI_SR_TXE_MSK              (0x1UL << SPI_SR_TXE_POS)                  /*!< 0x00000002 */
#define SPI_SR_TXE                  SPI_SR_TXE_MSK                             /*!< Transmit buffer Empty */
#define SPI_SR_CHSIDE_POS           (2U)
#define SPI_SR_CHSIDE_MSK           (0x1UL << SPI_SR_CHSIDE_POS)               /*!< 0x00000004 */
#define SPI_SR_CHSIDE               SPI_SR_CHSIDE_MSK                          /*!< CHANNEL side */
#define SPI_SR_UDR_POS              (3U)
#define SPI_SR_UDR_MSK              (0x1UL << SPI_SR_UDR_POS)                  /*!< 0x00000008 */
#define SPI_SR_UDR                  SPI_SR_UDR_MSK                             /*!< Underrun flag */
#define SPI_SR_CRCERR_POS           (4U)
#define SPI_SR_CRCERR_MSK           (0x1UL << SPI_SR_CRCERR_POS)               /*!< 0x00000010 */
#define SPI_SR_CRCERR               SPI_SR_CRCERR_MSK                          /*!< CRC Error flag */
#define SPI_SR_MODF_POS             (5U)
#define SPI_SR_MODF_MSK             (0x1UL << SPI_SR_MODF_POS)                 /*!< 0x00000020 */
#define SPI_SR_MODF                 SPI_SR_MODF_MSK                            /*!< Mode fault */
#define SPI_SR_OVR_POS              (6U)
#define SPI_SR_OVR_MSK              (0x1UL << SPI_SR_OVR_POS)                  /*!< 0x00000040 */
#define SPI_SR_OVR                  SPI_SR_OVR_MSK                             /*!< Overrun flag */
#define SPI_SR_BSY_POS              (7U)
#define SPI_SR_BSY_MSK              (0x1UL << SPI_SR_BSY_POS)                  /*!< 0x00000080 */
#define SPI_SR_BSY                  SPI_SR_BSY_MSK                             /*!< Busy flag */
#define SPI_SR_FRE_POS              (8U)
#define SPI_SR_FRE_MSK              (0x1UL << SPI_SR_FRE_POS)                  /*!< 0x00000100 */
#define SPI_SR_FRE                  SPI_SR_FRE_MSK                             /*!< TI frame format error */
#define SPI_SR_FRLVL_POS            (9U)
#define SPI_SR_FRLVL_MSK            (0x3UL << SPI_SR_FRLVL_POS)                /*!< 0x00000600 */
#define SPI_SR_FRLVL                SPI_SR_FRLVL_MSK                           /*!< FIFO Reception Level */
#define SPI_SR_FRLVL_0              (0x1UL << SPI_SR_FRLVL_POS)                /*!< 0x00000200 */
#define SPI_SR_FRLVL_1              (0x2UL << SPI_SR_FRLVL_POS)                /*!< 0x00000400 */
#define SPI_SR_FTLVL_POS            (11U)
#define SPI_SR_FTLVL_MSK            (0x3UL << SPI_SR_FTLVL_POS)                /*!< 0x00001800 */
#define SPI_SR_FTLVL                SPI_SR_FTLVL_MSK                           /*!< FIFO Transmission Level */
#define SPI_SR_FTLVL_0              (0x1UL << SPI_SR_FTLVL_POS)                /*!< 0x00000800 */
#define SPI_SR_FTLVL_1              (0x2UL << SPI_SR_FTLVL_POS)                /*!< 0x00001000 */

/********************  Bit definition for SPI_DR register  ********************/
#define SPI_DR_DR_POS               (0U)
#define SPI_DR_DR_MSK               (0xFFFFUL << SPI_DR_DR_POS)                /*!< 0x0000FFFF */
#define SPI_DR_DR                   SPI_DR_DR_MSK                              /*!<Data Register           */

