ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for SPI_CRCPR register  ******************/
#define SPI_CRCPR_CRCPOLY_POS       (0U)
#define SPI_CRCPR_CRCPOLY_MSK       (0xFFFFUL << SPI_CRCPR_CRCPOLY_POS)        /*!< 0x0000FFFF */
#define SPI_CRCPR_CRCPOLY           SPI_CRCPR_CRCPOLY_MSK                      /*!<CRC polynomial register */

/******************  Bit definition for SPI_RXCRCR register  ******************/
#define SPI_RXCRCR_RXCRC_POS        (0U)
#define SPI_RXCRCR_RXCRC_MSK        (0xFFFFUL << SPI_RXCRCR_RXCRC_POS)         /*!< 0x0000FFFF */
#define SPI_RXCRCR_RXCRC            SPI_RXCRCR_RXCRC_MSK                       /*!<Rx CRC Register         */

/******************  Bit definition for SPI_TXCRCR register  ******************/
#define SPI_TXCRCR_TXCRC_POS        (0U)
#define SPI_TXCRCR_TXCRC_MSK        (0xFFFFUL << SPI_TXCRCR_TXCRC_POS)         /*!< 0x0000FFFF */
#define SPI_TXCRCR_TXCRC            SPI_TXCRCR_TXCRC_MSK                       /*!<Tx CRC Register         */

/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define SPI_I2SCFGR_CHLEN_POS       (0U)
#define SPI_I2SCFGR_CHLEN_MSK       (0x1UL << SPI_I2SCFGR_CHLEN_POS)           /*!< 0x00000001 */
#define SPI_I2SCFGR_CHLEN           SPI_I2SCFGR_CHLEN_MSK                      /*!<CHANNEL length (number of bits per audio channel) */
#define SPI_I2SCFGR_DATLEN_POS      (1U)
#define SPI_I2SCFGR_DATLEN_MSK      (0x3UL << SPI_I2SCFGR_DATLEN_POS)          /*!< 0x00000006 */
#define SPI_I2SCFGR_DATLEN          SPI_I2SCFGR_DATLEN_MSK                     /*!<DATLEN[1:0] bits (Data length to be transferred) */
#define SPI_I2SCFGR_DATLEN_0        (0x1UL << SPI_I2SCFGR_DATLEN_POS)          /*!< 0x00000002 */
#define SPI_I2SCFGR_DATLEN_1        (0x2UL << SPI_I2SCFGR_DATLEN_POS)          /*!< 0x00000004 */
#define SPI_I2SCFGR_CKPOL_POS       (3U)
#define SPI_I2SCFGR_CKPOL_MSK       (0x1UL << SPI_I2SCFGR_CKPOL_POS)           /*!< 0x00000008 */
#define SPI_I2SCFGR_CKPOL           SPI_I2SCFGR_CKPOL_MSK                      /*!<steady state clock polarity */
#define SPI_I2SCFGR_I2SSTD_POS      (4U)
#define SPI_I2SCFGR_I2SSTD_MSK      (0x3UL << SPI_I2SCFGR_I2SSTD_POS)          /*!< 0x00000030 */
#define SPI_I2SCFGR_I2SSTD          SPI_I2SCFGR_I2SSTD_MSK                     /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define SPI_I2SCFGR_I2SSTD_0        (0x1UL << SPI_I2SCFGR_I2SSTD_POS)          /*!< 0x00000010 */
#define SPI_I2SCFGR_I2SSTD_1        (0x2UL << SPI_I2SCFGR_I2SSTD_POS)          /*!< 0x00000020 */
#define SPI_I2SCFGR_PCMSYNC_POS     (7U)
#define SPI_I2SCFGR_PCMSYNC_MSK     (0x1UL << SPI_I2SCFGR_PCMSYNC_POS)         /*!< 0x00000080 */
#define SPI_I2SCFGR_PCMSYNC         SPI_I2SCFGR_PCMSYNC_MSK                    /*!<PCM frame synchronization */
#define SPI_I2SCFGR_I2SCFG_POS      (8U)
#define SPI_I2SCFGR_I2SCFG_MSK      (0x3UL << SPI_I2SCFGR_I2SCFG_POS)          /*!< 0x00000300 */
#define SPI_I2SCFGR_I2SCFG          SPI_I2SCFGR_I2SCFG_MSK                     /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define SPI_I2SCFGR_I2SCFG_0        (0x1UL << SPI_I2SCFGR_I2SCFG_POS)          /*!< 0x00000100 */
#define SPI_I2SCFGR_I2SCFG_1        (0x2UL << SPI_I2SCFGR_I2SCFG_POS)          /*!< 0x00000200 */
#define SPI_I2SCFGR_I2SE_POS        (10U)
#define SPI_I2SCFGR_I2SE_MSK        (0x1UL << SPI_I2SCFGR_I2SE_POS)            /*!< 0x00000400 */
#define SPI_I2SCFGR_I2SE            SPI_I2SCFGR_I2SE_MSK                       /*!<I2S Enable */
#define SPI_I2SCFGR_I2SMOD_POS      (11U)
#define SPI_I2SCFGR_I2SMOD_MSK      (0x1UL << SPI_I2SCFGR_I2SMOD_POS)          /*!< 0x00000800 */
#define SPI_I2SCFGR_I2SMOD          SPI_I2SCFGR_I2SMOD_MSK                     /*!<I2S mode selection */
#define SPI_I2SCFGR_ASTRTEN_POS     (12U)
#define SPI_I2SCFGR_ASTRTEN_MSK     (0x1UL << SPI_I2SCFGR_ASTRTEN_POS)         /*!< 0x00001000 */
#define SPI_I2SCFGR_ASTRTEN         SPI_I2SCFGR_ASTRTEN_MSK                    /*!<Asynchronous start enable */

/******************  Bit definition for SPI_I2SPR register  *******************/
#define SPI_I2SPR_I2SDIV_POS        (0U)
#define SPI_I2SPR_I2SDIV_MSK        (0xFFUL << SPI_I2SPR_I2SDIV_POS)           /*!< 0x000000FF */
#define SPI_I2SPR_I2SDIV            SPI_I2SPR_I2SDIV_MSK                       /*!<I2S Linear prescaler */
#define SPI_I2SPR_ODD_POS           (8U)
#define SPI_I2SPR_ODD_MSK           (0x1UL << SPI_I2SPR_ODD_POS)               /*!< 0x00000100 */
#define SPI_I2SPR_ODD               SPI_I2SPR_ODD_MSK                          /*!<Odd factor for the prescaler */
#define SPI_I2SPR_MCKOE_POS         (9U)
#define SPI_I2SPR_MCKOE_MSK         (0x1UL << SPI_I2SPR_MCKOE_POS)             /*!< 0x00000200 */
#define SPI_I2SPR_MCKOE             SPI_I2SPR_MCKOE_MSK                        /*!<Master Clock Output Enable */

#define SPI_BAUDRATEPRESCALER_2         (0x00000000U)
#define SPI_BAUDRATEPRESCALER_4         (SPI_CR1_BR_0)
#define SPI_BAUDRATEPRESCALER_8         (SPI_CR1_BR_1)
#define SPI_BAUDRATEPRESCALER_16        (SPI_CR1_BR_1 | SPI_CR1_BR_0)
#define SPI_BAUDRATEPRESCALER_32        (SPI_CR1_BR_2)
#define SPI_BAUDRATEPRESCALER_64        (SPI_CR1_BR_2 | SPI_CR1_BR_0)
#define SPI_BAUDRATEPRESCALER_128       (SPI_CR1_BR_2 | SPI_CR1_BR_1)
#define SPI_BAUDRATEPRESCALER_256       (SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0)


//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- I2C REGISTERS ----------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
 * @brief Inter-integrated Circuit Interface(I2C)
 */
typedef struct
{
  volatile uint32 CR1;         /*!< I2C Control register 1,            Address offset: 0x00 */
  volatile uint32 CR2;         /*!< I2C Control register 2,            Address offset: 0x04 */
  volatile uint32 OAR1;        /*!< I2C Own address 1 register,        Address offset: 0x08 */
  volatile uint32 OAR2;        /*!< I2C Own address 2 register,        Address offset: 0x0C */
  volatile uint32 TIMINGR;     /*!< I2C Timing register,               Address offset: 0x10 */
  volatile uint32 TIMEOUTR;    /*!< I2C Timeout register,              Address offset: 0x14 */
  volatile uint32 ISR;         /*!< I2C Interrupt and status register, Address offset: 0x18 */
  volatile uint32 ICR;         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
  volatile uint32 PECR;        /*!< I2C PEC register,                  Address offset: 0x20 */
  volatile uint32 RXDR;        /*!< I2C Receive data register,         Address offset: 0x24 */
  volatile uint32 TXDR;        /*!< I2C Transmit data register,        Address offset: 0x28 */
} I2C_TYPEDEF;

#define I2C_1                (*(I2C_TYPEDEF *) I2C1_BASE)
#define I2C_2                (*(I2C_TYPEDEF *) I2C2_BASE)
#define I2C_3                (*(I2C_TYPEDEF *) I2C3_BASE)

/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_POS               (0U)
#define I2C_CR1_PE_MSK               (0x1UL << I2C_CR1_PE_POS)                 /*!< 0x00000001 */
#define I2C_CR1_PE                   I2C_CR1_PE_MSK                            /*!< Peripheral enable */
#define I2C_CR1_TXIE_POS             (1U)
#define I2C_CR1_TXIE_MSK             (0x1UL << I2C_CR1_TXIE_POS)               /*!< 0x00000002 */
#define I2C_CR1_TXIE                 I2C_CR1_TXIE_MSK                          /*!< TX interrupt enable */
#define I2C_CR1_RXIE_POS             (2U)
#define I2C_CR1_RXIE_MSK             (0x1UL << I2C_CR1_RXIE_POS)               /*!< 0x00000004 */
#define I2C_CR1_RXIE                 I2C_CR1_RXIE_MSK                          /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_POS           (3U)
#define I2C_CR1_ADDRIE_MSK           (0x1UL << I2C_CR1_ADDRIE_POS)             /*!< 0x00000008 */
#define I2C_CR1_ADDRIE               I2C_CR1_ADDRIE_MSK                        /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE_POS           (4U)
#define I2C_CR1_NACKIE_MSK           (0x1UL << I2C_CR1_NACKIE_POS)             /*!< 0x00000010 */
#define I2C_CR1_NACKIE               I2C_CR1_NACKIE_MSK                        /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE_POS           (5U)
#define I2C_CR1_STOPIE_MSK           (0x1UL << I2C_CR1_STOPIE_POS)             /*!< 0x00000020 */
#define I2C_CR1_STOPIE               I2C_CR1_STOPIE_MSK                        /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_POS             (6U)
#define I2C_CR1_TCIE_MSK             (0x1UL << I2C_CR1_TCIE_POS)               /*!< 0x00000040 */
#define I2C_CR1_TCIE                 I2C_CR1_TCIE_MSK                          /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE_POS            (7U)
#define I2C_CR1_ERRIE_MSK            (0x1UL << I2C_CR1_ERRIE_POS)              /*!< 0x00000080 */
#define I2C_CR1_ERRIE                I2C_CR1_ERRIE_MSK                         /*!< Errors interrupt enable */
#define I2C_CR1_DNF_POS              (8U)
#define I2C_CR1_DNF_MSK              (0xFUL << I2C_CR1_DNF_POS)                /*!< 0x00000F00 */
#define I2C_CR1_DFN                  I2C_CR1_DNF_MSK                           /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_POS           (12U)
#define I2C_CR1_ANFOFF_MSK           (0x1UL << I2C_CR1_ANFOFF_POS)             /*!< 0x00001000 */
#define I2C_CR1_ANFOFF               I2C_CR1_ANFOFF_MSK                        /*!< Analog noise filter OFF */
#define I2C_CR1_SWRST_POS            (13U)
#define I2C_CR1_SWRST_MSK            (0x1UL << I2C_CR1_SWRST_POS)              /*!< 0x00002000 */
#define I2C_CR1_SWRST                I2C_CR1_SWRST_MSK                         /*!< Software reset */
#define I2C_CR1_TXDMAEN_POS          (14U)
#define I2C_CR1_TXDMAEN_MSK          (0x1UL << I2C_CR1_TXDMAEN_POS)            /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN              I2C_CR1_TXDMAEN_MSK                       /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_POS          (15U)
#define I2C_CR1_RXDMAEN_MSK          (0x1UL << I2C_CR1_RXDMAEN_POS)            /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN              I2C_CR1_RXDMAEN_MSK                       /*!< DMA reception requests enable */
#define I2C_CR1_SBC_POS              (16U)
#define I2C_CR1_SBC_MSK              (0x1UL << I2C_CR1_SBC_POS)                /*!< 0x00010000 */
#define I2C_CR1_SBC                  I2C_CR1_SBC_MSK                           /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_POS        (17U)
#define I2C_CR1_NOSTRETCH_MSK        (0x1UL << I2C_CR1_NOSTRETCH_POS)          /*!< 0x00020000 */
#define I2C_CR1_NOSTRETCH            I2C_CR1_NOSTRETCH_MSK                     /*!< Clock stretching disable */
#define I2C_CR1_WUPEN_POS            (18U)
#define I2C_CR1_WUPEN_MSK            (0x1UL << I2C_CR1_WUPEN_POS)              /*!< 0x00040000 */
#define I2C_CR1_WUPEN                I2C_CR1_WUPEN_MSK                         /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN_POS             (19U)
#define I2C_CR1_GCEN_MSK             (0x1UL << I2C_CR1_GCEN_POS)               /*!< 0x00080000 */
#define I2C_CR1_GCEN                 I2C_CR1_GCEN_MSK                          /*!< General call enable */
#define I2C_CR1_SMBHEN_POS           (20U)
#define I2C_CR1_SMBHEN_MSK           (0x1UL << I2C_CR1_SMBHEN_POS)             /*!< 0x00100000 */
#define I2C_CR1_SMBHEN               I2C_CR1_SMBHEN_MSK                        /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_POS           (21U)
#define I2C_CR1_SMBDEN_MSK           (0x1UL << I2C_CR1_SMBDEN_POS)             /*!< 0x00200000 */
#define I2C_CR1_SMBDEN               I2C_CR1_SMBDEN_MSK                        /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_POS          (22U)
#define I2C_CR1_ALERTEN_MSK          (0x1UL << I2C_CR1_ALERTEN_POS)            /*!< 0x00400000 */
#define I2C_CR1_ALERTEN              I2C_CR1_ALERTEN_MSK                       /*!< SMBus alert enable */
#define I2C_CR1_PECEN_POS            (23U)
#define I2C_CR1_PECEN_MSK            (0x1UL << I2C_CR1_PECEN_POS)              /*!< 0x00800000 */
#define I2C_CR1_PECEN                I2C_CR1_PECEN_MSK                         /*!< PEC enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_POS             (0U)
#define I2C_CR2_SADD_MSK             (0x3FFUL << I2C_CR2_SADD_POS)             /*!< 0x000003FF */
#define I2C_CR2_SADD                 I2C_CR2_SADD_MSK                          /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_POS           (10U)
#define I2C_CR2_RD_WRN_MSK           (0x1UL << I2C_CR2_RD_WRN_POS)             /*!< 0x00000400 */
#define I2C_CR2_RD_WRN               I2C_CR2_RD_WRN_MSK                        /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_POS            (11U)
#define I2C_CR2_ADD10_MSK            (0x1UL << I2C_CR2_ADD10_POS)              /*!< 0x00000800 */
#define I2C_CR2_ADD10                I2C_CR2_ADD10_MSK                         /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_POS          (12U)
#define I2C_CR2_HEAD10R_MSK          (0x1UL << I2C_CR2_HEAD10R_POS)            /*!< 0x00001000 */
#define I2C_CR2_HEAD10R              I2C_CR2_HEAD10R_MSK                       /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START_POS            (13U)
#define I2C_CR2_START_MSK            (0x1UL << I2C_CR2_START_POS)              /*!< 0x00002000 */
#define I2C_CR2_START                I2C_CR2_START_MSK                         /*!< START generation */
#define I2C_CR2_STOP_POS             (14U)
#define I2C_CR2_STOP_MSK             (0x1UL << I2C_CR2_STOP_POS)               /*!< 0x00004000 */
#define I2C_CR2_STOP                 I2C_CR2_STOP_MSK                          /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_POS             (15U)
#define I2C_CR2_NACK_MSK             (0x1UL << I2C_CR2_NACK_POS)               /*!< 0x00008000 */
#define I2C_CR2_NACK                 I2C_CR2_NACK_MSK                          /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_POS           (16U)
#define I2C_CR2_NBYTES_MSK           (0xFFUL << I2C_CR2_NBYTES_POS)            /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES               I2C_CR2_NBYTES_MSK                        /*!< Number of bytes */
#define I2C_CR2_RELOAD_POS           (24U)
#define I2C_CR2_RELOAD_MSK           (0x1UL << I2C_CR2_RELOAD_POS)             /*!< 0x01000000 */
#define I2C_CR2_RELOAD               I2C_CR2_RELOAD_MSK                        /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_POS          (25U)
#define I2C_CR2_AUTOEND_MSK          (0x1UL << I2C_CR2_AUTOEND_POS)            /*!< 0x02000000 */
#define I2C_CR2_AUTOEND              I2C_CR2_AUTOEND_MSK                       /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_POS          (26U)
#define I2C_CR2_PECBYTE_MSK          (0x1UL << I2C_CR2_PECBYTE_POS)            /*!< 0x04000000 */
#define I2C_CR2_PECBYTE              I2C_CR2_PECBYTE_MSK                       /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_POS             (0U)
#define I2C_OAR1_OA1_MSK             (0x3FFUL << I2C_OAR1_OA1_POS)             /*!< 0x000003FF */
#define I2C_OAR1_OA1                 I2C_OAR1_OA1_MSK                          /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_POS         (10U)
#define I2C_OAR1_OA1MODE_MSK         (0x1UL << I2C_OAR1_OA1MODE_POS)           /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE             I2C_OAR1_OA1MODE_MSK                      /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN_POS           (15U)
#define I2C_OAR1_OA1EN_MSK           (0x1UL << I2C_OAR1_OA1EN_POS)             /*!< 0x00008000 */
#define I2C_OAR1_OA1EN               I2C_OAR1_OA1EN_MSK                        /*!< Own address 1 enable */

