ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for I2C_OAR2 register  ******************/
#define I2C_OAR2_OA2_POS             (1U)
#define I2C_OAR2_OA2_MSK             (0x7FUL << I2C_OAR2_OA2_POS)              /*!< 0x000000FE */
#define I2C_OAR2_OA2                 I2C_OAR2_OA2_MSK                          /*!< Interface own address 2 */
#define I2C_OAR2_OA2MSK_POS          (8U)
#define I2C_OAR2_OA2MSK_MSK          (0x7UL << I2C_OAR2_OA2MSK_POS)            /*!< 0x00000700 */
#define I2C_OAR2_OA2MSK              I2C_OAR2_OA2MSK_MSK                       /*!< Own address 2 masks */
#define I2C_OAR2_OA2NOMASK           (0U)                                      /*!< No mask                                        */
#define I2C_OAR2_OA2MASK01_POS       (8U)
#define I2C_OAR2_OA2MASK01_MSK       (0x1UL << I2C_OAR2_OA2MASK01_POS)         /*!< 0x00000100 */
#define I2C_OAR2_OA2MASK01           I2C_OAR2_OA2MASK01_MSK                    /*!< OA2[1] is masked, Only OA2[7:2] are compared   */
#define I2C_OAR2_OA2MASK02_POS       (9U)
#define I2C_OAR2_OA2MASK02_MSK       (0x1UL << I2C_OAR2_OA2MASK02_POS)         /*!< 0x00000200 */
#define I2C_OAR2_OA2MASK02           I2C_OAR2_OA2MASK02_MSK                    /*!< OA2[2:1] is masked, Only OA2[7:3] are compared */
#define I2C_OAR2_OA2MASK03_POS       (8U)
#define I2C_OAR2_OA2MASK03_MSK       (0x3UL << I2C_OAR2_OA2MASK03_POS)         /*!< 0x00000300 */
#define I2C_OAR2_OA2MASK03           I2C_OAR2_OA2MASK03_MSK                    /*!< OA2[3:1] is masked, Only OA2[7:4] are compared */
#define I2C_OAR2_OA2MASK04_POS       (10U)
#define I2C_OAR2_OA2MASK04_MSK       (0x1UL << I2C_OAR2_OA2MASK04_POS)         /*!< 0x00000400 */
#define I2C_OAR2_OA2MASK04           I2C_OAR2_OA2MASK04_MSK                    /*!< OA2[4:1] is masked, Only OA2[7:5] are compared */
#define I2C_OAR2_OA2MASK05_POS       (8U)
#define I2C_OAR2_OA2MASK05_MSK       (0x5UL << I2C_OAR2_OA2MASK05_POS)         /*!< 0x00000500 */
#define I2C_OAR2_OA2MASK05           I2C_OAR2_OA2MASK05_MSK                    /*!< OA2[5:1] is masked, Only OA2[7:6] are compared */
#define I2C_OAR2_OA2MASK06_POS       (9U)
#define I2C_OAR2_OA2MASK06_MSK       (0x3UL << I2C_OAR2_OA2MASK06_POS)         /*!< 0x00000600 */
#define I2C_OAR2_OA2MASK06           I2C_OAR2_OA2MASK06_MSK                    /*!< OA2[6:1] is masked, Only OA2[7] are compared   */
#define I2C_OAR2_OA2MASK07_POS       (8U)
#define I2C_OAR2_OA2MASK07_MSK       (0x7UL << I2C_OAR2_OA2MASK07_POS)         /*!< 0x00000700 */
#define I2C_OAR2_OA2MASK07           I2C_OAR2_OA2MASK07_MSK                    /*!< OA2[7:1] is masked, No comparison is done      */
#define I2C_OAR2_OA2EN_POS           (15U)
#define I2C_OAR2_OA2EN_MSK           (0x1UL << I2C_OAR2_OA2EN_POS)             /*!< 0x00008000 */
#define I2C_OAR2_OA2EN               I2C_OAR2_OA2EN_MSK                        /*!< Own address 2 enable */

/*******************  Bit definition for I2C_TIMINGR register *******************/
#define I2C_TIMINGR_SCLL_POS         (0U)
#define I2C_TIMINGR_SCLL_MSK         (0xFFUL << I2C_TIMINGR_SCLL_POS)          /*!< 0x000000FF */
#define I2C_TIMINGR_SCLL             I2C_TIMINGR_SCLL_MSK                      /*!< SCL low period (master mode) */
#define I2C_TIMINGR_SCLH_POS         (8U)
#define I2C_TIMINGR_SCLH_MSK         (0xFFUL << I2C_TIMINGR_SCLH_POS)          /*!< 0x0000FF00 */
#define I2C_TIMINGR_SCLH             I2C_TIMINGR_SCLH_MSK                      /*!< SCL high period (master mode) */
#define I2C_TIMINGR_SDADEL_POS       (16U)
#define I2C_TIMINGR_SDADEL_MSK       (0xFUL << I2C_TIMINGR_SDADEL_POS)         /*!< 0x000F0000 */
#define I2C_TIMINGR_SDADEL           I2C_TIMINGR_SDADEL_MSK                    /*!< Data hold time */
#define I2C_TIMINGR_SCLDEL_POS       (20U)
#define I2C_TIMINGR_SCLDEL_MSK       (0xFUL << I2C_TIMINGR_SCLDEL_POS)         /*!< 0x00F00000 */
#define I2C_TIMINGR_SCLDEL           I2C_TIMINGR_SCLDEL_MSK                    /*!< Data setup time */
#define I2C_TIMINGR_PRESC_POS        (28U)
#define I2C_TIMINGR_PRESC_MSK        (0xFUL << I2C_TIMINGR_PRESC_POS)          /*!< 0xF0000000 */
#define I2C_TIMINGR_PRESC            I2C_TIMINGR_PRESC_MSK                     /*!< Timings prescaler */

/******************* Bit definition for I2C_TIMEOUTR register *******************/
#define I2C_TIMEOUTR_TIMEOUTA_POS    (0U)
#define I2C_TIMEOUTR_TIMEOUTA_MSK    (0xFFFUL << I2C_TIMEOUTR_TIMEOUTA_POS)    /*!< 0x00000FFF */
#define I2C_TIMEOUTR_TIMEOUTA        I2C_TIMEOUTR_TIMEOUTA_MSK                 /*!< Bus timeout A */
#define I2C_TIMEOUTR_TIDLE_POS       (12U)
#define I2C_TIMEOUTR_TIDLE_MSK       (0x1UL << I2C_TIMEOUTR_TIDLE_POS)         /*!< 0x00001000 */
#define I2C_TIMEOUTR_TIDLE           I2C_TIMEOUTR_TIDLE_MSK                    /*!< Idle clock timeout detection */
#define I2C_TIMEOUTR_TIMOUTEN_POS    (15U)
#define I2C_TIMEOUTR_TIMOUTEN_MSK    (0x1UL << I2C_TIMEOUTR_TIMOUTEN_POS)      /*!< 0x00008000 */
#define I2C_TIMEOUTR_TIMOUTEN        I2C_TIMEOUTR_TIMOUTEN_MSK                 /*!< Clock timeout enable */
#define I2C_TIMEOUTR_TIMEOUTB_POS    (16U)
#define I2C_TIMEOUTR_TIMEOUTB_MSK    (0xFFFUL << I2C_TIMEOUTR_TIMEOUTB_POS)    /*!< 0x0FFF0000 */
#define I2C_TIMEOUTR_TIMEOUTB        I2C_TIMEOUTR_TIMEOUTB_MSK                 /*!< Bus timeout B*/
#define I2C_TIMEOUTR_TEXTEN_POS      (31U)
#define I2C_TIMEOUTR_TEXTEN_MSK      (0x1UL << I2C_TIMEOUTR_TEXTEN_POS)        /*!< 0x80000000 */
#define I2C_TIMEOUTR_TEXTEN          I2C_TIMEOUTR_TEXTEN_MSK                   /*!< Extended clock timeout enable */

/******************  Bit definition for I2C_ISR register  *********************/
#define I2C_ISR_TXE_POS              (0U)
#define I2C_ISR_TXE_MSK              (0x1UL << I2C_ISR_TXE_POS)                /*!< 0x00000001 */
#define I2C_ISR_TXE                  I2C_ISR_TXE_MSK                           /*!< Transmit data register empty */
#define I2C_ISR_TXIS_POS             (1U)
#define I2C_ISR_TXIS_MSK             (0x1UL << I2C_ISR_TXIS_POS)               /*!< 0x00000002 */
#define I2C_ISR_TXIS                 I2C_ISR_TXIS_MSK                          /*!< Transmit interrupt status */
#define I2C_ISR_RXNE_POS             (2U)
#define I2C_ISR_RXNE_MSK             (0x1UL << I2C_ISR_RXNE_POS)               /*!< 0x00000004 */
#define I2C_ISR_RXNE                 I2C_ISR_RXNE_MSK                          /*!< Receive data register not empty */
#define I2C_ISR_ADDR_POS             (3U)
#define I2C_ISR_ADDR_MSK             (0x1UL << I2C_ISR_ADDR_POS)               /*!< 0x00000008 */
#define I2C_ISR_ADDR                 I2C_ISR_ADDR_MSK                          /*!< Address matched (slave mode)*/
#define I2C_ISR_NACKF_POS            (4U)
#define I2C_ISR_NACKF_MSK            (0x1UL << I2C_ISR_NACKF_POS)              /*!< 0x00000010 */
#define I2C_ISR_NACKF                I2C_ISR_NACKF_MSK                         /*!< NACK received flag */
#define I2C_ISR_STOPF_POS            (5U)
#define I2C_ISR_STOPF_MSK            (0x1UL << I2C_ISR_STOPF_POS)              /*!< 0x00000020 */
#define I2C_ISR_STOPF                I2C_ISR_STOPF_MSK                         /*!< STOP detection flag */
#define I2C_ISR_TC_POS               (6U)
#define I2C_ISR_TC_MSK               (0x1UL << I2C_ISR_TC_POS)                 /*!< 0x00000040 */
#define I2C_ISR_TC                   I2C_ISR_TC_MSK                            /*!< Transfer complete (master mode) */
#define I2C_ISR_TCR_POS              (7U)
#define I2C_ISR_TCR_MSK              (0x1UL << I2C_ISR_TCR_POS)                /*!< 0x00000080 */
#define I2C_ISR_TCR                  I2C_ISR_TCR_MSK                           /*!< Transfer complete reload */
#define I2C_ISR_BERR_POS             (8U)
#define I2C_ISR_BERR_MSK             (0x1UL << I2C_ISR_BERR_POS)               /*!< 0x00000100 */
#define I2C_ISR_BERR                 I2C_ISR_BERR_MSK                          /*!< Bus error */
#define I2C_ISR_ARLO_POS             (9U)
#define I2C_ISR_ARLO_MSK             (0x1UL << I2C_ISR_ARLO_POS)               /*!< 0x00000200 */
#define I2C_ISR_ARLO                 I2C_ISR_ARLO_MSK                          /*!< Arbitration lost */
#define I2C_ISR_OVR_POS              (10U)
#define I2C_ISR_OVR_MSK              (0x1UL << I2C_ISR_OVR_POS)                /*!< 0x00000400 */
#define I2C_ISR_OVR                  I2C_ISR_OVR_MSK                           /*!< Overrun/Underrun */
#define I2C_ISR_PECERR_POS           (11U)
#define I2C_ISR_PECERR_MSK           (0x1UL << I2C_ISR_PECERR_POS)             /*!< 0x00000800 */
#define I2C_ISR_PECERR               I2C_ISR_PECERR_MSK                        /*!< PEC error in reception */
#define I2C_ISR_TIMEOUT_POS          (12U)
#define I2C_ISR_TIMEOUT_MSK          (0x1UL << I2C_ISR_TIMEOUT_POS)            /*!< 0x00001000 */
#define I2C_ISR_TIMEOUT              I2C_ISR_TIMEOUT_MSK                       /*!< Timeout or Tlow detection flag */
#define I2C_ISR_ALERT_POS            (13U)
#define I2C_ISR_ALERT_MSK            (0x1UL << I2C_ISR_ALERT_POS)              /*!< 0x00002000 */
#define I2C_ISR_ALERT                I2C_ISR_ALERT_MSK                         /*!< SMBus alert */
#define I2C_ISR_BUSY_POS             (15U)
#define I2C_ISR_BUSY_MSK             (0x1UL << I2C_ISR_BUSY_POS)               /*!< 0x00008000 */
#define I2C_ISR_BUSY                 I2C_ISR_BUSY_MSK                          /*!< Bus busy */
#define I2C_ISR_DIR_POS              (16U)
#define I2C_ISR_DIR_MSK              (0x1UL << I2C_ISR_DIR_POS)                /*!< 0x00010000 */
#define I2C_ISR_DIR                  I2C_ISR_DIR_MSK                           /*!< Transfer direction (slave mode) */
#define I2C_ISR_ADDCODE_POS          (17U)
#define I2C_ISR_ADDCODE_MSK          (0x7FUL << I2C_ISR_ADDCODE_POS)           /*!< 0x00FE0000 */
#define I2C_ISR_ADDCODE              I2C_ISR_ADDCODE_MSK                       /*!< Address match code (slave mode) */

/******************  Bit definition for I2C_ICR register  *********************/
#define I2C_ICR_ADDRCF_POS           (3U)
#define I2C_ICR_ADDRCF_MSK           (0x1UL << I2C_ICR_ADDRCF_POS)             /*!< 0x00000008 */
#define I2C_ICR_ADDRCF               I2C_ICR_ADDRCF_MSK                        /*!< Address matched clear flag */
#define I2C_ICR_NACKCF_POS           (4U)
#define I2C_ICR_NACKCF_MSK           (0x1UL << I2C_ICR_NACKCF_POS)             /*!< 0x00000010 */
#define I2C_ICR_NACKCF               I2C_ICR_NACKCF_MSK                        /*!< NACK clear flag */
#define I2C_ICR_STOPCF_POS           (5U)
#define I2C_ICR_STOPCF_MSK           (0x1UL << I2C_ICR_STOPCF_POS)             /*!< 0x00000020 */
#define I2C_ICR_STOPCF               I2C_ICR_STOPCF_MSK                        /*!< STOP detection clear flag */
#define I2C_ICR_BERRCF_POS           (8U)
#define I2C_ICR_BERRCF_MSK           (0x1UL << I2C_ICR_BERRCF_POS)             /*!< 0x00000100 */
#define I2C_ICR_BERRCF               I2C_ICR_BERRCF_MSK                        /*!< Bus error clear flag */
#define I2C_ICR_ARLOCF_POS           (9U)
#define I2C_ICR_ARLOCF_MSK           (0x1UL << I2C_ICR_ARLOCF_POS)             /*!< 0x00000200 */
#define I2C_ICR_ARLOCF               I2C_ICR_ARLOCF_MSK                        /*!< Arbitration lost clear flag */
#define I2C_ICR_OVRCF_POS            (10U)
#define I2C_ICR_OVRCF_MSK            (0x1UL << I2C_ICR_OVRCF_POS)              /*!< 0x00000400 */
#define I2C_ICR_OVRCF                I2C_ICR_OVRCF_MSK                         /*!< Overrun/Underrun clear flag */
#define I2C_ICR_PECCF_POS            (11U)
#define I2C_ICR_PECCF_MSK            (0x1UL << I2C_ICR_PECCF_POS)              /*!< 0x00000800 */
#define I2C_ICR_PECCF                I2C_ICR_PECCF_MSK                         /*!< PAC error clear flag */
#define I2C_ICR_TIMOUTCF_POS         (12U)
#define I2C_ICR_TIMOUTCF_MSK         (0x1UL << I2C_ICR_TIMOUTCF_POS)           /*!< 0x00001000 */
#define I2C_ICR_TIMOUTCF             I2C_ICR_TIMOUTCF_MSK                      /*!< Timeout clear flag */
#define I2C_ICR_ALERTCF_POS          (13U)
#define I2C_ICR_ALERTCF_MSK          (0x1UL << I2C_ICR_ALERTCF_POS)            /*!< 0x00002000 */
#define I2C_ICR_ALERTCF              I2C_ICR_ALERTCF_MSK                       /*!< Alert clear flag */

