ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bit definition for I2C_PECR register  *********************/
#define I2C_PECR_PEC_POS             (0U)
#define I2C_PECR_PEC_MSK             (0xFFUL << I2C_PECR_PEC_POS)              /*!< 0x000000FF */
#define I2C_PECR_PEC                 I2C_PECR_PEC_MSK                          /*!< PEC register */

/******************  Bit definition for I2C_RXDR register  *********************/
#define I2C_RXDR_RXDATA_POS          (0U)
#define I2C_RXDR_RXDATA_MSK          (0xFFUL << I2C_RXDR_RXDATA_POS)           /*!< 0x000000FF */
#define I2C_RXDR_RXDATA              I2C_RXDR_RXDATA_MSK                       /*!< 8-bit receive data */

/******************  Bit definition for I2C_TXDR register  *********************/
#define I2C_TXDR_TXDATA_POS          (0U)
#define I2C_TXDR_TXDATA_MSK          (0xFFUL << I2C_TXDR_TXDATA_POS)           /*!< 0x000000FF */
#define I2C_TXDR_TXDATA              I2C_TXDR_TXDATA_MSK                       /*!< 8-bit transmit data */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- USART REGISTERS --------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
typedef struct
{
  volatile uint32 CR1;         /*!< USART Control register 1,                 Address offset: 0x00  */
  volatile uint32 CR2;         /*!< USART Control register 2,                 Address offset: 0x04  */
  volatile uint32 CR3;         /*!< USART Control register 3,                 Address offset: 0x08  */
  volatile uint32 BRR;         /*!< USART Baud rate register,                 Address offset: 0x0C  */
  volatile uint32 GTPR;        /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
  volatile uint32 RTOR;        /*!< USART Receiver Time Out register,         Address offset: 0x14  */
  volatile uint32 RQR;         /*!< USART Request register,                   Address offset: 0x18  */
  volatile uint32 ISR;         /*!< USART Interrupt and status register,      Address offset: 0x1C  */
  volatile uint32 ICR;         /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
  volatile uint32 RDR;         /*!< USART Receive Data register,              Address offset: 0x24  */
  volatile uint32 TDR;         /*!< USART Transmit Data register,             Address offset: 0x28  */
  volatile uint32 PRESC;       /*!< USART Prescaler register,                 Address offset: 0x2C  */
} USART_TYPEDEF;

#define USART1              (*(USART_TYPEDEF *) USART1_BASE)
#define USART2              (*(USART_TYPEDEF *) USART2_BASE)
#define USART3              (*(USART_TYPEDEF *) USART3_BASE)
#define USART4              (*(USART_TYPEDEF *) USART4_BASE)
#define USART5              (*(USART_TYPEDEF *) USART5_BASE)
#define USART6              (*(USART_TYPEDEF *) USART6_BASE)

#define LPUART1             (*(USART_TYPEDEF *) LPUART1_BASE)
#define LPUART2             (*(USART_TYPEDEF *) LPUART2_BASE)

/******************  Bit definition for USART_CR1 register  *******************/
#define USART_CR1_UE_POS             (0U)
#define USART_CR1_UE_MSK             (0x1UL << USART_CR1_UE_POS)               /*!< 0x00000001 */
#define USART_CR1_UE                 USART_CR1_UE_MSK                          /*!< USART Enable */
#define USART_CR1_UESM_POS           (1U)
#define USART_CR1_UESM_MSK           (0x1UL << USART_CR1_UESM_POS)             /*!< 0x00000002 */
#define USART_CR1_UESM               USART_CR1_UESM_MSK                        /*!< USART Enable in STOP Mode */
#define USART_CR1_RE_POS             (2U)
#define USART_CR1_RE_MSK             (0x1UL << USART_CR1_RE_POS)               /*!< 0x00000004 */
#define USART_CR1_RE                 USART_CR1_RE_MSK                          /*!< Receiver Enable */
#define USART_CR1_TE_POS             (3U)
#define USART_CR1_TE_MSK             (0x1UL << USART_CR1_TE_POS)               /*!< 0x00000008 */
#define USART_CR1_TE                 USART_CR1_TE_MSK                          /*!< Transmitter Enable */
#define USART_CR1_IDLEIE_POS         (4U)
#define USART_CR1_IDLEIE_MSK         (0x1UL << USART_CR1_IDLEIE_POS)           /*!< 0x00000010 */
#define USART_CR1_IDLEIE             USART_CR1_IDLEIE_MSK                      /*!< IDLE Interrupt Enable */
#define USART_CR1_RXNEIE_RXFNEIE_POS   (5U)
#define USART_CR1_RXNEIE_RXFNEIE_MSK   (0x1UL << USART_CR1_RXNEIE_RXFNEIE_POS) /*!< 0x00000020 */
#define USART_CR1_RXNEIE             USART_CR1_RXNEIE_RXFNEIE_MSK            /*!< RXNE/RXFIFO not empty Interrupt Enable */
#define USART_CR1_TCIE_POS           (6U)
#define USART_CR1_TCIE_MSK           (0x1UL << USART_CR1_TCIE_POS)             /*!< 0x00000040 */
#define USART_CR1_TCIE               USART_CR1_TCIE_MSK                        /*!< Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE_TXFNFIE_POS  (7U)
#define USART_CR1_TXEIE_TXFNFIE_MSK  (0x1UL << USART_CR1_TXEIE_TXFNFIE_POS)   /*!< 0x00000080 */
#define USART_CR1_TXEIE              USART_CR1_TXEIE_TXFNFIE_MSK              /*!< TXE/TXFIFO not full Interrupt Enable */
#define USART_CR1_PEIE_POS           (8U)
#define USART_CR1_PEIE_MSK           (0x1UL << USART_CR1_PEIE_POS)             /*!< 0x00000100 */
#define USART_CR1_PEIE               USART_CR1_PEIE_MSK                        /*!< PE Interrupt Enable */
#define USART_CR1_PS_POS             (9U)
#define USART_CR1_PS_MSK             (0x1UL << USART_CR1_PS_POS)               /*!< 0x00000200 */
#define USART_CR1_PS                 USART_CR1_PS_MSK                          /*!< Parity Selection */
#define USART_CR1_PCE_POS            (10U)
#define USART_CR1_PCE_MSK            (0x1UL << USART_CR1_PCE_POS)              /*!< 0x00000400 */
#define USART_CR1_PCE                USART_CR1_PCE_MSK                         /*!< Parity Control Enable */
#define USART_CR1_WAKE_POS           (11U)
#define USART_CR1_WAKE_MSK           (0x1UL << USART_CR1_WAKE_POS)             /*!< 0x00000800 */
#define USART_CR1_WAKE               USART_CR1_WAKE_MSK                        /*!< Receiver Wakeup method */
#define USART_CR1_M_POS              (12U)
#define USART_CR1_M_MSK              (0x10001UL << USART_CR1_M_POS)            /*!< 0x10001000 */
#define USART_CR1_M                  USART_CR1_M_MSK                           /*!< Word length */
#define USART_CR1_M0_POS             (12U)
#define USART_CR1_M0_MSK             (0x1UL << USART_CR1_M0_POS)               /*!< 0x00001000 */
#define USART_CR1_M0                 USART_CR1_M0_MSK                          /*!< Word length - Bit 0 */
#define USART_CR1_MME_POS            (13U)
#define USART_CR1_MME_MSK            (0x1UL << USART_CR1_MME_POS)              /*!< 0x00002000 */
#define USART_CR1_MME                USART_CR1_MME_MSK                         /*!< Mute Mode Enable */
#define USART_CR1_CMIE_POS           (14U)
#define USART_CR1_CMIE_MSK           (0x1UL << USART_CR1_CMIE_POS)             /*!< 0x00004000 */
#define USART_CR1_CMIE               USART_CR1_CMIE_MSK                        /*!< Character match interrupt enable */
#define USART_CR1_OVER8_POS          (15U)
#define USART_CR1_OVER8_MSK          (0x1UL << USART_CR1_OVER8_POS)            /*!< 0x00008000 */
#define USART_CR1_OVER8              USART_CR1_OVER8_MSK                       /*!< Oversampling by 8-bit or 16-bit mode */
#define USART_CR1_DEDT_POS           (16U)
#define USART_CR1_DEDT_MSK           (0x1FUL << USART_CR1_DEDT_POS)            /*!< 0x001F0000 */
#define USART_CR1_DEDT               USART_CR1_DEDT_MSK                        /*!< DEDT[4:0] bits (Driver Enable Deassertion Time) */
#define USART_CR1_DEDT_0             (0x01UL << USART_CR1_DEDT_POS)            /*!< 0x00010000 */
#define USART_CR1_DEDT_1             (0x02UL << USART_CR1_DEDT_POS)            /*!< 0x00020000 */
#define USART_CR1_DEDT_2             (0x04UL << USART_CR1_DEDT_POS)            /*!< 0x00040000 */
#define USART_CR1_DEDT_3             (0x08UL << USART_CR1_DEDT_POS)            /*!< 0x00080000 */
#define USART_CR1_DEDT_4             (0x10UL << USART_CR1_DEDT_POS)            /*!< 0x00100000 */
#define USART_CR1_DEAT_POS           (21U)
#define USART_CR1_DEAT_MSK           (0x1FUL << USART_CR1_DEAT_POS)            /*!< 0x03E00000 */
#define USART_CR1_DEAT               USART_CR1_DEAT_MSK                        /*!< DEAT[4:0] bits (Driver Enable Assertion Time) */
#define USART_CR1_DEAT_0             (0x01UL << USART_CR1_DEAT_POS)            /*!< 0x00200000 */
#define USART_CR1_DEAT_1             (0x02UL << USART_CR1_DEAT_POS)            /*!< 0x00400000 */
#define USART_CR1_DEAT_2             (0x04UL << USART_CR1_DEAT_POS)            /*!< 0x00800000 */
#define USART_CR1_DEAT_3             (0x08UL << USART_CR1_DEAT_POS)            /*!< 0x01000000 */
#define USART_CR1_DEAT_4             (0x10UL << USART_CR1_DEAT_POS)            /*!< 0x02000000 */
#define USART_CR1_RTOIE_POS          (26U)
#define USART_CR1_RTOIE_MSK          (0x1UL << USART_CR1_RTOIE_POS)            /*!< 0x04000000 */
#define USART_CR1_RTOIE              USART_CR1_RTOIE_MSK                       /*!< Receive Time Out interrupt enable */
#define USART_CR1_EOBIE_POS          (27U)
#define USART_CR1_EOBIE_MSK          (0x1UL << USART_CR1_EOBIE_POS)            /*!< 0x08000000 */
#define USART_CR1_EOBIE              USART_CR1_EOBIE_MSK                       /*!< End of Block interrupt enable */
#define USART_CR1_M1_POS             (28U)
#define USART_CR1_M1_MSK             (0x1UL << USART_CR1_M1_POS)               /*!< 0x10000000 */
#define USART_CR1_M1                 USART_CR1_M1_MSK                          /*!< Word length - Bit 1 */
#define USART_CR1_FIFOEN_POS         (29U)
#define USART_CR1_FIFOEN_MSK         (0x1UL << USART_CR1_FIFOEN_POS)           /*!< 0x20000000 */
#define USART_CR1_FIFOEN             USART_CR1_FIFOEN_MSK                      /*!< FIFO mode enable */
#define USART_CR1_TXFEIE_POS         (30U)
#define USART_CR1_TXFEIE_MSK         (0x1UL << USART_CR1_TXFEIE_POS)           /*!< 0x40000000 */
#define USART_CR1_TXFEIE             USART_CR1_TXFEIE_MSK                      /*!< TXFIFO empty interrupt enable */
#define USART_CR1_RXFFIE_POS         (31U)
#define USART_CR1_RXFFIE_MSK         (0x1UL << USART_CR1_RXFFIE_POS)           /*!< 0x80000000 */
#define USART_CR1_RXFFIE             USART_CR1_RXFFIE_MSK                      /*!< RXFIFO Full interrupt enable */

