ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bit definition for USART_CR2 register  *******************/
#define USART_CR2_SLVEN_POS          (0U)
#define USART_CR2_SLVEN_MSK          (0x1UL << USART_CR2_SLVEN_POS)            /*!< 0x00000001 */
#define USART_CR2_SLVEN              USART_CR2_SLVEN_MSK                       /*!< Synchronous Slave mode enable */
#define USART_CR2_DIS_NSS_POS        (3U)
#define USART_CR2_DIS_NSS_MSK        (0x1UL << USART_CR2_DIS_NSS_POS)          /*!< 0x00000008 */
#define USART_CR2_DIS_NSS            USART_CR2_DIS_NSS_MSK                     /*!< NSS input pin disable for SPI slave selection */
#define USART_CR2_ADDM7_POS          (4U)
#define USART_CR2_ADDM7_MSK          (0x1UL << USART_CR2_ADDM7_POS)            /*!< 0x00000010 */
#define USART_CR2_ADDM7              USART_CR2_ADDM7_MSK                       /*!< 7-bit or 4-bit Address Detection */
#define USART_CR2_LBDL_POS           (5U)
#define USART_CR2_LBDL_MSK           (0x1UL << USART_CR2_LBDL_POS)             /*!< 0x00000020 */
#define USART_CR2_LBDL               USART_CR2_LBDL_MSK                        /*!< LIN Break Detection Length */
#define USART_CR2_LBDIE_POS          (6U)
#define USART_CR2_LBDIE_MSK          (0x1UL << USART_CR2_LBDIE_POS)            /*!< 0x00000040 */
#define USART_CR2_LBDIE              USART_CR2_LBDIE_MSK                       /*!< LIN Break Detection Interrupt Enable */
#define USART_CR2_LBCL_POS           (8U)
#define USART_CR2_LBCL_MSK           (0x1UL << USART_CR2_LBCL_POS)             /*!< 0x00000100 */
#define USART_CR2_LBCL               USART_CR2_LBCL_MSK                        /*!< Last Bit Clock pulse */
#define USART_CR2_CPHA_POS           (9U)
#define USART_CR2_CPHA_MSK           (0x1UL << USART_CR2_CPHA_POS)             /*!< 0x00000200 */
#define USART_CR2_CPHA               USART_CR2_CPHA_MSK                        /*!< Clock Phase */
#define USART_CR2_CPOL_POS           (10U)
#define USART_CR2_CPOL_MSK           (0x1UL << USART_CR2_CPOL_POS)             /*!< 0x00000400 */
#define USART_CR2_CPOL               USART_CR2_CPOL_MSK                        /*!< Clock Polarity */
#define USART_CR2_CLKEN_POS          (11U)
#define USART_CR2_CLKEN_MSK          (0x1UL << USART_CR2_CLKEN_POS)            /*!< 0x00000800 */
#define USART_CR2_CLKEN              USART_CR2_CLKEN_MSK                       /*!< Clock Enable */
#define USART_CR2_STOP_POS           (12U)
#define USART_CR2_STOP_MSK           (0x3UL << USART_CR2_STOP_POS)             /*!< 0x00003000 */
#define USART_CR2_STOP               USART_CR2_STOP_MSK                        /*!< STOP[1:0] bits (STOP bits) */
#define USART_CR2_STOP_0             (0x1UL << USART_CR2_STOP_POS)             /*!< 0x00001000 */
#define USART_CR2_STOP_1             (0x2UL << USART_CR2_STOP_POS)             /*!< 0x00002000 */
#define USART_CR2_LINEN_POS          (14U)
#define USART_CR2_LINEN_MSK          (0x1UL << USART_CR2_LINEN_POS)            /*!< 0x00004000 */
#define USART_CR2_LINEN              USART_CR2_LINEN_MSK                       /*!< LIN mode enable */
#define USART_CR2_SWAP_POS           (15U)
#define USART_CR2_SWAP_MSK           (0x1UL << USART_CR2_SWAP_POS)             /*!< 0x00008000 */
#define USART_CR2_SWAP               USART_CR2_SWAP_MSK                        /*!< SWAP TX/RX pins */
#define USART_CR2_RXINV_POS          (16U)
#define USART_CR2_RXINV_MSK          (0x1UL << USART_CR2_RXINV_POS)            /*!< 0x00010000 */
#define USART_CR2_RXINV              USART_CR2_RXINV_MSK                       /*!< RX pin active level inversion */
#define USART_CR2_TXINV_POS          (17U)
#define USART_CR2_TXINV_MSK          (0x1UL << USART_CR2_TXINV_POS)            /*!< 0x00020000 */
#define USART_CR2_TXINV              USART_CR2_TXINV_MSK                       /*!< TX pin active level inversion */
#define USART_CR2_DATAINV_POS        (18U)
#define USART_CR2_DATAINV_MSK        (0x1UL << USART_CR2_DATAINV_POS)          /*!< 0x00040000 */
#define USART_CR2_DATAINV            USART_CR2_DATAINV_MSK                     /*!< Binary data inversion */
#define USART_CR2_MSBFIRST_POS       (19U)
#define USART_CR2_MSBFIRST_MSK       (0x1UL << USART_CR2_MSBFIRST_POS)         /*!< 0x00080000 */
#define USART_CR2_MSBFIRST           USART_CR2_MSBFIRST_MSK                    /*!< Most Significant Bit First */
#define USART_CR2_ABREN_POS          (20U)
#define USART_CR2_ABREN_MSK          (0x1UL << USART_CR2_ABREN_POS)            /*!< 0x00100000 */
#define USART_CR2_ABREN              USART_CR2_ABREN_MSK                       /*!< Auto Baud-Rate Enable*/
#define USART_CR2_ABRMODE_POS        (21U)
#define USART_CR2_ABRMODE_MSK        (0x3UL << USART_CR2_ABRMODE_POS)          /*!< 0x00600000 */
#define USART_CR2_ABRMODE            USART_CR2_ABRMODE_MSK                     /*!< ABRMOD[1:0] bits (Auto Baud-Rate Mode) */
#define USART_CR2_ABRMODE_0          (0x1UL << USART_CR2_ABRMODE_POS)          /*!< 0x00200000 */
#define USART_CR2_ABRMODE_1          (0x2UL << USART_CR2_ABRMODE_POS)          /*!< 0x00400000 */
#define USART_CR2_RTOEN_POS          (23U)
#define USART_CR2_RTOEN_MSK          (0x1UL << USART_CR2_RTOEN_POS)            /*!< 0x00800000 */
#define USART_CR2_RTOEN              USART_CR2_RTOEN_MSK                       /*!< Receiver Time-Out enable */
#define USART_CR2_ADD_POS            (24U)
#define USART_CR2_ADD_MSK            (0xFFUL << USART_CR2_ADD_POS)             /*!< 0xFF000000 */
#define USART_CR2_ADD                USART_CR2_ADD_MSK                         /*!< Address of the USART node */

/******************  Bit definition for USART_CR3 register  *******************/
#define USART_CR3_EIE_POS            (0U)
#define USART_CR3_EIE_MSK            (0x1UL << USART_CR3_EIE_POS)              /*!< 0x00000001 */
#define USART_CR3_EIE                USART_CR3_EIE_MSK                         /*!< Error Interrupt Enable */
#define USART_CR3_IREN_POS           (1U)
#define USART_CR3_IREN_MSK           (0x1UL << USART_CR3_IREN_POS)             /*!< 0x00000002 */
#define USART_CR3_IREN               USART_CR3_IREN_MSK                        /*!< IrDA mode Enable */
#define USART_CR3_IRLP_POS           (2U)
#define USART_CR3_IRLP_MSK           (0x1UL << USART_CR3_IRLP_POS)             /*!< 0x00000004 */
#define USART_CR3_IRLP               USART_CR3_IRLP_MSK                        /*!< IrDA Low-Power */
#define USART_CR3_HDSEL_POS          (3U)
#define USART_CR3_HDSEL_MSK          (0x1UL << USART_CR3_HDSEL_POS)            /*!< 0x00000008 */
#define USART_CR3_HDSEL              USART_CR3_HDSEL_MSK                       /*!< Half-Duplex Selection */
#define USART_CR3_NACK_POS           (4U)
#define USART_CR3_NACK_MSK           (0x1UL << USART_CR3_NACK_POS)             /*!< 0x00000010 */
#define USART_CR3_NACK               USART_CR3_NACK_MSK                        /*!< SmartCard NACK enable */
#define USART_CR3_SCEN_POS           (5U)
#define USART_CR3_SCEN_MSK           (0x1UL << USART_CR3_SCEN_POS)             /*!< 0x00000020 */
#define USART_CR3_SCEN               USART_CR3_SCEN_MSK                        /*!< SmartCard mode enable */
#define USART_CR3_DMAR_POS           (6U)
#define USART_CR3_DMAR_MSK           (0x1UL << USART_CR3_DMAR_POS)             /*!< 0x00000040 */
#define USART_CR3_DMAR               USART_CR3_DMAR_MSK                        /*!< DMA Enable Receiver */
#define USART_CR3_DMAT_POS           (7U)
#define USART_CR3_DMAT_MSK           (0x1UL << USART_CR3_DMAT_POS)             /*!< 0x00000080 */
#define USART_CR3_DMAT               USART_CR3_DMAT_MSK                        /*!< DMA Enable Transmitter */
#define USART_CR3_RTSE_POS           (8U)
#define USART_CR3_RTSE_MSK           (0x1UL << USART_CR3_RTSE_POS)             /*!< 0x00000100 */
#define USART_CR3_RTSE               USART_CR3_RTSE_MSK                        /*!< RTS Enable */
#define USART_CR3_CTSE_POS           (9U)
#define USART_CR3_CTSE_MSK           (0x1UL << USART_CR3_CTSE_POS)             /*!< 0x00000200 */
#define USART_CR3_CTSE               USART_CR3_CTSE_MSK                        /*!< CTS Enable */
#define USART_CR3_CTSIE_POS          (10U)
#define USART_CR3_CTSIE_MSK          (0x1UL << USART_CR3_CTSIE_POS)            /*!< 0x00000400 */
#define USART_CR3_CTSIE              USART_CR3_CTSIE_MSK                       /*!< CTS Interrupt Enable */
#define USART_CR3_ONEBIT_POS         (11U)
#define USART_CR3_ONEBIT_MSK         (0x1UL << USART_CR3_ONEBIT_POS)           /*!< 0x00000800 */
#define USART_CR3_ONEBIT             USART_CR3_ONEBIT_MSK                      /*!< One sample bit method enable */
#define USART_CR3_OVRDIS_POS         (12U)
#define USART_CR3_OVRDIS_MSK         (0x1UL << USART_CR3_OVRDIS_POS)           /*!< 0x00001000 */
#define USART_CR3_OVRDIS             USART_CR3_OVRDIS_MSK                      /*!< Overrun Disable */
#define USART_CR3_DDRE_POS           (13U)
#define USART_CR3_DDRE_MSK           (0x1UL << USART_CR3_DDRE_POS)             /*!< 0x00002000 */
#define USART_CR3_DDRE               USART_CR3_DDRE_MSK                        /*!< DMA Disable on Reception Error */
#define USART_CR3_DEM_POS            (14U)
#define USART_CR3_DEM_MSK            (0x1UL << USART_CR3_DEM_POS)              /*!< 0x00004000 */
#define USART_CR3_DEM                USART_CR3_DEM_MSK                         /*!< Driver Enable Mode */
#define USART_CR3_DEP_POS            (15U)
#define USART_CR3_DEP_MSK            (0x1UL << USART_CR3_DEP_POS)              /*!< 0x00008000 */
#define USART_CR3_DEP                USART_CR3_DEP_MSK                         /*!< Driver Enable Polarity Selection */
#define USART_CR3_SCARCNT_POS        (17U)
#define USART_CR3_SCARCNT_MSK        (0x7UL << USART_CR3_SCARCNT_POS)          /*!< 0x000E0000 */
#define USART_CR3_SCARCNT            USART_CR3_SCARCNT_MSK                     /*!< SCARCNT[2:0] bits (SmartCard Auto-Retry Count) */
#define USART_CR3_SCARCNT_0          (0x1UL << USART_CR3_SCARCNT_POS)          /*!< 0x00020000 */
#define USART_CR3_SCARCNT_1          (0x2UL << USART_CR3_SCARCNT_POS)          /*!< 0x00040000 */
#define USART_CR3_SCARCNT_2          (0x4UL << USART_CR3_SCARCNT_POS)          /*!< 0x00080000 */
#define USART_CR3_WUS_POS            (20U)
#define USART_CR3_WUS_MSK            (0x3UL << USART_CR3_WUS_POS)              /*!< 0x00300000 */
#define USART_CR3_WUS                USART_CR3_WUS_MSK                         /*!< WUS[1:0] bits (Wake UP Interrupt Flag Selection) */
#define USART_CR3_WUS_0              (0x1UL << USART_CR3_WUS_POS)              /*!< 0x00100000 */
#define USART_CR3_WUS_1              (0x2UL << USART_CR3_WUS_POS)              /*!< 0x00200000 */
#define USART_CR3_WUFIE_POS          (22U)
#define USART_CR3_WUFIE_MSK          (0x1UL << USART_CR3_WUFIE_POS)            /*!< 0x00400000 */
#define USART_CR3_WUFIE              USART_CR3_WUFIE_MSK                       /*!< Wake Up Interrupt Enable */
#define USART_CR3_TXFTIE_POS         (23U)
#define USART_CR3_TXFTIE_MSK         (0x1UL << USART_CR3_TXFTIE_POS)           /*!< 0x00800000 */
#define USART_CR3_TXFTIE             USART_CR3_TXFTIE_MSK                      /*!< TXFIFO threshold interrupt enable */
#define USART_CR3_TCBGTIE_POS        (24U)
#define USART_CR3_TCBGTIE_MSK        (0x1UL << USART_CR3_TCBGTIE_POS)          /*!< 0x01000000 */
#define USART_CR3_TCBGTIE            USART_CR3_TCBGTIE_MSK                     /*!< Transmission Complete Before Guard Time Interrupt Enable */
#define USART_CR3_RXFTCFG_POS        (25U)
#define USART_CR3_RXFTCFG_MSK        (0x7UL << USART_CR3_RXFTCFG_POS)          /*!< 0x0E000000 */
#define USART_CR3_RXFTCFG            USART_CR3_RXFTCFG_MSK                     /*!< RXFIFO FIFO threshold configuration */
#define USART_CR3_RXFTCFG_0          (0x1UL << USART_CR3_RXFTCFG_POS)          /*!< 0x02000000 */
#define USART_CR3_RXFTCFG_1          (0x2UL << USART_CR3_RXFTCFG_POS)          /*!< 0x04000000 */
#define USART_CR3_RXFTCFG_2          (0x4UL << USART_CR3_RXFTCFG_POS)          /*!< 0x08000000 */
#define USART_CR3_RXFTIE_POS         (28U)
#define USART_CR3_RXFTIE_MSK         (0x1UL << USART_CR3_RXFTIE_POS)           /*!< 0x10000000 */
#define USART_CR3_RXFTIE             USART_CR3_RXFTIE_MSK                      /*!< RXFIFO threshold interrupt enable */
#define USART_CR3_TXFTCFG_POS        (29U)
#define USART_CR3_TXFTCFG_MSK        (0x7UL << USART_CR3_TXFTCFG_POS)          /*!< 0xE0000000 */
#define USART_CR3_TXFTCFG            USART_CR3_TXFTCFG_MSK                     /*!< TXFIFO threshold configuration */
#define USART_CR3_TXFTCFG_0          (0x1UL << USART_CR3_TXFTCFG_POS)          /*!< 0x20000000 */
#define USART_CR3_TXFTCFG_1          (0x2UL << USART_CR3_TXFTCFG_POS)          /*!< 0x40000000 */
#define USART_CR3_TXFTCFG_2          (0x4UL << USART_CR3_TXFTCFG_POS)          /*!< 0x80000000 */

