ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/******************  Bit definition for USART_BRR register  *******************/
#define USART_BRR_LPUART_POS         (0U)
#define USART_BRR_LPUART_MSK         (0xFFFFFUL << USART_BRR_LPUART_POS)       /*!< 0x000FFFFF */
#define USART_BRR_LPUART             USART_BRR_LPUART_MSK                      /*!< LPUART Baud rate register [19:0] */
#define USART_BRR_BRR                ((uint16)0xFFFF)                        /*!< USART  Baud rate register [15:0] */

/******************  Bit definition for USART_GTPR register  ******************/
#define USART_GTPR_PSC_POS           (0U)
#define USART_GTPR_PSC_MSK           (0xFFUL << USART_GTPR_PSC_POS)            /*!< 0x000000FF */
#define USART_GTPR_PSC               USART_GTPR_PSC_MSK                        /*!< PSC[7:0] bits (Prescaler value) */
#define USART_GTPR_GT_POS            (8U)
#define USART_GTPR_GT_MSK            (0xFFUL << USART_GTPR_GT_POS)             /*!< 0x0000FF00 */
#define USART_GTPR_GT                USART_GTPR_GT_MSK                         /*!< GT[7:0] bits (Guard time value) */

/*******************  Bit definition for USART_RTOR register  *****************/
#define USART_RTOR_RTO_POS           (0U)
#define USART_RTOR_RTO_MSK           (0xFFFFFFUL << USART_RTOR_RTO_POS)        /*!< 0x00FFFFFF */
#define USART_RTOR_RTO               USART_RTOR_RTO_MSK                        /*!< Receiver Time Out Value */
#define USART_RTOR_BLEN_POS          (24U)
#define USART_RTOR_BLEN_MSK          (0xFFUL << USART_RTOR_BLEN_POS)           /*!< 0xFF000000 */
#define USART_RTOR_BLEN              USART_RTOR_BLEN_MSK                       /*!< Block Length */

/*******************  Bit definition for USART_RQR register  ******************/
#define USART_RQR_ABRRQ        ((uint16)0x0001)                              /*!< Auto-Baud Rate Request */
#define USART_RQR_SBKRQ        ((uint16)0x0002)                              /*!< Send Break Request */
#define USART_RQR_MMRQ         ((uint16)0x0004)                              /*!< Mute Mode Request */
#define USART_RQR_RXFRQ        ((uint16)0x0008)                              /*!< Receive Data flush Request */
#define USART_RQR_TXFRQ        ((uint16)0x0010)                              /*!< Transmit data flush Request */

/*******************  Bit definition for USART_ISR register  ******************/
#define USART_ISR_PE_POS             (0U)
#define USART_ISR_PE_MSK             (0x1UL << USART_ISR_PE_POS)               /*!< 0x00000001 */
#define USART_ISR_PE                 USART_ISR_PE_MSK                          /*!< Parity Error */
#define USART_ISR_FE_POS             (1U)
#define USART_ISR_FE_MSK             (0x1UL << USART_ISR_FE_POS)               /*!< 0x00000002 */
#define USART_ISR_FE                 USART_ISR_FE_MSK                          /*!< Framing Error */
#define USART_ISR_NE_POS             (2U)
#define USART_ISR_NE_MSK             (0x1UL << USART_ISR_NE_POS)               /*!< 0x00000004 */
#define USART_ISR_NE                 USART_ISR_NE_MSK                          /*!< Noise detected Flag */
#define USART_ISR_ORE_POS            (3U)
#define USART_ISR_ORE_MSK            (0x1UL << USART_ISR_ORE_POS)              /*!< 0x00000008 */
#define USART_ISR_ORE                USART_ISR_ORE_MSK                         /*!< OverRun Error */
#define USART_ISR_IDLE_POS           (4U)
#define USART_ISR_IDLE_MSK           (0x1UL << USART_ISR_IDLE_POS)             /*!< 0x00000010 */
#define USART_ISR_IDLE               USART_ISR_IDLE_MSK                        /*!< IDLE line detected */
#define USART_ISR_RXNE_RXFNE_POS     (5U)
#define USART_ISR_RXNE_RXFNE_MSK     (0x1UL << USART_ISR_RXNE_RXFNE_POS)       /*!< 0x00000020 */
#define USART_ISR_RXNE               USART_ISR_RXNE_RXFNE_MSK                  /*!< Read Data Register Not Empty/RXFIFO Not Empty */
#define USART_ISR_TC_POS             (6U)
#define USART_ISR_TC_MSK             (0x1UL << USART_ISR_TC_POS)               /*!< 0x00000040 */
#define USART_ISR_TC                 USART_ISR_TC_MSK                          /*!< Transmission Complete */
#define USART_ISR_TXE_TXFNF_POS      (7U)
#define USART_ISR_TXE_TXFNF_MSK      (0x1UL << USART_ISR_TXE_TXFNF_POS)        /*!< 0x00000080 */
#define USART_ISR_TXE                USART_ISR_TXE_TXFNF_MSK                   /*!< Transmit Data Register Empty/TXFIFO Not Full */
#define USART_ISR_LBDF_POS           (8U)
#define USART_ISR_LBDF_MSK           (0x1UL << USART_ISR_LBDF_POS)             /*!< 0x00000100 */
#define USART_ISR_LBDF               USART_ISR_LBDF_MSK                        /*!< LIN Break Detection Flag */
#define USART_ISR_CTSIF_POS          (9U)
#define USART_ISR_CTSIF_MSK          (0x1UL << USART_ISR_CTSIF_POS)            /*!< 0x00000200 */
#define USART_ISR_CTSIF              USART_ISR_CTSIF_MSK                       /*!< CTS interrupt flag */
#define USART_ISR_CTS_POS            (10U)
#define USART_ISR_CTS_MSK            (0x1UL << USART_ISR_CTS_POS)              /*!< 0x00000400 */
#define USART_ISR_CTS                USART_ISR_CTS_MSK                         /*!< CTS flag */
#define USART_ISR_RTOF_POS           (11U)
#define USART_ISR_RTOF_MSK           (0x1UL << USART_ISR_RTOF_POS)             /*!< 0x00000800 */
#define USART_ISR_RTOF               USART_ISR_RTOF_MSK                        /*!< Receiver Time Out */
#define USART_ISR_EOBF_POS           (12U)
#define USART_ISR_EOBF_MSK           (0x1UL << USART_ISR_EOBF_POS)             /*!< 0x00001000 */
#define USART_ISR_EOBF               USART_ISR_EOBF_MSK                        /*!< End Of Block Flag */
#define USART_ISR_UDR_POS            (13U)
#define USART_ISR_UDR_MSK            (0x1UL << USART_ISR_UDR_POS)              /*!< 0x00002000 */
#define USART_ISR_UDR                 USART_ISR_UDR_MSK                        /*!< SPI Slave Underrun Error Flag */
#define USART_ISR_ABRE_POS           (14U)
#define USART_ISR_ABRE_MSK           (0x1UL << USART_ISR_ABRE_POS)             /*!< 0x00004000 */
#define USART_ISR_ABRE               USART_ISR_ABRE_MSK                        /*!< Auto-Baud Rate Error */
#define USART_ISR_ABRF_POS           (15U)
#define USART_ISR_ABRF_MSK           (0x1UL << USART_ISR_ABRF_POS)             /*!< 0x00008000 */
#define USART_ISR_ABRF               USART_ISR_ABRF_MSK                        /*!< Auto-Baud Rate Flag */
#define USART_ISR_BUSY_POS           (16U)
#define USART_ISR_BUSY_MSK           (0x1UL << USART_ISR_BUSY_POS)             /*!< 0x00010000 */
#define USART_ISR_BUSY               USART_ISR_BUSY_MSK                        /*!< Busy Flag */
#define USART_ISR_CMF_POS            (17U)
#define USART_ISR_CMF_MSK            (0x1UL << USART_ISR_CMF_POS)              /*!< 0x00020000 */
#define USART_ISR_CMF                USART_ISR_CMF_MSK                         /*!< Character Match Flag */
#define USART_ISR_SBKF_POS           (18U)
#define USART_ISR_SBKF_MSK           (0x1UL << USART_ISR_SBKF_POS)             /*!< 0x00040000 */
#define USART_ISR_SBKF               USART_ISR_SBKF_MSK                        /*!< Send Break Flag */
#define USART_ISR_RWU_POS            (19U)
#define USART_ISR_RWU_MSK            (0x1UL << USART_ISR_RWU_POS)              /*!< 0x00080000 */
#define USART_ISR_RWU                USART_ISR_RWU_MSK                         /*!< Receive Wake Up from mute mode Flag */
#define USART_ISR_WUF_POS            (20U)
#define USART_ISR_WUF_MSK            (0x1UL << USART_ISR_WUF_POS)              /*!< 0x00100000 */
#define USART_ISR_WUF                USART_ISR_WUF_MSK                         /*!< Wake Up from stop mode Flag */
#define USART_ISR_TEACK_POS          (21U)
#define USART_ISR_TEACK_MSK          (0x1UL << USART_ISR_TEACK_POS)            /*!< 0x00200000 */
#define USART_ISR_TEACK              USART_ISR_TEACK_MSK                       /*!< Transmit Enable Acknowledge Flag */
#define USART_ISR_REACK_POS          (22U)
#define USART_ISR_REACK_MSK          (0x1UL << USART_ISR_REACK_POS)            /*!< 0x00400000 */
#define USART_ISR_REACK              USART_ISR_REACK_MSK                       /*!< Receive Enable Acknowledge Flag */
#define USART_ISR_TXFE_POS           (23U)
#define USART_ISR_TXFE_MSK           (0x1UL << USART_ISR_TXFE_POS)             /*!< 0x00800000 */
#define USART_ISR_TXFE               USART_ISR_TXFE_MSK                        /*!< TXFIFO Empty Flag */
#define USART_ISR_RXFF_POS           (24U)
#define USART_ISR_RXFF_MSK           (0x1UL << USART_ISR_RXFF_POS)             /*!< 0x01000000 */
#define USART_ISR_RXFF               USART_ISR_RXFF_MSK                        /*!< RXFIFO Full Flag */
#define USART_ISR_TCBGT_POS          (25U)
#define USART_ISR_TCBGT_MSK          (0x1UL << USART_ISR_TCBGT_POS)            /*!< 0x02000000 */
#define USART_ISR_TCBGT              USART_ISR_TCBGT_MSK                       /*!< Transmission Complete Before Guard Time Completion Flag */
#define USART_ISR_RXFT_POS           (26U)
#define USART_ISR_RXFT_MSK           (0x1UL << USART_ISR_RXFT_POS)             /*!< 0x04000000 */
#define USART_ISR_RXFT               USART_ISR_RXFT_MSK                        /*!< RXFIFO Threshold Flag */
#define USART_ISR_TXFT_POS           (27U)
#define USART_ISR_TXFT_MSK           (0x1UL << USART_ISR_TXFT_POS)             /*!< 0x08000000 */
#define USART_ISR_TXFT               USART_ISR_TXFT_MSK                        /*!< TXFIFO Threshold Flag */

