ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for USART_ICR register  ******************/
#define USART_ICR_PECF_POS           (0U)
#define USART_ICR_PECF_MSK           (0x1UL << USART_ICR_PECF_POS)             /*!< 0x00000001 */
#define USART_ICR_PECF               USART_ICR_PECF_MSK                        /*!< Parity Error Clear Flag */
#define USART_ICR_FECF_POS           (1U)
#define USART_ICR_FECF_MSK           (0x1UL << USART_ICR_FECF_POS)             /*!< 0x00000002 */
#define USART_ICR_FECF               USART_ICR_FECF_MSK                        /*!< Framing Error Clear Flag */
#define USART_ICR_NECF_POS           (2U)
#define USART_ICR_NECF_MSK           (0x1UL << USART_ICR_NECF_POS)             /*!< 0x00000004 */
#define USART_ICR_NECF               USART_ICR_NECF_MSK                        /*!< Noise Error detected Clear Flag */
#define USART_ICR_ORECF_POS          (3U)
#define USART_ICR_ORECF_MSK          (0x1UL << USART_ICR_ORECF_POS)            /*!< 0x00000008 */
#define USART_ICR_ORECF              USART_ICR_ORECF_MSK                       /*!< OverRun Error Clear Flag */
#define USART_ICR_IDLECF_POS         (4U)
#define USART_ICR_IDLECF_MSK         (0x1UL << USART_ICR_IDLECF_POS)           /*!< 0x00000010 */
#define USART_ICR_IDLECF             USART_ICR_IDLECF_MSK                      /*!< IDLE line detected Clear Flag */
#define USART_ICR_TXFECF_POS         (5U)
#define USART_ICR_TXFECF_MSK         (0x1UL << USART_ICR_TXFECF_POS)           /*!< 0x00000020 */
#define USART_ICR_TXFECF             USART_ICR_TXFECF_MSK                      /*!< TXFIFO Empty Clear Flag */
#define USART_ICR_TCCF_POS           (6U)
#define USART_ICR_TCCF_MSK           (0x1UL << USART_ICR_TCCF_POS)             /*!< 0x00000040 */
#define USART_ICR_TCCF               USART_ICR_TCCF_MSK                        /*!< Transmission Complete Clear Flag */
#define USART_ICR_TCBGTCF_POS        (7U)
#define USART_ICR_TCBGTCF_MSK        (0x1UL << USART_ICR_TCBGTCF_POS)          /*!< 0x00000080 */
#define USART_ICR_TCBGTCF            USART_ICR_TCBGTCF_MSK                     /*!< Transmission Complete Before Guard Time Clear Flag */
#define USART_ICR_LBDCF_POS          (8U)
#define USART_ICR_LBDCF_MSK          (0x1UL << USART_ICR_LBDCF_POS)            /*!< 0x00000100 */
#define USART_ICR_LBDCF              USART_ICR_LBDCF_MSK                       /*!< LIN Break Detection Clear Flag */
#define USART_ICR_CTSCF_POS          (9U)
#define USART_ICR_CTSCF_MSK          (0x1UL << USART_ICR_CTSCF_POS)            /*!< 0x00000200 */
#define USART_ICR_CTSCF              USART_ICR_CTSCF_MSK                       /*!< CTS Interrupt Clear Flag */
#define USART_ICR_RTOCF_POS          (11U)
#define USART_ICR_RTOCF_MSK          (0x1UL << USART_ICR_RTOCF_POS)            /*!< 0x00000800 */
#define USART_ICR_RTOCF              USART_ICR_RTOCF_MSK                       /*!< Receiver Time Out Clear Flag */
#define USART_ICR_EOBCF_POS          (12U)
#define USART_ICR_EOBCF_MSK          (0x1UL << USART_ICR_EOBCF_POS)            /*!< 0x00001000 */
#define USART_ICR_EOBCF              USART_ICR_EOBCF_MSK                       /*!< End Of Block Clear Flag */
#define USART_ICR_UDRCF_POS          (13U)
#define USART_ICR_UDRCF_MSK          (0x1UL << USART_ICR_UDRCF_POS)            /*!< 0x00002000 */
#define USART_ICR_UDRCF              USART_ICR_UDRCF_MSK                       /*!< SPI Slave Underrun Clear Flag */
#define USART_ICR_CMCF_POS           (17U)
#define USART_ICR_CMCF_MSK           (0x1UL << USART_ICR_CMCF_POS)             /*!< 0x00020000 */
#define USART_ICR_CMCF               USART_ICR_CMCF_MSK                        /*!< Character Match Clear Flag */
#define USART_ICR_WUCF_POS           (20U)
#define USART_ICR_WUCF_MSK           (0x1UL << USART_ICR_WUCF_POS)             /*!< 0x00100000 */
#define USART_ICR_WUCF               USART_ICR_WUCF_MSK                        /*!< Wake Up from stop mode Clear Flag */

/*******************  Bit definition for USART_RDR register  ******************/
#define USART_RDR_RDR_POS             (0U)
#define USART_RDR_RDR_MSK             (0x1FFUL << USART_RDR_RDR_POS)           /*!< 0x000001FF */
#define USART_RDR_RDR                 USART_RDR_RDR_MSK                        /*!< RDR[8:0] bits (Receive Data value) */

/*******************  Bit definition for USART_TDR register  ******************/
#define USART_TDR_TDR_POS             (0U)
#define USART_TDR_TDR_MSK             (0x1FFUL << USART_TDR_TDR_POS)           /*!< 0x000001FF */
#define USART_TDR_TDR                 USART_TDR_TDR_MSK                        /*!< TDR[8:0] bits (Transmit Data value) */

/*******************  Bit definition for USART_PRESC register  ****************/
#define USART_PRESC_PRESCALER_POS    (0U)
#define USART_PRESC_PRESCALER_MSK    (0xFUL << USART_PRESC_PRESCALER_POS)      /*!< 0x0000000F */
#define USART_PRESC_PRESCALER        USART_PRESC_PRESCALER_MSK                 /*!< PRESCALER[3:0] bits (Clock prescaler) */
#define USART_PRESC_PRESCALER_0      (0x1UL << USART_PRESC_PRESCALER_POS)      /*!< 0x00000001 */
#define USART_PRESC_PRESCALER_1      (0x2UL << USART_PRESC_PRESCALER_POS)      /*!< 0x00000002 */
#define USART_PRESC_PRESCALER_2      (0x4UL << USART_PRESC_PRESCALER_POS)      /*!< 0x00000004 */
#define USART_PRESC_PRESCALER_3      (0x8UL << USART_PRESC_PRESCALER_POS)      /*!< 0x00000008 */

#define UART_STOPBITS_0_5                    USART_CR2_STOP_0                     /*!< UART frame with 0.5 stop bit  */
#define UART_STOPBITS_1                      0x00000000U                           /*!< UART frame with 1 stop bit    */
#define UART_STOPBITS_1_5                    (USART_CR2_STOP_0 | USART_CR2_STOP_1) /*!< UART frame with 1.5 stop bits */
#define UART_STOPBITS_2                      USART_CR2_STOP_1                     /*!< UART frame with 2 stop bits   */

#define UART_CR1_PARITY_NONE                 0x00000000U                        /*!< No parity   */
#define UART_CR1_PARITY_EVEN                 USART_CR1_PCE                      /*!< Even parity */
#define UART_CR1_PARITY_ODD                  (USART_CR1_PCE | USART_CR1_PS)     /*!< Odd parity  */

