ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- DAC REGISTERS ----------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
typedef struct
{
  volatile uint32 CR;          /*!< DAC control register,                                    Address offset: 0x00 */
  volatile uint32 SWTRIGR;     /*!< DAC software trigger register,                           Address offset: 0x04 */
  volatile uint32 DHR12R1;     /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
  volatile uint32 DHR12L1;     /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
  volatile uint32 DHR8R1;      /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
  volatile uint32 DHR12R2;     /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
  volatile uint32 DHR12L2;     /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
  volatile uint32 DHR8R2;      /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
  volatile uint32 DHR12RD;     /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
  volatile uint32 DHR12LD;     /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
  volatile uint32 DHR8RD;      /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
  volatile uint32 DOR1;        /*!< DAC channel1 data output register,                       Address offset: 0x2C */
  volatile uint32 DOR2;        /*!< DAC channel2 data output register,                       Address offset: 0x30 */
  volatile uint32 SR;          /*!< DAC status register,                                     Address offset: 0x34 */
  volatile uint32 CCR;         /*!< DAC calibration control register,                        Address offset: 0x38 */
  volatile uint32 MCR;         /*!< DAC mode control register,                               Address offset: 0x3C */
  volatile uint32 SHSR1;       /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
  volatile uint32 SHSR2;       /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
  volatile uint32 SHHR;        /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
  volatile uint32 SHRR;        /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */
} DAC_TYPEDEF;

#define DAC                 (*(DAC_TYPEDEF *) DAC_BASE) /* Kept for legacy purpose */
#define DAC1                (*(DAC_TYPEDEF *) DAC1_BASE)

/********************  Bit definition for DAC_CR register  ********************/
#define DAC_CR_EN1_POS              (0U)
#define DAC_CR_EN1_MSK              (0x1UL << DAC_CR_EN1_POS)                  /*!< 0x00000001 */
#define DAC_CR_EN1                  DAC_CR_EN1_MSK                             /*!<DAC channel1 enable */
#define DAC_CR_TEN1_POS             (1U)
#define DAC_CR_TEN1_MSK             (0x1UL << DAC_CR_TEN1_POS)                 /*!< 0x00000002 */
#define DAC_CR_TEN1                 DAC_CR_TEN1_MSK                            /*!<DAC channel1 Trigger enable */

#define DAC_CR_TSEL1_POS            (2U)
#define DAC_CR_TSEL1_MSK            (0xFUL << DAC_CR_TSEL1_POS)                /*!< 0x0000003C */
#define DAC_CR_TSEL1                DAC_CR_TSEL1_MSK                           /*!<TSEL1[3:0] (DAC channel1 Trigger selection) */
#define DAC_CR_TSEL1_0              (0x1UL << DAC_CR_TSEL1_POS)                /*!< 0x00000004 */
#define DAC_CR_TSEL1_1              (0x2UL << DAC_CR_TSEL1_POS)                /*!< 0x00000008 */
#define DAC_CR_TSEL1_2              (0x4UL << DAC_CR_TSEL1_POS)                /*!< 0x00000010 */
#define DAC_CR_TSEL1_3              (0x8UL << DAC_CR_TSEL1_POS)                /*!< 0x00000020 */

#define DAC_CR_WAVE1_POS            (6U)
#define DAC_CR_WAVE1_MSK            (0x3UL << DAC_CR_WAVE1_POS)                /*!< 0x000000C0 */
#define DAC_CR_WAVE1                DAC_CR_WAVE1_MSK                           /*!<WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define DAC_CR_WAVE1_0              (0x1UL << DAC_CR_WAVE1_POS)                /*!< 0x00000040 */
#define DAC_CR_WAVE1_1              (0x2UL << DAC_CR_WAVE1_POS)                /*!< 0x00000080 */

#define DAC_CR_MAMP1_POS            (8U)
#define DAC_CR_MAMP1_MSK            (0xFUL << DAC_CR_MAMP1_POS)                /*!< 0x00000F00 */
#define DAC_CR_MAMP1                DAC_CR_MAMP1_MSK                           /*!<MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define DAC_CR_MAMP1_0              (0x1UL << DAC_CR_MAMP1_POS)                /*!< 0x00000100 */
#define DAC_CR_MAMP1_1              (0x2UL << DAC_CR_MAMP1_POS)                /*!< 0x00000200 */
#define DAC_CR_MAMP1_2              (0x4UL << DAC_CR_MAMP1_POS)                /*!< 0x00000400 */
#define DAC_CR_MAMP1_3              (0x8UL << DAC_CR_MAMP1_POS)                /*!< 0x00000800 */

#define DAC_CR_DMAEN1_POS           (12U)
#define DAC_CR_DMAEN1_MSK           (0x1UL << DAC_CR_DMAEN1_POS)               /*!< 0x00001000 */
#define DAC_CR_DMAEN1               DAC_CR_DMAEN1_MSK                          /*!<DAC channel1 DMA enable */
#define DAC_CR_DMAUDRIE1_POS        (13U)
#define DAC_CR_DMAUDRIE1_MSK        (0x1UL << DAC_CR_DMAUDRIE1_POS)            /*!< 0x00002000 */
#define DAC_CR_DMAUDRIE1            DAC_CR_DMAUDRIE1_MSK                       /*!<DAC channel 1 DMA underrun interrupt enable  >*/
#define DAC_CR_CEN1_POS             (14U)
#define DAC_CR_CEN1_MSK             (0x1UL << DAC_CR_CEN1_POS)                 /*!< 0x00004000 */
#define DAC_CR_CEN1                 DAC_CR_CEN1_MSK                            /*!<DAC channel 1 calibration enable >*/

