ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define DAC_CR_EN2_POS              (16U)
#define DAC_CR_EN2_MSK              (0x1UL << DAC_CR_EN2_POS)                  /*!< 0x00010000 */
#define DAC_CR_EN2                  DAC_CR_EN2_MSK                             /*!<DAC channel2 enable */
#define DAC_CR_TEN2_POS             (17U)
#define DAC_CR_TEN2_MSK             (0x1UL << DAC_CR_TEN2_POS)                 /*!< 0x00020000 */
#define DAC_CR_TEN2                 DAC_CR_TEN2_MSK                            /*!<DAC channel2 Trigger enable */

#define DAC_CR_TSEL2_POS            (18U)
#define DAC_CR_TSEL2_MSK            (0xFUL << DAC_CR_TSEL2_POS)                /*!< 0x003C0000 */
#define DAC_CR_TSEL2                DAC_CR_TSEL2_MSK                           /*!<TSEL2[2:0] (DAC channel2 Trigger selection) */
#define DAC_CR_TSEL2_0              (0x1UL << DAC_CR_TSEL2_POS)                /*!< 0x00040000 */
#define DAC_CR_TSEL2_1              (0x2UL << DAC_CR_TSEL2_POS)                /*!< 0x00080000 */
#define DAC_CR_TSEL2_2              (0x4UL << DAC_CR_TSEL2_POS)                /*!< 0x00100000 */
#define DAC_CR_TSEL2_3              (0x8UL << DAC_CR_TSEL2_POS)                /*!< 0x00200000 */

#define DAC_CR_WAVE2_POS            (22U)
#define DAC_CR_WAVE2_MSK            (0x3UL << DAC_CR_WAVE2_POS)                /*!< 0x00C00000 */
#define DAC_CR_WAVE2                DAC_CR_WAVE2_MSK                           /*!<WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define DAC_CR_WAVE2_0              (0x1UL << DAC_CR_WAVE2_POS)                /*!< 0x00400000 */
#define DAC_CR_WAVE2_1              (0x2UL << DAC_CR_WAVE2_POS)                /*!< 0x00800000 */

#define DAC_CR_MAMP2_POS            (24U)
#define DAC_CR_MAMP2_MSK            (0xFUL << DAC_CR_MAMP2_POS)                /*!< 0x0F000000 */
#define DAC_CR_MAMP2                DAC_CR_MAMP2_MSK                           /*!<MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define DAC_CR_MAMP2_0              (0x1UL << DAC_CR_MAMP2_POS)                /*!< 0x01000000 */
#define DAC_CR_MAMP2_1              (0x2UL << DAC_CR_MAMP2_POS)                /*!< 0x02000000 */
#define DAC_CR_MAMP2_2              (0x4UL << DAC_CR_MAMP2_POS)                /*!< 0x04000000 */
#define DAC_CR_MAMP2_3              (0x8UL << DAC_CR_MAMP2_POS)                /*!< 0x08000000 */

#define DAC_CR_DMAEN2_POS           (28U)
#define DAC_CR_DMAEN2_MSK           (0x1UL << DAC_CR_DMAEN2_POS)               /*!< 0x10000000 */
#define DAC_CR_DMAEN2               DAC_CR_DMAEN2_MSK                          /*!<DAC channel2 DMA enabled */
#define DAC_CR_DMAUDRIE2_POS        (29U)
#define DAC_CR_DMAUDRIE2_MSK        (0x1UL << DAC_CR_DMAUDRIE2_POS)            /*!< 0x20000000 */
#define DAC_CR_DMAUDRIE2            DAC_CR_DMAUDRIE2_MSK                       /*!<DAC channel2 DMA underrun interrupt enable  >*/
#define DAC_CR_CEN2_POS             (30U)
#define DAC_CR_CEN2_MSK             (0x1UL << DAC_CR_CEN2_POS)                 /*!< 0x40000000 */
#define DAC_CR_CEN2                 DAC_CR_CEN2_MSK                            /*!<DAC channel2 calibration enable >*/

/*****************  Bit definition for DAC_SWTRIGR register  ******************/
#define DAC_SWTRIGR_SWTRIG1_POS     (0U)
#define DAC_SWTRIGR_SWTRIG1_MSK     (0x1UL << DAC_SWTRIGR_SWTRIG1_POS)         /*!< 0x00000001 */
#define DAC_SWTRIGR_SWTRIG1         DAC_SWTRIGR_SWTRIG1_MSK                    /*!<DAC channel1 software trigger */
#define DAC_SWTRIGR_SWTRIG2_POS     (1U)
#define DAC_SWTRIGR_SWTRIG2_MSK     (0x1UL << DAC_SWTRIGR_SWTRIG2_POS)         /*!< 0x00000002 */
#define DAC_SWTRIGR_SWTRIG2         DAC_SWTRIGR_SWTRIG2_MSK                    /*!<DAC channel2 software trigger */

/*****************  Bit definition for DAC_DHR12R1 register  ******************/
#define DAC_DHR12R1_DACC1DHR_POS    (0U)
#define DAC_DHR12R1_DACC1DHR_MSK    (0xFFFUL << DAC_DHR12R1_DACC1DHR_POS)      /*!< 0x00000FFF */
#define DAC_DHR12R1_DACC1DHR        DAC_DHR12R1_DACC1DHR_MSK                   /*!<DAC channel1 12-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12L1 register  ******************/
#define DAC_DHR12L1_DACC1DHR_POS    (4U)
#define DAC_DHR12L1_DACC1DHR_MSK    (0xFFFUL << DAC_DHR12L1_DACC1DHR_POS)      /*!< 0x0000FFF0 */
#define DAC_DHR12L1_DACC1DHR        DAC_DHR12L1_DACC1DHR_MSK                   /*!<DAC channel1 12-bit Left aligned data */

/******************  Bit definition for DAC_DHR8R1 register  ******************/
#define DAC_DHR8R1_DACC1DHR_POS     (0U)
#define DAC_DHR8R1_DACC1DHR_MSK     (0xFFUL << DAC_DHR8R1_DACC1DHR_POS)        /*!< 0x000000FF */
#define DAC_DHR8R1_DACC1DHR         DAC_DHR8R1_DACC1DHR_MSK                    /*!<DAC channel1 8-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12R2 register  ******************/
#define DAC_DHR12R2_DACC2DHR_POS    (0U)
#define DAC_DHR12R2_DACC2DHR_MSK    (0xFFFUL << DAC_DHR12R2_DACC2DHR_POS)      /*!< 0x00000FFF */
#define DAC_DHR12R2_DACC2DHR        DAC_DHR12R2_DACC2DHR_MSK                   /*!<DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12L2 register  ******************/
#define DAC_DHR12L2_DACC2DHR_POS    (4U)
#define DAC_DHR12L2_DACC2DHR_MSK    (0xFFFUL << DAC_DHR12L2_DACC2DHR_POS)      /*!< 0x0000FFF0 */
#define DAC_DHR12L2_DACC2DHR        DAC_DHR12L2_DACC2DHR_MSK                   /*!<DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_DHR8R2 register  ******************/
#define DAC_DHR8R2_DACC2DHR_POS     (0U)
#define DAC_DHR8R2_DACC2DHR_MSK     (0xFFUL << DAC_DHR8R2_DACC2DHR_POS)        /*!< 0x000000FF */
#define DAC_DHR8R2_DACC2DHR         DAC_DHR8R2_DACC2DHR_MSK                    /*!<DAC channel2 8-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12RD register  ******************/
#define DAC_DHR12RD_DACC1DHR_POS    (0U)
#define DAC_DHR12RD_DACC1DHR_MSK    (0xFFFUL << DAC_DHR12RD_DACC1DHR_POS)      /*!< 0x00000FFF */
#define DAC_DHR12RD_DACC1DHR        DAC_DHR12RD_DACC1DHR_MSK                   /*!<DAC channel1 12-bit Right aligned data */
#define DAC_DHR12RD_DACC2DHR_POS    (16U)
#define DAC_DHR12RD_DACC2DHR_MSK    (0xFFFUL << DAC_DHR12RD_DACC2DHR_POS)      /*!< 0x0FFF0000 */
#define DAC_DHR12RD_DACC2DHR        DAC_DHR12RD_DACC2DHR_MSK                   /*!<DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12LD register  ******************/
#define DAC_DHR12LD_DACC1DHR_POS    (4U)
#define DAC_DHR12LD_DACC1DHR_MSK    (0xFFFUL << DAC_DHR12LD_DACC1DHR_POS)      /*!< 0x0000FFF0 */
#define DAC_DHR12LD_DACC1DHR        DAC_DHR12LD_DACC1DHR_MSK                   /*!<DAC channel1 12-bit Left aligned data */
#define DAC_DHR12LD_DACC2DHR_POS    (20U)
#define DAC_DHR12LD_DACC2DHR_MSK    (0xFFFUL << DAC_DHR12LD_DACC2DHR_POS)      /*!< 0xFFF00000 */
#define DAC_DHR12LD_DACC2DHR        DAC_DHR12LD_DACC2DHR_MSK                   /*!<DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_DHR8RD register  ******************/
#define DAC_DHR8RD_DACC1DHR_POS     (0U)
#define DAC_DHR8RD_DACC1DHR_MSK     (0xFFUL << DAC_DHR8RD_DACC1DHR_POS)        /*!< 0x000000FF */
#define DAC_DHR8RD_DACC1DHR         DAC_DHR8RD_DACC1DHR_MSK                    /*!<DAC channel1 8-bit Right aligned data */
#define DAC_DHR8RD_DACC2DHR_POS     (8U)
#define DAC_DHR8RD_DACC2DHR_MSK     (0xFFUL << DAC_DHR8RD_DACC2DHR_POS)        /*!< 0x0000FF00 */
#define DAC_DHR8RD_DACC2DHR         DAC_DHR8RD_DACC2DHR_MSK                    /*!<DAC channel2 8-bit Right aligned data */

/*******************  Bit definition for DAC_DOR1 register  *******************/
#define DAC_DOR1_DACC1DOR_POS       (0U)
#define DAC_DOR1_DACC1DOR_MSK       (0xFFFUL << DAC_DOR1_DACC1DOR_POS)         /*!< 0x00000FFF */
#define DAC_DOR1_DACC1DOR           DAC_DOR1_DACC1DOR_MSK                      /*!<DAC channel1 data output */

/*******************  Bit definition for DAC_DOR2 register  *******************/
#define DAC_DOR2_DACC2DOR_POS       (0U)
#define DAC_DOR2_DACC2DOR_MSK       (0xFFFUL << DAC_DOR2_DACC2DOR_POS)         /*!< 0x00000FFF */
#define DAC_DOR2_DACC2DOR           DAC_DOR2_DACC2DOR_MSK                      /*!<DAC channel2 data output */

