ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bit definition for DAC_SR register  ********************/
#define DAC_SR_DMAUDR1_POS          (13U)
#define DAC_SR_DMAUDR1_MSK          (0x1UL << DAC_SR_DMAUDR1_POS)              /*!< 0x00002000 */
#define DAC_SR_DMAUDR1              DAC_SR_DMAUDR1_MSK                         /*!<DAC channel1 DMA underrun flag */
#define DAC_SR_CAL_FLAG1_POS        (14U)
#define DAC_SR_CAL_FLAG1_MSK        (0x1UL << DAC_SR_CAL_FLAG1_POS)            /*!< 0x00004000 */
#define DAC_SR_CAL_FLAG1            DAC_SR_CAL_FLAG1_MSK                       /*!<DAC channel1 calibration offset status */
#define DAC_SR_BWST1_POS            (15U)
#define DAC_SR_BWST1_MSK            (0x1UL << DAC_SR_BWST1_POS)                /*!< 0x00008000 */
#define DAC_SR_BWST1                DAC_SR_BWST1_MSK                           /*!<DAC channel1 busy writing sample time flag */

#define DAC_SR_DMAUDR2_POS          (29U)
#define DAC_SR_DMAUDR2_MSK          (0x1UL << DAC_SR_DMAUDR2_POS)              /*!< 0x20000000 */
#define DAC_SR_DMAUDR2              DAC_SR_DMAUDR2_MSK                         /*!<DAC channel2 DMA underrun flag */
#define DAC_SR_CAL_FLAG2_POS        (30U)
#define DAC_SR_CAL_FLAG2_MSK        (0x1UL << DAC_SR_CAL_FLAG2_POS)            /*!< 0x40000000 */
#define DAC_SR_CAL_FLAG2            DAC_SR_CAL_FLAG2_MSK                       /*!<DAC channel2 calibration offset status */
#define DAC_SR_BWST2_POS            (31U)
#define DAC_SR_BWST2_MSK            (0x1UL << DAC_SR_BWST2_POS)                /*!< 0x80000000 */
#define DAC_SR_BWST2                DAC_SR_BWST2_MSK                           /*!<DAC channel2 busy writing sample time flag */

/*******************  Bit definition for DAC_CCR register  ********************/
#define DAC_CCR_OTRIM1_POS          (0U)
#define DAC_CCR_OTRIM1_MSK          (0x1FUL << DAC_CCR_OTRIM1_POS)             /*!< 0x0000001F */
#define DAC_CCR_OTRIM1              DAC_CCR_OTRIM1_MSK                         /*!<DAC channel1 offset trimming value */
#define DAC_CCR_OTRIM2_POS          (16U)
#define DAC_CCR_OTRIM2_MSK          (0x1FUL << DAC_CCR_OTRIM2_POS)             /*!< 0x001F0000 */
#define DAC_CCR_OTRIM2              DAC_CCR_OTRIM2_MSK                         /*!<DAC channel2 offset trimming value */

/*******************  Bit definition for DAC_MCR register  *******************/
#define DAC_MCR_MODE1_POS           (0U)
#define DAC_MCR_MODE1_MSK           (0x7UL << DAC_MCR_MODE1_POS)               /*!< 0x00000007 */
#define DAC_MCR_MODE1               DAC_MCR_MODE1_MSK                          /*!<MODE1[2:0] (DAC channel1 mode) */
#define DAC_MCR_MODE1_0             (0x1UL << DAC_MCR_MODE1_POS)               /*!< 0x00000001 */
#define DAC_MCR_MODE1_1             (0x2UL << DAC_MCR_MODE1_POS)               /*!< 0x00000002 */
#define DAC_MCR_MODE1_2             (0x4UL << DAC_MCR_MODE1_POS)               /*!< 0x00000004 */

#define DAC_MCR_MODE2_POS           (16U)
#define DAC_MCR_MODE2_MSK           (0x7UL << DAC_MCR_MODE2_POS)               /*!< 0x00070000 */
#define DAC_MCR_MODE2               DAC_MCR_MODE2_MSK                          /*!<MODE2[2:0] (DAC channel2 mode) */
#define DAC_MCR_MODE2_0             (0x1UL << DAC_MCR_MODE2_POS)               /*!< 0x00010000 */
#define DAC_MCR_MODE2_1             (0x2UL << DAC_MCR_MODE2_POS)               /*!< 0x00020000 */
#define DAC_MCR_MODE2_2             (0x4UL << DAC_MCR_MODE2_POS)               /*!< 0x00040000 */

/******************  Bit definition for DAC_SHSR1 register  ******************/
#define DAC_SHSR1_TSAMPLE1_POS      (0U)
#define DAC_SHSR1_TSAMPLE1_MSK      (0x3FFUL << DAC_SHSR1_TSAMPLE1_POS)        /*!< 0x000003FF */
#define DAC_SHSR1_TSAMPLE1          DAC_SHSR1_TSAMPLE1_MSK                     /*!<DAC channel1 sample time */

/******************  Bit definition for DAC_SHSR2 register  ******************/
#define DAC_SHSR2_TSAMPLE2_POS      (0U)
#define DAC_SHSR2_TSAMPLE2_MSK      (0x3FFUL << DAC_SHSR2_TSAMPLE2_POS)        /*!< 0x000003FF */
#define DAC_SHSR2_TSAMPLE2          DAC_SHSR2_TSAMPLE2_MSK                     /*!<DAC channel2 sample time */

/******************  Bit definition for DAC_SHHR register  ******************/
#define DAC_SHHR_THOLD1_POS         (0U)
#define DAC_SHHR_THOLD1_MSK         (0x3FFUL << DAC_SHHR_THOLD1_POS)           /*!< 0x000003FF */
#define DAC_SHHR_THOLD1             DAC_SHHR_THOLD1_MSK                        /*!<DAC channel1 hold time */
#define DAC_SHHR_THOLD2_POS         (16U)
#define DAC_SHHR_THOLD2_MSK         (0x3FFUL << DAC_SHHR_THOLD2_POS)           /*!< 0x03FF0000 */
#define DAC_SHHR_THOLD2             DAC_SHHR_THOLD2_MSK                        /*!<DAC channel2 hold time */

/******************  Bit definition for DAC_SHRR register  ******************/
#define DAC_SHRR_TREFRESH1_POS      (0U)
#define DAC_SHRR_TREFRESH1_MSK      (0xFFUL << DAC_SHRR_TREFRESH1_POS)         /*!< 0x000000FF */
#define DAC_SHRR_TREFRESH1          DAC_SHRR_TREFRESH1_MSK                     /*!<DAC channel1 refresh time */
#define DAC_SHRR_TREFRESH2_POS      (16U)
#define DAC_SHRR_TREFRESH2_MSK      (0xFFUL << DAC_SHRR_TREFRESH2_POS)         /*!< 0x00FF0000 */
#define DAC_SHRR_TREFRESH2          DAC_SHRR_TREFRESH2_MSK                     /*!<DAC channel2 refresh time */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- VREFBUF REGISTERS ------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief VREFBUF
  */
typedef struct
{
  volatile uint32 CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
  volatile uint32 CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TYPEDEF;

#define VREFBUF             (*(VREFBUF_TYPEDEF *) VREFBUF_BASE)

/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_POS    (0U)
#define VREFBUF_CSR_ENVR_MSK    (0x1UL << VREFBUF_CSR_ENVR_POS)                /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR        VREFBUF_CSR_ENVR_MSK                           /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_POS     (1U)
#define VREFBUF_CSR_HIZ_MSK     (0x1UL << VREFBUF_CSR_HIZ_POS)                 /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ         VREFBUF_CSR_HIZ_MSK                            /*!<High impedance mode             */
#define VREFBUF_CSR_VRS_POS     (2U)
#define VREFBUF_CSR_VRS_MSK     (0x1UL << VREFBUF_CSR_VRS_POS)                 /*!< 0x00000004 */
#define VREFBUF_CSR_VRS         VREFBUF_CSR_VRS_MSK                            /*!<Voltage reference scale         */
#define VREFBUF_CSR_VRR_POS     (3U)
#define VREFBUF_CSR_VRR_MSK     (0x1UL << VREFBUF_CSR_VRR_POS)                 /*!< 0x00000008 */
#define VREFBUF_CSR_VRR         VREFBUF_CSR_VRR_MSK                            /*!<Voltage reference buffer ready  */

/*******************  Bit definition for VREFBUF_CCR register  ******************/
#define VREFBUF_CCR_TRIM_POS    (0U)
#define VREFBUF_CCR_TRIM_MSK    (0x3FUL << VREFBUF_CCR_TRIM_POS)               /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM        VREFBUF_CCR_TRIM_MSK                           /*!<TRIM[5:0] bits (Trimming code)  */





