ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- CRC REGISTERS ----------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief CRC calculation unit
  */
typedef struct
{
  volatile uint32 DR;             /*!< CRC Data register,                         Address offset: 0x00 */
  volatile uint32 IDR;            /*!< CRC Independent data register,             Address offset: 0x04 */
  volatile uint32 CR;             /*!< CRC Control register,                      Address offset: 0x08 */
       uint32 RESERVED1;      /*!< Reserved,                                                  0x0C */
  volatile uint32 INIT;           /*!< Initial CRC value register,                Address offset: 0x10 */
  volatile uint32 POL;            /*!< CRC polynomial register,                   Address offset: 0x14 */
} CRC_TYPEDEF;

#define CRC                 (*(CRC_TYPEDEF *) CRC_BASE)

/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_POS            (0U)
#define CRC_DR_DR_MSK            (0xFFFFFFFFUL << CRC_DR_DR_POS)                /*!< 0xFFFFFFFF */
#define CRC_DR_DR                CRC_DR_DR_MSK                                  /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_POS          (0U)
#define CRC_IDR_IDR_MSK          (0xFFFFFFFFUL << CRC_IDR_IDR_POS)              /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR              CRC_IDR_IDR_MSK                                /*!< General-purpose 32-bits data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_POS         (0U)
#define CRC_CR_RESET_MSK         (0x1UL << CRC_CR_RESET_POS)                    /*!< 0x00000001 */
#define CRC_CR_RESET             CRC_CR_RESET_MSK                               /*!< RESET the CRC computation unit bit */
#define CRC_CR_POLYSIZE_POS      (3U)
#define CRC_CR_POLYSIZE_MSK      (0x3UL << CRC_CR_POLYSIZE_POS)                 /*!< 0x00000018 */
#define CRC_CR_POLYSIZE          CRC_CR_POLYSIZE_MSK                            /*!< Polynomial size bits */
#define CRC_CR_POLYSIZE_0        (0x1UL << CRC_CR_POLYSIZE_POS)                 /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1        (0x2UL << CRC_CR_POLYSIZE_POS)                 /*!< 0x00000010 */
#define CRC_CR_REV_IN_POS        (5U)
#define CRC_CR_REV_IN_MSK        (0x3UL << CRC_CR_REV_IN_POS)                   /*!< 0x00000060 */
#define CRC_CR_REV_IN            CRC_CR_REV_IN_MSK                              /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0          (0x1UL << CRC_CR_REV_IN_POS)                   /*!< 0x00000020 */
#define CRC_CR_REV_IN_1          (0x2UL << CRC_CR_REV_IN_POS)                   /*!< 0x00000040 */
#define CRC_CR_REV_OUT_POS       (7U)
#define CRC_CR_REV_OUT_MSK       (0x1UL << CRC_CR_REV_OUT_POS)                  /*!< 0x00000080 */
#define CRC_CR_REV_OUT           CRC_CR_REV_OUT_MSK                             /*!< REV_OUT Reverse Output Data bits */

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_POS        (0U)
#define CRC_INIT_INIT_MSK        (0xFFFFFFFFUL << CRC_INIT_INIT_POS)            /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT            CRC_INIT_INIT_MSK                              /*!< Initial CRC value bits */

/*******************  Bit definition for CRC_POL register  ********************/
#define CRC_POL_POL_POS          (0U)
#define CRC_POL_POL_MSK          (0xFFFFFFFFUL << CRC_POL_POL_POS)              /*!< 0xFFFFFFFF */
#define CRC_POL_POL              CRC_POL_POL_MSK                                /*!< Coefficients of the polynomial */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- COMPARATOR REGISTERS ---------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief Comparator
  */
typedef struct
{
  volatile uint32 CSR;         /*!< COMP control and status register,                                                 Address offset: 0x00 */
} COMP_TYPEDEF;

typedef struct
{
  volatile uint32 CSR_ODD;    /*!< COMP control and status register located in register of comparator instance odd, used for bits common to several COMP instances, Address offset: 0x00 */
  volatile uint32 CSR_EVEN;   /*!< COMP control and status register located in register of comparator instance even, used for bits common to several COMP instances, Address offset: 0x04 */
} COMP_COMMON_TYPEDEF;

#define COMP1               (*(COMP_TYPEDEF *) COMP1_BASE)
#define COMP2               (*(COMP_TYPEDEF *) COMP2_BASE)
#define COMP12_COMMON       (*(COMP_COMMON_TYPEDEF *) COMP1_BASE)

/**********************  Bit definition for COMP_CSR register  ****************/
#define COMP_CSR_EN_POS            (0U)
#define COMP_CSR_EN_MSK            (0x1UL << COMP_CSR_EN_POS)                  /*!< 0x00000001 */
#define COMP_CSR_EN                COMP_CSR_EN_MSK                             /*!< Comparator enable */

#define COMP_CSR_INMSEL_POS        (4U)
#define COMP_CSR_INMSEL_MSK        (0xFUL << COMP_CSR_INMSEL_POS)              /*!< 0x000000F0 */
#define COMP_CSR_INMSEL            COMP_CSR_INMSEL_MSK                         /*!< Comparator input minus selection */
#define COMP_CSR_INMSEL_0          (0x1UL << COMP_CSR_INMSEL_POS)              /*!< 0x00000010 */
#define COMP_CSR_INMSEL_1          (0x2UL << COMP_CSR_INMSEL_POS)              /*!< 0x00000020 */
#define COMP_CSR_INMSEL_2          (0x4UL << COMP_CSR_INMSEL_POS)              /*!< 0x00000040 */
#define COMP_CSR_INMSEL_3          (0x8UL << COMP_CSR_INMSEL_POS)              /*!< 0x00000080 */

#define COMP_CSR_INPSEL_POS        (8U)
#define COMP_CSR_INPSEL_MSK        (0x3UL << COMP_CSR_INPSEL_POS)              /*!< 0x00000300 */
#define COMP_CSR_INPSEL            COMP_CSR_INPSEL_MSK                         /*!< Comparator plus minus selection */
#define COMP_CSR_INPSEL_0          (0x1UL << COMP_CSR_INPSEL_POS)              /*!< 0x00000100 */
#define COMP_CSR_INPSEL_1          (0x2UL << COMP_CSR_INPSEL_POS)              /*!< 0x00000200 */

#define COMP_CSR_WINMODE_POS       (11U)
#define COMP_CSR_WINMODE_MSK       (0x1UL << COMP_CSR_WINMODE_POS)             /*!< 0x00000800 */
#define COMP_CSR_WINMODE           COMP_CSR_WINMODE_MSK                        /*!< Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TYPEDEF) */
#define COMP_CSR_WINOUT_POS        (14U)
#define COMP_CSR_WINOUT_MSK        (0x1UL << COMP_CSR_WINOUT_POS)              /*!< 0x00004000 */
#define COMP_CSR_WINOUT            COMP_CSR_WINOUT_MSK                         /*!< Pair of comparators window output level. Bit intended to be used with COMP common instance (COMP_Common_TYPEDEF) */

