ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define COMP_CSR_POLARITY_POS      (15U)
#define COMP_CSR_POLARITY_MSK      (0x1UL << COMP_CSR_POLARITY_POS)            /*!< 0x00008000 */
#define COMP_CSR_POLARITY          COMP_CSR_POLARITY_MSK                       /*!< Comparator output polarity */

#define COMP_CSR_HYST_POS          (16U)
#define COMP_CSR_HYST_MSK          (0x3UL << COMP_CSR_HYST_POS)                /*!< 0x00030000 */
#define COMP_CSR_HYST              COMP_CSR_HYST_MSK                           /*!< Comparator input hysteresis */
#define COMP_CSR_HYST_0            (0x1UL << COMP_CSR_HYST_POS)                /*!< 0x00010000 */
#define COMP_CSR_HYST_1            (0x2UL << COMP_CSR_HYST_POS)                /*!< 0x00020000 */

#define COMP_CSR_PWRMODE_POS       (18U)
#define COMP_CSR_PWRMODE_MSK       (0x3UL << COMP_CSR_PWRMODE_POS)             /*!< 0x000C0000 */
#define COMP_CSR_PWRMODE           COMP_CSR_PWRMODE_MSK                        /*!< Comparator power mode */
#define COMP_CSR_PWRMODE_0         (0x1UL << COMP_CSR_PWRMODE_POS)             /*!< 0x00040000 */
#define COMP_CSR_PWRMODE_1         (0x2UL << COMP_CSR_PWRMODE_POS)             /*!< 0x00080000 */

#define COMP_CSR_BLANKING_POS      (20U)
#define COMP_CSR_BLANKING_MSK      (0x1FUL << COMP_CSR_BLANKING_POS)           /*!< 0x01F00000 */
#define COMP_CSR_BLANKING          COMP_CSR_BLANKING_MSK                       /*!< Comparator blanking source */
#define COMP_CSR_BLANKING_0        (0x01UL << COMP_CSR_BLANKING_POS)           /*!< 0x00100000 */
#define COMP_CSR_BLANKING_1        (0x02UL << COMP_CSR_BLANKING_POS)           /*!< 0x00200000 */
#define COMP_CSR_BLANKING_2        (0x04UL << COMP_CSR_BLANKING_POS)           /*!< 0x00400000 */
#define COMP_CSR_BLANKING_3        (0x08UL << COMP_CSR_BLANKING_POS)           /*!< 0x00800000 */
#define COMP_CSR_BLANKING_4        (0x10UL << COMP_CSR_BLANKING_POS)           /*!< 0x01000000 */

#define COMP_CSR_VALUE_POS         (30U)
#define COMP_CSR_VALUE_MSK         (0x1UL << COMP_CSR_VALUE_POS)               /*!< 0x40000000 */
#define COMP_CSR_VALUE             COMP_CSR_VALUE_MSK                          /*!< Comparator output level */

#define COMP_CSR_LOCK_POS          (31U)
#define COMP_CSR_LOCK_MSK          (0x1UL << COMP_CSR_LOCK_POS)                /*!< 0x80000000 */
#define COMP_CSR_LOCK              COMP_CSR_LOCK_MSK                           /*!< Comparator lock */





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- HDMI CEC REGISTERS --------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief HDMI-CEC
  */
typedef struct
{
  volatile uint32 CR;           /*!< CEC control register,                                       Address offset:0x00 */
  volatile uint32 CFGR;         /*!< CEC configuration register,                                 Address offset:0x04 */
  volatile uint32 TXDR;         /*!< CEC Tx data register ,                                      Address offset:0x08 */
  volatile uint32 RXDR;         /*!< CEC Rx Data Register,                                       Address offset:0x0C */
  volatile uint32 ISR;          /*!< CEC Interrupt and Status Register,                          Address offset:0x10 */
  volatile uint32 IER;          /*!< CEC interrupt enable register,                              Address offset:0x14 */
}CEC_TYPEDEF;


#define CEC                 (*(CEC_TYPEDEF *) CEC_BASE)

/*******************  Bit definition for CEC_CR register  *********************/
#define CEC_CR_CECEN_POS         (0U)
#define CEC_CR_CECEN_MSK         (0x1UL << CEC_CR_CECEN_POS)                    /*!< 0x00000001 */
#define CEC_CR_CECEN             CEC_CR_CECEN_MSK                               /*!< CEC Enable                         */
#define CEC_CR_TXSOM_POS         (1U)
#define CEC_CR_TXSOM_MSK         (0x1UL << CEC_CR_TXSOM_POS)                    /*!< 0x00000002 */
#define CEC_CR_TXSOM             CEC_CR_TXSOM_MSK                               /*!< CEC Tx Start Of Message            */
#define CEC_CR_TXEOM_POS         (2U)
#define CEC_CR_TXEOM_MSK         (0x1UL << CEC_CR_TXEOM_POS)                    /*!< 0x00000004 */
#define CEC_CR_TXEOM             CEC_CR_TXEOM_MSK                               /*!< CEC Tx End Of Message              */

/*******************  Bit definition for CEC_CFGR register  *******************/
#define CEC_CFGR_SFT_POS         (0U)
#define CEC_CFGR_SFT_MSK         (0x7UL << CEC_CFGR_SFT_POS)                    /*!< 0x00000007 */
#define CEC_CFGR_SFT             CEC_CFGR_SFT_MSK                               /*!< CEC Signal Free Time               */
#define CEC_CFGR_RXTOL_POS       (3U)
#define CEC_CFGR_RXTOL_MSK       (0x1UL << CEC_CFGR_RXTOL_POS)                  /*!< 0x00000008 */
#define CEC_CFGR_RXTOL           CEC_CFGR_RXTOL_MSK                             /*!< CEC Tolerance                      */
#define CEC_CFGR_BRESTP_POS      (4U)
#define CEC_CFGR_BRESTP_MSK      (0x1UL << CEC_CFGR_BRESTP_POS)                 /*!< 0x00000010 */
#define CEC_CFGR_BRESTP          CEC_CFGR_BRESTP_MSK                            /*!< CEC Rx Stop                        */
#define CEC_CFGR_BREGEN_POS      (5U)
#define CEC_CFGR_BREGEN_MSK      (0x1UL << CEC_CFGR_BREGEN_POS)                 /*!< 0x00000020 */
#define CEC_CFGR_BREGEN          CEC_CFGR_BREGEN_MSK                            /*!< CEC Bit Rising Error generation    */
#define CEC_CFGR_LBPEGEN_POS     (6U)
#define CEC_CFGR_LBPEGEN_MSK     (0x1UL << CEC_CFGR_LBPEGEN_POS)                /*!< 0x00000040 */
#define CEC_CFGR_LBPEGEN         CEC_CFGR_LBPEGEN_MSK                           /*!< CEC Long Bit Period Error gener.   */
#define CEC_CFGR_BRDNOGEN_POS    (7U)
#define CEC_CFGR_BRDNOGEN_MSK    (0x1UL << CEC_CFGR_BRDNOGEN_POS)               /*!< 0x00000080 */
#define CEC_CFGR_BRDNOGEN        CEC_CFGR_BRDNOGEN_MSK                          /*!< CEC Broadcast No Error generation  */
#define CEC_CFGR_SFTOPT_POS      (8U)
#define CEC_CFGR_SFTOPT_MSK      (0x1UL << CEC_CFGR_SFTOPT_POS)                 /*!< 0x00000100 */
#define CEC_CFGR_SFTOPT          CEC_CFGR_SFTOPT_MSK                            /*!< CEC Signal Free Time optional      */
#define CEC_CFGR_OAR_POS         (16U)
#define CEC_CFGR_OAR_MSK         (0x7FFFUL << CEC_CFGR_OAR_POS)                 /*!< 0x7FFF0000 */
#define CEC_CFGR_OAR             CEC_CFGR_OAR_MSK                               /*!< CEC Own Address                    */
#define CEC_CFGR_LSTN_POS        (31U)
#define CEC_CFGR_LSTN_MSK        (0x1UL << CEC_CFGR_LSTN_POS)                   /*!< 0x80000000 */
#define CEC_CFGR_LSTN            CEC_CFGR_LSTN_MSK                              /*!< CEC Listen mode                    */

