ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/*******************  Bit definition for CEC_TXDR register  *******************/
#define CEC_TXDR_TXD_POS         (0U)
#define CEC_TXDR_TXD_MSK         (0xFFUL << CEC_TXDR_TXD_POS)                   /*!< 0x000000FF */
#define CEC_TXDR_TXD             CEC_TXDR_TXD_MSK                               /*!< CEC Tx Data                        */

/*******************  Bit definition for CEC_RXDR register  *******************/
#define CEC_RXDR_RXD_POS         (0U)
#define CEC_RXDR_RXD_MSK         (0xFFUL << CEC_RXDR_RXD_POS)                   /*!< 0x000000FF */
#define CEC_RXDR_RXD             CEC_RXDR_RXD_MSK                               /*!< CEC Rx Data                        */

/*******************  Bit definition for CEC_ISR register  ********************/
#define CEC_ISR_RXBR_POS         (0U)
#define CEC_ISR_RXBR_MSK         (0x1UL << CEC_ISR_RXBR_POS)                    /*!< 0x00000001 */
#define CEC_ISR_RXBR             CEC_ISR_RXBR_MSK                               /*!< CEC Rx-Byte Received                   */
#define CEC_ISR_RXEND_POS        (1U)
#define CEC_ISR_RXEND_MSK        (0x1UL << CEC_ISR_RXEND_POS)                   /*!< 0x00000002 */
#define CEC_ISR_RXEND            CEC_ISR_RXEND_MSK                              /*!< CEC End Of Reception                   */
#define CEC_ISR_RXOVR_POS        (2U)
#define CEC_ISR_RXOVR_MSK        (0x1UL << CEC_ISR_RXOVR_POS)                   /*!< 0x00000004 */
#define CEC_ISR_RXOVR            CEC_ISR_RXOVR_MSK                              /*!< CEC Rx-Overrun                         */
#define CEC_ISR_BRE_POS          (3U)
#define CEC_ISR_BRE_MSK          (0x1UL << CEC_ISR_BRE_POS)                     /*!< 0x00000008 */
#define CEC_ISR_BRE              CEC_ISR_BRE_MSK                                /*!< CEC Rx Bit Rising Error                */
#define CEC_ISR_SBPE_POS         (4U)
#define CEC_ISR_SBPE_MSK         (0x1UL << CEC_ISR_SBPE_POS)                    /*!< 0x00000010 */
#define CEC_ISR_SBPE             CEC_ISR_SBPE_MSK                               /*!< CEC Rx Short Bit period Error          */
#define CEC_ISR_LBPE_POS         (5U)
#define CEC_ISR_LBPE_MSK         (0x1UL << CEC_ISR_LBPE_POS)                    /*!< 0x00000020 */
#define CEC_ISR_LBPE             CEC_ISR_LBPE_MSK                               /*!< CEC Rx Long Bit period Error           */
#define CEC_ISR_RXACKE_POS       (6U)
#define CEC_ISR_RXACKE_MSK       (0x1UL << CEC_ISR_RXACKE_POS)                  /*!< 0x00000040 */
#define CEC_ISR_RXACKE           CEC_ISR_RXACKE_MSK                             /*!< CEC Rx Missing Acknowledge             */
#define CEC_ISR_ARBLST_POS       (7U)
#define CEC_ISR_ARBLST_MSK       (0x1UL << CEC_ISR_ARBLST_POS)                  /*!< 0x00000080 */
#define CEC_ISR_ARBLST           CEC_ISR_ARBLST_MSK                             /*!< CEC Arbitration Lost                   */
#define CEC_ISR_TXBR_POS         (8U)
#define CEC_ISR_TXBR_MSK         (0x1UL << CEC_ISR_TXBR_POS)                    /*!< 0x00000100 */
#define CEC_ISR_TXBR             CEC_ISR_TXBR_MSK                               /*!< CEC Tx Byte Request                    */
#define CEC_ISR_TXEND_POS        (9U)
#define CEC_ISR_TXEND_MSK        (0x1UL << CEC_ISR_TXEND_POS)                   /*!< 0x00000200 */
#define CEC_ISR_TXEND            CEC_ISR_TXEND_MSK                              /*!< CEC End of Transmission                */
#define CEC_ISR_TXUDR_POS        (10U)
#define CEC_ISR_TXUDR_MSK        (0x1UL << CEC_ISR_TXUDR_POS)                   /*!< 0x00000400 */
#define CEC_ISR_TXUDR            CEC_ISR_TXUDR_MSK                              /*!< CEC Tx-Buffer Underrun                 */
#define CEC_ISR_TXERR_POS        (11U)
#define CEC_ISR_TXERR_MSK        (0x1UL << CEC_ISR_TXERR_POS)                   /*!< 0x00000800 */
#define CEC_ISR_TXERR            CEC_ISR_TXERR_MSK                              /*!< CEC Tx-Error                           */
#define CEC_ISR_TXACKE_POS       (12U)
#define CEC_ISR_TXACKE_MSK       (0x1UL << CEC_ISR_TXACKE_POS)                  /*!< 0x00001000 */
#define CEC_ISR_TXACKE           CEC_ISR_TXACKE_MSK                             /*!< CEC Tx Missing Acknowledge             */

/*******************  Bit definition for CEC_IER register  ********************/
#define CEC_IER_RXBRIE_POS       (0U)
#define CEC_IER_RXBRIE_MSK       (0x1UL << CEC_IER_RXBRIE_POS)                  /*!< 0x00000001 */
#define CEC_IER_RXBRIE           CEC_IER_RXBRIE_MSK                             /*!< CEC Rx-Byte Received IT Enable         */
#define CEC_IER_RXENDIE_POS      (1U)
#define CEC_IER_RXENDIE_MSK      (0x1UL << CEC_IER_RXENDIE_POS)                 /*!< 0x00000002 */
#define CEC_IER_RXENDIE          CEC_IER_RXENDIE_MSK                            /*!< CEC End Of Reception IT Enable         */
#define CEC_IER_RXOVRIE_POS      (2U)
#define CEC_IER_RXOVRIE_MSK      (0x1UL << CEC_IER_RXOVRIE_POS)                 /*!< 0x00000004 */
#define CEC_IER_RXOVRIE          CEC_IER_RXOVRIE_MSK                            /*!< CEC Rx-Overrun IT Enable               */
#define CEC_IER_BREIE_POS        (3U)
#define CEC_IER_BREIE_MSK        (0x1UL << CEC_IER_BREIE_POS)                   /*!< 0x00000008 */
#define CEC_IER_BREIE            CEC_IER_BREIE_MSK                              /*!< CEC Rx Bit Rising Error IT Enable      */
#define CEC_IER_SBPEIE_POS       (4U)
#define CEC_IER_SBPEIE_MSK       (0x1UL << CEC_IER_SBPEIE_POS)                  /*!< 0x00000010 */
#define CEC_IER_SBPEIE           CEC_IER_SBPEIE_MSK                             /*!< CEC Rx Short Bit period Error IT Enable*/
#define CEC_IER_LBPEIE_POS       (5U)
#define CEC_IER_LBPEIE_MSK       (0x1UL << CEC_IER_LBPEIE_POS)                  /*!< 0x00000020 */
#define CEC_IER_LBPEIE           CEC_IER_LBPEIE_MSK                             /*!< CEC Rx Long Bit period Error IT Enable */
#define CEC_IER_RXACKEIE_POS     (6U)
#define CEC_IER_RXACKEIE_MSK     (0x1UL << CEC_IER_RXACKEIE_POS)                /*!< 0x00000040 */
#define CEC_IER_RXACKEIE         CEC_IER_RXACKEIE_MSK                           /*!< CEC Rx Missing Acknowledge IT Enable   */
#define CEC_IER_ARBLSTIE_POS     (7U)
#define CEC_IER_ARBLSTIE_MSK     (0x1UL << CEC_IER_ARBLSTIE_POS)                /*!< 0x00000080 */
#define CEC_IER_ARBLSTIE         CEC_IER_ARBLSTIE_MSK                           /*!< CEC Arbitration Lost IT Enable         */
#define CEC_IER_TXBRIE_POS       (8U)
#define CEC_IER_TXBRIE_MSK       (0x1UL << CEC_IER_TXBRIE_POS)                  /*!< 0x00000100 */
#define CEC_IER_TXBRIE           CEC_IER_TXBRIE_MSK                             /*!< CEC Tx Byte Request  IT Enable         */
#define CEC_IER_TXENDIE_POS      (9U)
#define CEC_IER_TXENDIE_MSK      (0x1UL << CEC_IER_TXENDIE_POS)                 /*!< 0x00000200 */
#define CEC_IER_TXENDIE          CEC_IER_TXENDIE_MSK                            /*!< CEC End of Transmission IT Enable      */
#define CEC_IER_TXUDRIE_POS      (10U)
#define CEC_IER_TXUDRIE_MSK      (0x1UL << CEC_IER_TXUDRIE_POS)                 /*!< 0x00000400 */
#define CEC_IER_TXUDRIE          CEC_IER_TXUDRIE_MSK                            /*!< CEC Tx-Buffer Underrun IT Enable       */
#define CEC_IER_TXERRIE_POS      (11U)
#define CEC_IER_TXERRIE_MSK      (0x1UL << CEC_IER_TXERRIE_POS)                 /*!< 0x00000800 */
#define CEC_IER_TXERRIE          CEC_IER_TXERRIE_MSK                            /*!< CEC Tx-Error IT Enable                 */
#define CEC_IER_TXACKEIE_POS     (12U)
#define CEC_IER_TXACKEIE_MSK     (0x1UL << CEC_IER_TXACKEIE_POS)                /*!< 0x00001000 */
#define CEC_IER_TXACKEIE         CEC_IER_TXACKEIE_MSK                           /*!< CEC Tx Missing Acknowledge IT Enable   */





