ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- TAMPER AND BACKUP REGISTERS --------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief Tamper and backup registers
  */
typedef struct
{
  volatile uint32 CR1;            /*!< TAMP configuration register 1,                             Address offset: 0x00 */
  volatile uint32 CR2;            /*!< TAMP configuration register 2,                             Address offset: 0x04 */
       uint32 RESERVED0;      /*!< Reserved                                                   Address offset: 0x08 */
  volatile uint32 FLTCR;          /*!< Reserved                                                   Address offset: 0x0C */
       uint32 RESERVED1[7];   /*!< Reserved                                                   Address offset: 0x10 -- 0x28 */
  volatile uint32 IER;            /*!< TAMP Interrupt enable register,                            Address offset: 0x2C */
  volatile uint32 SR;             /*!< TAMP Status register,                                      Address offset: 0x30 */
  volatile uint32 MISR;           /*!< TAMP Masked Interrupt Status register,                     Address offset: 0x34 */
       uint32 RESERVED2;      /*!< Reserved                                                   Address offset: 0x38 */
  volatile uint32 SCR;            /*!< TAMP Status clear register,                                Address offset: 0x3C */
       uint32 RESERVED3[48];  /*!< Reserved                                                   Address offset: 0x54 -- 0xFC */
  volatile uint32 BKP0R;          /*!< TAMP backup register 0,                                    Address offset: 0x100 */
  volatile uint32 BKP1R;          /*!< TAMP backup register 1,                                    Address offset: 0x104 */
  volatile uint32 BKP2R;          /*!< TAMP backup register 2,                                    Address offset: 0x108 */
  volatile uint32 BKP3R;          /*!< TAMP backup register 3,                                    Address offset: 0x10C */
  volatile uint32 BKP4R;          /*!< TAMP backup register 4,                                    Address offset: 0x110 */
} TAMP_TYPEDEF;

#define TAMP                (*(TAMP_TYPEDEF *) TAMP_BASE)


/********************  Bits definition for TAMP_CR1 register  *****************/
#define TAMP_CR1_TAMP1E_POS          (0U)
#define TAMP_CR1_TAMP1E_MSK          (0x1UL << TAMP_CR1_TAMP1E_POS)             /*!< 0x00000001 */
#define TAMP_CR1_TAMP1E              TAMP_CR1_TAMP1E_MSK
#define TAMP_CR1_TAMP2E_POS          (1U)
#define TAMP_CR1_TAMP2E_MSK          (0x1UL << TAMP_CR1_TAMP2E_POS)             /*!< 0x00000002 */
#define TAMP_CR1_TAMP2E              TAMP_CR1_TAMP2E_MSK
#define TAMP_CR1_ITAMP3E_POS         (18U)
#define TAMP_CR1_ITAMP3E_MSK         (0x1UL << TAMP_CR1_ITAMP3E_POS)            /*!< 0x00040000 */
#define TAMP_CR1_ITAMP3E             TAMP_CR1_ITAMP3E_MSK
#define TAMP_CR1_ITAMP4E_POS         (19U)
#define TAMP_CR1_ITAMP4E_MSK         (0x1UL << TAMP_CR1_ITAMP4E_POS)            /*!< 0x00080000 */
#define TAMP_CR1_ITAMP4E             TAMP_CR1_ITAMP4E_MSK
#define TAMP_CR1_ITAMP5E_POS         (20U)
#define TAMP_CR1_ITAMP5E_MSK         (0x1UL << TAMP_CR1_ITAMP5E_POS)            /*!< 0x00100000 */
#define TAMP_CR1_ITAMP5E             TAMP_CR1_ITAMP5E_MSK
#define TAMP_CR1_ITAMP6E_POS         (21U)
#define TAMP_CR1_ITAMP6E_MSK         (0x1UL << TAMP_CR1_ITAMP6E_POS)            /*!< 0x00200000 */
#define TAMP_CR1_ITAMP6E             TAMP_CR1_ITAMP6E_MSK

/********************  Bits definition for TAMP_CR2 register  *****************/
#define TAMP_CR2_TAMP1NOERASE_POS    (0U)
#define TAMP_CR2_TAMP1NOERASE_MSK    (0x1UL << TAMP_CR2_TAMP1NOERASE_POS)       /*!< 0x00000001 */
#define TAMP_CR2_TAMP1NOERASE        TAMP_CR2_TAMP1NOERASE_MSK
#define TAMP_CR2_TAMP2NOERASE_POS    (1U)
#define TAMP_CR2_TAMP2NOERASE_MSK    (0x1UL << TAMP_CR2_TAMP2NOERASE_POS)       /*!< 0x00000002 */
#define TAMP_CR2_TAMP2NOERASE        TAMP_CR2_TAMP2NOERASE_MSK
#define TAMP_CR2_TAMP1MSK_POS        (16U)
#define TAMP_CR2_TAMP1MSK_MSK        (0x1UL << TAMP_CR2_TAMP1MSK_POS)           /*!< 0x00010000 */
#define TAMP_CR2_TAMP1MSK            TAMP_CR2_TAMP1MSK_MSK
#define TAMP_CR2_TAMP2MSK_POS        (17U)
#define TAMP_CR2_TAMP2MSK_MSK        (0x1UL << TAMP_CR2_TAMP2MSK_POS)           /*!< 0x00020000 */
#define TAMP_CR2_TAMP2MSK            TAMP_CR2_TAMP2MSK_MSK
#define TAMP_CR2_TAMP1TRG_POS        (24U)
#define TAMP_CR2_TAMP1TRG_MSK        (0x1UL << TAMP_CR2_TAMP1TRG_POS)           /*!< 0x01000000 */
#define TAMP_CR2_TAMP1TRG            TAMP_CR2_TAMP1TRG_MSK
#define TAMP_CR2_TAMP2TRG_POS        (25U)
#define TAMP_CR2_TAMP2TRG_MSK        (0x1UL << TAMP_CR2_TAMP2TRG_POS)           /*!< 0x02000000 */
#define TAMP_CR2_TAMP2TRG            TAMP_CR2_TAMP2TRG_MSK

/********************  Bits definition for TAMP_FLTCR register  ***************/
#define TAMP_FLTCR_TAMPFREQ_0        0x00000001U
#define TAMP_FLTCR_TAMPFREQ_1        0x00000002U
#define TAMP_FLTCR_TAMPFREQ_2        0x00000004U
#define TAMP_FLTCR_TAMPFREQ_POS      (0U)
#define TAMP_FLTCR_TAMPFREQ_MSK      (0x7UL << TAMP_FLTCR_TAMPFREQ_POS)         /*!< 0x00000007 */
#define TAMP_FLTCR_TAMPFREQ          TAMP_FLTCR_TAMPFREQ_MSK
#define TAMP_FLTCR_TAMPFLT_0         0x00000008U
#define TAMP_FLTCR_TAMPFLT_1         0x00000010U
#define TAMP_FLTCR_TAMPFLT_POS       (3U)
#define TAMP_FLTCR_TAMPFLT_MSK       (0x3UL << TAMP_FLTCR_TAMPFLT_POS)          /*!< 0x00000018 */
#define TAMP_FLTCR_TAMPFLT           TAMP_FLTCR_TAMPFLT_MSK
#define TAMP_FLTCR_TAMPPRCH_0        0x00000020U
#define TAMP_FLTCR_TAMPPRCH_1        0x00000040U
#define TAMP_FLTCR_TAMPPRCH_POS      (5U)
#define TAMP_FLTCR_TAMPPRCH_MSK      (0x3UL << TAMP_FLTCR_TAMPPRCH_POS)         /*!< 0x00000060 */
#define TAMP_FLTCR_TAMPPRCH          TAMP_FLTCR_TAMPPRCH_MSK
#define TAMP_FLTCR_TAMPPUDIS_POS     (7U)
#define TAMP_FLTCR_TAMPPUDIS_MSK     (0x1UL << TAMP_FLTCR_TAMPPUDIS_POS)        /*!< 0x00000080 */
#define TAMP_FLTCR_TAMPPUDIS         TAMP_FLTCR_TAMPPUDIS_MSK

/********************  Bits definition for TAMP_IER register  *****************/
#define TAMP_IER_TAMP1IE_POS         (0U)
#define TAMP_IER_TAMP1IE_MSK         (0x1UL << TAMP_IER_TAMP1IE_POS)            /*!< 0x00000001 */
#define TAMP_IER_TAMP1IE             TAMP_IER_TAMP1IE_MSK
#define TAMP_IER_TAMP2IE_POS         (1U)
#define TAMP_IER_TAMP2IE_MSK         (0x1UL << TAMP_IER_TAMP2IE_POS)            /*!< 0x00000002 */
#define TAMP_IER_TAMP2IE             TAMP_IER_TAMP2IE_MSK
#define TAMP_IER_ITAMP3IE_POS        (18U)
#define TAMP_IER_ITAMP3IE_MSK        (0x1UL << TAMP_IER_ITAMP3IE_POS)           /*!< 0x00040000 */
#define TAMP_IER_ITAMP3IE            TAMP_IER_ITAMP3IE_MSK
#define TAMP_IER_ITAMP4IE_POS        (19U)
#define TAMP_IER_ITAMP4IE_MSK        (0x1UL << TAMP_IER_ITAMP4IE_POS)           /*!< 0x00080000 */
#define TAMP_IER_ITAMP4IE            TAMP_IER_ITAMP4IE_MSK
#define TAMP_IER_ITAMP5IE_POS        (20U)
#define TAMP_IER_ITAMP5IE_MSK        (0x1UL << TAMP_IER_ITAMP5IE_POS)           /*!< 0x00100000 */
#define TAMP_IER_ITAMP5IE            TAMP_IER_ITAMP5IE_MSK
#define TAMP_IER_ITAMP6IE_POS        (21U)
#define TAMP_IER_ITAMP6IE_MSK        (0x1UL << TAMP_IER_ITAMP6IE_POS)           /*!< 0x00200000 */
#define TAMP_IER_ITAMP6IE            TAMP_IER_ITAMP6IE_MSK

/********************  Bits definition for TAMP_SR register  ******************/
#define TAMP_SR_TAMP1F_POS           (0U)
#define TAMP_SR_TAMP1F_MSK           (0x1UL << TAMP_SR_TAMP1F_POS)              /*!< 0x00000001 */
#define TAMP_SR_TAMP1F               TAMP_SR_TAMP1F_MSK
#define TAMP_SR_TAMP2F_POS           (1U)
#define TAMP_SR_TAMP2F_MSK           (0x1UL << TAMP_SR_TAMP2F_POS)              /*!< 0x00000002 */
#define TAMP_SR_TAMP2F               TAMP_SR_TAMP2F_MSK
#define TAMP_SR_ITAMP3F_POS          (18U)
#define TAMP_SR_ITAMP3F_MSK          (0x1UL << TAMP_SR_ITAMP3F_POS)             /*!< 0x00040000 */
#define TAMP_SR_ITAMP3F              TAMP_SR_ITAMP3F_MSK
#define TAMP_SR_ITAMP4F_POS          (19U)
#define TAMP_SR_ITAMP4F_MSK          (0x1UL << TAMP_SR_ITAMP4F_POS)             /*!< 0x00080000 */
#define TAMP_SR_ITAMP4F              TAMP_SR_ITAMP4F_MSK
#define TAMP_SR_ITAMP5F_POS          (20U)
#define TAMP_SR_ITAMP5F_MSK          (0x1UL << TAMP_SR_ITAMP5F_POS)             /*!< 0x00100000 */
#define TAMP_SR_ITAMP5F              TAMP_SR_ITAMP5F_MSK
#define TAMP_SR_ITAMP6F_POS          (21U)
#define TAMP_SR_ITAMP6F_MSK          (0x1UL << TAMP_SR_ITAMP6F_POS)             /*!< 0x00200000 */
#define TAMP_SR_ITAMP6F              TAMP_SR_ITAMP6F_MSK

/********************  Bits definition for TAMP_MISR register  ****************/
#define TAMP_MISR_TAMP1MF_POS        (0U)
#define TAMP_MISR_TAMP1MF_MSK        (0x1UL << TAMP_MISR_TAMP1MF_POS)           /*!< 0x00000001 */
#define TAMP_MISR_TAMP1MF            TAMP_MISR_TAMP1MF_MSK
#define TAMP_MISR_TAMP2MF_POS        (1U)
#define TAMP_MISR_TAMP2MF_MSK        (0x1UL << TAMP_MISR_TAMP2MF_POS)           /*!< 0x00000002 */
#define TAMP_MISR_TAMP2MF            TAMP_MISR_TAMP2MF_MSK
#define TAMP_MISR_ITAMP3MF_POS       (18U)
#define TAMP_MISR_ITAMP3MF_MSK       (0x1UL << TAMP_MISR_ITAMP3MF_POS)          /*!< 0x00040000 */
#define TAMP_MISR_ITAMP3MF           TAMP_MISR_ITAMP3MF_MSK
#define TAMP_MISR_ITAMP4MF_POS       (19U)
#define TAMP_MISR_ITAMP4MF_MSK       (0x1UL << TAMP_MISR_ITAMP4MF_POS)          /*!< 0x00080000 */
#define TAMP_MISR_ITAMP4MF           TAMP_MISR_ITAMP4MF_MSK
#define TAMP_MISR_ITAMP5MF_POS       (20U)
#define TAMP_MISR_ITAMP5MF_MSK       (0x1UL << TAMP_MISR_ITAMP5MF_POS)          /*!< 0x00100000 */
#define TAMP_MISR_ITAMP5MF           TAMP_MISR_ITAMP5MF_MSK
#define TAMP_MISR_ITAMP6MF_POS       (21U)
#define TAMP_MISR_ITAMP6MF_MSK       (0x1UL << TAMP_MISR_ITAMP6MF_POS)          /*!< 0x00200000 */
#define TAMP_MISR_ITAMP6MF           TAMP_MISR_ITAMP6MF_MSK

/********************  Bits definition for TAMP_SCR register  *****************/
#define TAMP_SCR_CTAMP1F_POS         (0U)
#define TAMP_SCR_CTAMP1F_MSK         (0x1UL << TAMP_SCR_CTAMP1F_POS)            /*!< 0x00000001 */
#define TAMP_SCR_CTAMP1F             TAMP_SCR_CTAMP1F_MSK
#define TAMP_SCR_CTAMP2F_POS         (1U)
#define TAMP_SCR_CTAMP2F_MSK         (0x1UL << TAMP_SCR_CTAMP2F_POS)            /*!< 0x00000002 */
#define TAMP_SCR_CTAMP2F             TAMP_SCR_CTAMP2F_MSK
#define TAMP_SCR_CITAMP3F_POS        (18U)
#define TAMP_SCR_CITAMP3F_MSK        (0x1UL << TAMP_SCR_CITAMP3F_POS)           /*!< 0x00040000 */
#define TAMP_SCR_CITAMP3F            TAMP_SCR_CITAMP3F_MSK
#define TAMP_SCR_CITAMP4F_POS        (19U)
#define TAMP_SCR_CITAMP4F_MSK        (0x1UL << TAMP_SCR_CITAMP4F_POS)           /*!< 0x00080000 */
#define TAMP_SCR_CITAMP4F            TAMP_SCR_CITAMP4F_MSK
#define TAMP_SCR_CITAMP5F_POS        (20U)
#define TAMP_SCR_CITAMP5F_MSK        (0x1UL << TAMP_SCR_CITAMP5F_POS)           /*!< 0x00100000 */
#define TAMP_SCR_CITAMP5F            TAMP_SCR_CITAMP5F_MSK
#define TAMP_SCR_CITAMP6F_POS        (21U)
#define TAMP_SCR_CITAMP6F_MSK        (0x1UL << TAMP_SCR_CITAMP6F_POS)           /*!< 0x00200000 */
#define TAMP_SCR_CITAMP6F            TAMP_SCR_CITAMP6F_MSK

/********************  Bits definition for TAMP_BKP0R register  ***************/
#define TAMP_BKP0R_POS               (0U)
#define TAMP_BKP0R_MSK               (0xFFFFFFFFUL << TAMP_BKP0R_POS)           /*!< 0xFFFFFFFF */
#define TAMP_BKP0R                   TAMP_BKP0R_MSK

/********************  Bits definition for TAMP_BKP1R register  ***************/
#define TAMP_BKP1R_POS               (0U)
#define TAMP_BKP1R_MSK               (0xFFFFFFFFUL << TAMP_BKP1R_POS)           /*!< 0xFFFFFFFF */
#define TAMP_BKP1R                   TAMP_BKP1R_MSK

/********************  Bits definition for TAMP_BKP2R register  ***************/
#define TAMP_BKP2R_POS               (0U)
#define TAMP_BKP2R_MSK               (0xFFFFFFFFUL << TAMP_BKP2R_POS)           /*!< 0xFFFFFFFF */
#define TAMP_BKP2R                   TAMP_BKP2R_MSK

/********************  Bits definition for TAMP_BKP3R register  ***************/
#define TAMP_BKP3R_POS               (0U)
#define TAMP_BKP3R_MSK               (0xFFFFFFFFUL << TAMP_BKP3R_POS)           /*!< 0xFFFFFFFF */
#define TAMP_BKP3R                   TAMP_BKP3R_MSK

