ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for TAMP_BKP4R register  ***************/
#define TAMP_BKP4R_POS               (0U)
#define TAMP_BKP4R_MSK               (0xFFFFFFFFUL << TAMP_BKP4R_POS)           /*!< 0xFFFFFFFF */
#define TAMP_BKP4R                   TAMP_BKP4R_MSK





//---------------------------------------------------------------------------------------------------------------------
//-------------------------------------------- UCPD REGISTERS ---------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------
/**
  * @brief UCPD
  */
typedef struct
{
  volatile uint32 CFG1;          /*!< UCPD configuration register 1,             Address offset: 0x00 */
  volatile uint32 CFG2;          /*!< UCPD configuration register 2,             Address offset: 0x04 */
  volatile uint32 RESERVED0;     /*!< UCPD reserved register,                    Address offset: 0x08 */
  volatile uint32 CR;            /*!< UCPD control register,                     Address offset: 0x0C */
  volatile uint32 IMR;           /*!< UCPD interrupt mask register,              Address offset: 0x10 */
  volatile uint32 SR;            /*!< UCPD status register,                      Address offset: 0x14 */
  volatile uint32 ICR;           /*!< UCPD interrupt flag clear register         Address offset: 0x18 */
  volatile uint32 TX_ORDSET;     /*!< UCPD Tx ordered set type register,         Address offset: 0x1C */
  volatile uint32 TX_PAYSZ;      /*!< UCPD Tx payload size register,             Address offset: 0x20 */
  volatile uint32 TXDR;          /*!< UCPD Tx data register,                     Address offset: 0x24 */
  volatile uint32 RX_ORDSET;     /*!< UCPD Rx ordered set type register,         Address offset: 0x28 */
  volatile uint32 RX_PAYSZ;      /*!< UCPD Rx payload size register,             Address offset: 0x2C */
  volatile uint32 RXDR;          /*!< UCPD Rx data register,                     Address offset: 0x30 */
  volatile uint32 RX_ORDEXT1;    /*!< UCPD Rx ordered set extension 1 register,  Address offset: 0x34 */
  volatile uint32 RX_ORDEXT2;    /*!< UCPD Rx ordered set extension 2 register,  Address offset: 0x38 */

} UCPD_TYPEDEF;

#define UCPD1               (*(UCPD_TYPEDEF *) UCPD1_BASE)
#define UCPD2               (*(UCPD_TYPEDEF *) UCPD2_BASE)


/********************  Bits definition for UCPD_CFG1 register  *******************/
#define UCPD_CFG1_HBITCLKDIV_POS            (0U)
#define UCPD_CFG1_HBITCLKDIV_MSK            (0x3FUL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x0000003F */
#define UCPD_CFG1_HBITCLKDIV                UCPD_CFG1_HBITCLKDIV_MSK              /*!< Number of cycles (minus 1) for a half bit clock */
#define UCPD_CFG1_HBITCLKDIV_0              (0x01UL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x00000001 */
#define UCPD_CFG1_HBITCLKDIV_1              (0x02UL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x00000002 */
#define UCPD_CFG1_HBITCLKDIV_2              (0x04UL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x00000004 */
#define UCPD_CFG1_HBITCLKDIV_3              (0x08UL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x00000008 */
#define UCPD_CFG1_HBITCLKDIV_4              (0x10UL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x00000010 */
#define UCPD_CFG1_HBITCLKDIV_5              (0x20UL << UCPD_CFG1_HBITCLKDIV_POS)  /*!< 0x00000020 */
#define UCPD_CFG1_IFRGAP_POS                (6U)
#define UCPD_CFG1_IFRGAP_MSK                (0x1FUL << UCPD_CFG1_IFRGAP_POS)      /*!< 0x000007C0 */
#define UCPD_CFG1_IFRGAP                    UCPD_CFG1_IFRGAP_MSK                  /*!< Clock divider value to generates Interframe gap */
#define UCPD_CFG1_IFRGAP_0                  (0x01UL << UCPD_CFG1_IFRGAP_POS)      /*!< 0x00000040 */
#define UCPD_CFG1_IFRGAP_1                  (0x02UL << UCPD_CFG1_IFRGAP_POS)      /*!< 0x00000080 */
#define UCPD_CFG1_IFRGAP_2                  (0x04UL << UCPD_CFG1_IFRGAP_POS)      /*!< 0x00000100 */
#define UCPD_CFG1_IFRGAP_3                  (0x08UL << UCPD_CFG1_IFRGAP_POS)      /*!< 0x00000200 */
#define UCPD_CFG1_IFRGAP_4                  (0x10UL << UCPD_CFG1_IFRGAP_POS)      /*!< 0x00000400 */
#define UCPD_CFG1_TRANSWIN_POS              (11U)
#define UCPD_CFG1_TRANSWIN_MSK              (0x1FUL << UCPD_CFG1_TRANSWIN_POS)    /*!< 0x0000F800 */
#define UCPD_CFG1_TRANSWIN                  UCPD_CFG1_TRANSWIN_MSK                /*!< Number of cycles (minus 1) of the half bit clock */
#define UCPD_CFG1_TRANSWIN_0                (0x01UL << UCPD_CFG1_TRANSWIN_POS)    /*!< 0x00000800 */
#define UCPD_CFG1_TRANSWIN_1                (0x02UL << UCPD_CFG1_TRANSWIN_POS)    /*!< 0x00001000 */
#define UCPD_CFG1_TRANSWIN_2                (0x04UL << UCPD_CFG1_TRANSWIN_POS)    /*!< 0x00002000 */
#define UCPD_CFG1_TRANSWIN_3                (0x08UL << UCPD_CFG1_TRANSWIN_POS)    /*!< 0x00004000 */
#define UCPD_CFG1_TRANSWIN_4                (0x10UL << UCPD_CFG1_TRANSWIN_POS)    /*!< 0x00008000 */
#define UCPD_CFG1_PSC_UCPDCLK_POS           (17U)
#define UCPD_CFG1_PSC_UCPDCLK_MSK           (0x7UL << UCPD_CFG1_PSC_UCPDCLK_POS)  /*!< 0x000E0000 */
#define UCPD_CFG1_PSC_UCPDCLK               UCPD_CFG1_PSC_UCPDCLK_MSK             /*!< Prescaler for UCPDCLK */
#define UCPD_CFG1_PSC_UCPDCLK_0             (0x1UL << UCPD_CFG1_PSC_UCPDCLK_POS)  /*!< 0x00020000 */
#define UCPD_CFG1_PSC_UCPDCLK_1             (0x2UL << UCPD_CFG1_PSC_UCPDCLK_POS)  /*!< 0x00040000 */
#define UCPD_CFG1_PSC_UCPDCLK_2             (0x4UL << UCPD_CFG1_PSC_UCPDCLK_POS)  /*!< 0x00080000 */
#define UCPD_CFG1_RXORDSETEN_POS            (20U)
#define UCPD_CFG1_RXORDSETEN_MSK            (0x1FFUL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x1FF00000 */
#define UCPD_CFG1_RXORDSETEN                UCPD_CFG1_RXORDSETEN_MSK              /*!< Receiver ordered set detection enable */
#define UCPD_CFG1_RXORDSETEN_0              (0x001UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x00100000 */
#define UCPD_CFG1_RXORDSETEN_1              (0x002UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x00200000 */
#define UCPD_CFG1_RXORDSETEN_2              (0x004UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x00400000 */
#define UCPD_CFG1_RXORDSETEN_3              (0x008UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x00800000 */
#define UCPD_CFG1_RXORDSETEN_4              (0x010UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x01000000 */
#define UCPD_CFG1_RXORDSETEN_5              (0x020UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x02000000 */
#define UCPD_CFG1_RXORDSETEN_6              (0x040UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x04000000 */
#define UCPD_CFG1_RXORDSETEN_7              (0x080UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x08000000 */
#define UCPD_CFG1_RXORDSETEN_8              (0x100UL << UCPD_CFG1_RXORDSETEN_POS) /*!< 0x10000000 */
#define UCPD_CFG1_TXDMAEN_POS               (29U)
#define UCPD_CFG1_TXDMAEN_MSK               (0x1UL << UCPD_CFG1_TXDMAEN_POS)      /*!< 0x20000000 */
#define UCPD_CFG1_TXDMAEN                   UCPD_CFG1_TXDMAEN_MSK                 /*!< DMA transmission requests enable   */
#define UCPD_CFG1_RXDMAEN_POS               (30U)
#define UCPD_CFG1_RXDMAEN_MSK               (0x1UL << UCPD_CFG1_RXDMAEN_POS)      /*!< 0x40000000 */
#define UCPD_CFG1_RXDMAEN                   UCPD_CFG1_RXDMAEN_MSK                 /*!< DMA reception requests enable   */
#define UCPD_CFG1_UCPDEN_POS                (31U)
#define UCPD_CFG1_UCPDEN_MSK                (0x1UL << UCPD_CFG1_UCPDEN_POS)       /*!< 0x80000000 */
#define UCPD_CFG1_UCPDEN                    UCPD_CFG1_UCPDEN_MSK                  /*!< USB Power Delivery Block Enable */

/********************  Bits definition for UCPD_CFG2 register  *******************/
#define UCPD_CFG2_RXFILTDIS_POS             (0U)
#define UCPD_CFG2_RXFILTDIS_MSK             (0x1UL << UCPD_CFG2_RXFILTDIS_POS)    /*!< 0x00000001 */
#define UCPD_CFG2_RXFILTDIS                 UCPD_CFG2_RXFILTDIS_MSK               /*!< Enables an Rx pre-filter for the BMC decoder */
#define UCPD_CFG2_RXFILT2N3_POS             (1U)
#define UCPD_CFG2_RXFILT2N3_MSK             (0x1UL << UCPD_CFG2_RXFILT2N3_POS)    /*!< 0x00000002 */
#define UCPD_CFG2_RXFILT2N3                 UCPD_CFG2_RXFILT2N3_MSK               /*!< Controls the sampling method for an Rx pre-filter for the BMC decode */
#define UCPD_CFG2_FORCECLK_POS              (2U)
#define UCPD_CFG2_FORCECLK_MSK              (0x1UL << UCPD_CFG2_FORCECLK_POS)     /*!< 0x00000004 */
#define UCPD_CFG2_FORCECLK                  UCPD_CFG2_FORCECLK_MSK                /*!< Controls forcing of the clock request UCPDCLK_REQ */
#define UCPD_CFG2_WUPEN_POS                 (3U)
#define UCPD_CFG2_WUPEN_MSK                 (0x1UL << UCPD_CFG2_WUPEN_POS)        /*!< 0x00000008 */
#define UCPD_CFG2_WUPEN                     UCPD_CFG2_WUPEN_MSK                   /*!< Wakeup from STOP enable */

/********************  Bits definition for UCPD_CR register  ********************/
#define UCPD_CR_TXMODE_POS                  (0U)
#define UCPD_CR_TXMODE_MSK                  (0x3UL << UCPD_CR_TXMODE_POS)         /*!< 0x00000003 */
#define UCPD_CR_TXMODE                      UCPD_CR_TXMODE_MSK                    /*!< Type of Tx packet  */
#define UCPD_CR_TXMODE_0                    (0x1UL << UCPD_CR_TXMODE_POS)         /*!< 0x00000001 */
#define UCPD_CR_TXMODE_1                    (0x2UL << UCPD_CR_TXMODE_POS)         /*!< 0x00000002 */
#define UCPD_CR_TXSEND_POS                  (2U)
#define UCPD_CR_TXSEND_MSK                  (0x1UL << UCPD_CR_TXSEND_POS)         /*!< 0x00000004 */
#define UCPD_CR_TXSEND                      UCPD_CR_TXSEND_MSK                    /*!< Type of Tx packet  */
#define UCPD_CR_TXHRST_POS                  (3U)
#define UCPD_CR_TXHRST_MSK                  (0x1UL << UCPD_CR_TXHRST_POS)         /*!< 0x00000008 */
#define UCPD_CR_TXHRST                      UCPD_CR_TXHRST_MSK                    /*!< Command to send a Tx Hard Reset  */
#define UCPD_CR_RXMODE_POS                  (4U)
#define UCPD_CR_RXMODE_MSK                  (0x1UL << UCPD_CR_RXMODE_POS)         /*!< 0x00000010 */
#define UCPD_CR_RXMODE                      UCPD_CR_RXMODE_MSK                    /*!< Receiver mode  */
#define UCPD_CR_PHYRXEN_POS                 (5U)
#define UCPD_CR_PHYRXEN_MSK                 (0x1UL << UCPD_CR_PHYRXEN_POS)        /*!< 0x00000020 */
#define UCPD_CR_PHYRXEN                     UCPD_CR_PHYRXEN_MSK                   /*!< Controls enable of USB Power Delivery receiver  */
#define UCPD_CR_PHYCCSEL_POS                (6U)
#define UCPD_CR_PHYCCSEL_MSK                (0x1UL << UCPD_CR_PHYCCSEL_POS)       /*!< 0x00000040 */
#define UCPD_CR_PHYCCSEL                    UCPD_CR_PHYCCSEL_MSK                  /*!<  */
#define UCPD_CR_ANASUBMODE_POS              (7U)
#define UCPD_CR_ANASUBMODE_MSK              (0x3UL << UCPD_CR_ANASUBMODE_POS)     /*!< 0x00000180 */
#define UCPD_CR_ANASUBMODE                  UCPD_CR_ANASUBMODE_MSK                /*!< Analog PHY sub-mode   */
#define UCPD_CR_ANASUBMODE_0                (0x1UL << UCPD_CR_ANASUBMODE_POS)     /*!< 0x00000080 */
#define UCPD_CR_ANASUBMODE_1                (0x2UL << UCPD_CR_ANASUBMODE_POS)     /*!< 0x00000100 */
#define UCPD_CR_ANAMODE_POS                 (9U)
#define UCPD_CR_ANAMODE_MSK                 (0x1UL << UCPD_CR_ANAMODE_POS)        /*!< 0x00000200 */
#define UCPD_CR_ANAMODE                     UCPD_CR_ANAMODE_MSK                   /*!< Analog PHY working mode   */
#define UCPD_CR_CCENABLE_POS                (10U)
#define UCPD_CR_CCENABLE_MSK                (0x3UL << UCPD_CR_CCENABLE_POS)       /*!< 0x00000C00 */
#define UCPD_CR_CCENABLE                    UCPD_CR_CCENABLE_MSK                  /*!<  */
#define UCPD_CR_CCENABLE_0                  (0x1UL << UCPD_CR_CCENABLE_POS)       /*!< 0x00000400 */
#define UCPD_CR_CCENABLE_1                  (0x2UL << UCPD_CR_CCENABLE_POS)       /*!< 0x00000800 */
#define UCPD_CR_FRSRXEN_POS                 (16U)
#define UCPD_CR_FRSRXEN_MSK                 (0x1UL << UCPD_CR_FRSRXEN_POS)        /*!< 0x00010000 */
#define UCPD_CR_FRSRXEN                     UCPD_CR_FRSRXEN_MSK                   /*!< Enable FRS request detection function */
#define UCPD_CR_FRSTX_POS                   (17U)
#define UCPD_CR_FRSTX_MSK                   (0x1UL << UCPD_CR_FRSTX_POS)          /*!< 0x00020000 */
#define UCPD_CR_FRSTX                       UCPD_CR_FRSTX_MSK                     /*!< Signal Fast Role Swap request */
#define UCPD_CR_RDCH_POS                    (18U)
#define UCPD_CR_RDCH_MSK                    (0x1UL << UCPD_CR_RDCH_POS)           /*!< 0x00040000 */
#define UCPD_CR_RDCH                        UCPD_CR_RDCH_MSK                      /*!<  */
#define UCPD_CR_CC1TCDIS_POS                (20U)
#define UCPD_CR_CC1TCDIS_MSK                (0x1UL << UCPD_CR_CC1TCDIS_POS)       /*!< 0x00100000 */
#define UCPD_CR_CC1TCDIS                    UCPD_CR_CC1TCDIS_MSK                  /*!< The bit allows the Type-C detector for CC0 to be disabled. */
#define UCPD_CR_CC2TCDIS_POS                (21U)
#define UCPD_CR_CC2TCDIS_MSK                (0x1UL << UCPD_CR_CC2TCDIS_POS)       /*!< 0x00200000 */
#define UCPD_CR_CC2TCDIS                    UCPD_CR_CC2TCDIS_MSK                  /*!< The bit allows the Type-C detector for CC2 to be disabled. */

/********************  Bits definition for UCPD_IMR register  *******************/
#define UCPD_IMR_TXISIE_POS                 (0U)
#define UCPD_IMR_TXISIE_MSK                 (0x1UL << UCPD_IMR_TXISIE_POS)        /*!< 0x00000001 */
#define UCPD_IMR_TXISIE                     UCPD_IMR_TXISIE_MSK                   /*!< Enable TXIS interrupt  */
#define UCPD_IMR_TXMSGDISCIE_POS            (1U)
#define UCPD_IMR_TXMSGDISCIE_MSK            (0x1UL << UCPD_IMR_TXMSGDISCIE_POS)   /*!< 0x00000002 */
#define UCPD_IMR_TXMSGDISCIE                UCPD_IMR_TXMSGDISCIE_MSK              /*!< Enable TXMSGDISC interrupt  */
#define UCPD_IMR_TXMSGSENTIE_POS            (2U)
#define UCPD_IMR_TXMSGSENTIE_MSK            (0x1UL << UCPD_IMR_TXMSGSENTIE_POS)   /*!< 0x00000004 */
#define UCPD_IMR_TXMSGSENTIE                UCPD_IMR_TXMSGSENTIE_MSK              /*!< Enable TXMSGSENT interrupt  */
#define UCPD_IMR_TXMSGABTIE_POS             (3U)
#define UCPD_IMR_TXMSGABTIE_MSK             (0x1UL << UCPD_IMR_TXMSGABTIE_POS)    /*!< 0x00000008 */
#define UCPD_IMR_TXMSGABTIE                 UCPD_IMR_TXMSGABTIE_MSK               /*!< Enable TXMSGABT interrupt  */
#define UCPD_IMR_HRSTDISCIE_POS             (4U)
#define UCPD_IMR_HRSTDISCIE_MSK             (0x1UL << UCPD_IMR_HRSTDISCIE_POS)    /*!< 0x00000010 */
#define UCPD_IMR_HRSTDISCIE                 UCPD_IMR_HRSTDISCIE_MSK               /*!< Enable HRSTDISC interrupt  */
#define UCPD_IMR_HRSTSENTIE_POS             (5U)
#define UCPD_IMR_HRSTSENTIE_MSK             (0x1UL << UCPD_IMR_HRSTSENTIE_POS)    /*!< 0x00000020 */
#define UCPD_IMR_HRSTSENTIE                 UCPD_IMR_HRSTSENTIE_MSK               /*!< Enable HRSTSENT interrupt  */
#define UCPD_IMR_TXUNDIE_POS                (6U)
#define UCPD_IMR_TXUNDIE_MSK                (0x1UL << UCPD_IMR_TXUNDIE_POS)       /*!< 0x00000040 */
#define UCPD_IMR_TXUNDIE                    UCPD_IMR_TXUNDIE_MSK                  /*!< Enable TXUND interrupt  */
#define UCPD_IMR_RXNEIE_POS                 (8U)
#define UCPD_IMR_RXNEIE_MSK                 (0x1UL << UCPD_IMR_RXNEIE_POS)        /*!< 0x00000100 */
#define UCPD_IMR_RXNEIE                     UCPD_IMR_RXNEIE_MSK                   /*!< Enable RXNE interrupt  */
#define UCPD_IMR_RXORDDETIE_POS             (9U)
#define UCPD_IMR_RXORDDETIE_MSK             (0x1UL << UCPD_IMR_RXORDDETIE_POS)    /*!< 0x00000200 */
#define UCPD_IMR_RXORDDETIE                 UCPD_IMR_RXORDDETIE_MSK               /*!< Enable RXORDDET interrupt  */
#define UCPD_IMR_RXHRSTDETIE_POS            (10U)
#define UCPD_IMR_RXHRSTDETIE_MSK            (0x1UL << UCPD_IMR_RXHRSTDETIE_POS)   /*!< 0x00000400 */
#define UCPD_IMR_RXHRSTDETIE                UCPD_IMR_RXHRSTDETIE_MSK              /*!< Enable RXHRSTDET interrupt  */
#define UCPD_IMR_RXOVRIE_POS                (11U)
#define UCPD_IMR_RXOVRIE_MSK                (0x1UL << UCPD_IMR_RXOVRIE_POS)       /*!< 0x00000800 */
#define UCPD_IMR_RXOVRIE                    UCPD_IMR_RXOVRIE_MSK                  /*!< Enable RXOVR interrupt  */
#define UCPD_IMR_RXMSGENDIE_POS             (12U)
#define UCPD_IMR_RXMSGENDIE_MSK             (0x1UL << UCPD_IMR_RXMSGENDIE_POS)    /*!< 0x00001000 */
#define UCPD_IMR_RXMSGENDIE                 UCPD_IMR_RXMSGENDIE_MSK               /*!< Enable RXMSGEND interrupt  */
#define UCPD_IMR_TYPECEVT1IE_POS            (14U)
#define UCPD_IMR_TYPECEVT1IE_MSK            (0x1UL << UCPD_IMR_TYPECEVT1IE_POS)   /*!< 0x00004000 */
#define UCPD_IMR_TYPECEVT1IE                UCPD_IMR_TYPECEVT1IE_MSK              /*!< Enable TYPECEVT1IE interrupt  */
#define UCPD_IMR_TYPECEVT2IE_POS            (15U)
#define UCPD_IMR_TYPECEVT2IE_MSK            (0x1UL << UCPD_IMR_TYPECEVT2IE_POS)   /*!< 0x00008000 */
#define UCPD_IMR_TYPECEVT2IE                UCPD_IMR_TYPECEVT2IE_MSK              /*!< Enable TYPECEVT2IE interrupt  */
#define UCPD_IMR_FRSEVTIE_POS               (20U)
#define UCPD_IMR_FRSEVTIE_MSK               (0x1UL << UCPD_IMR_FRSEVTIE_POS)      /*!< 0x00100000 */
#define UCPD_IMR_FRSEVTIE                   UCPD_IMR_FRSEVTIE_MSK                 /*!< Fast Role Swap interrupt  */

