ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for UCPD_SR register  ********************/
#define UCPD_SR_TXIS_POS                    (0U)
#define UCPD_SR_TXIS_MSK                    (0x1UL << UCPD_SR_TXIS_POS)           /*!< 0x00000001 */
#define UCPD_SR_TXIS                        UCPD_SR_TXIS_MSK                      /*!< Transmit interrupt status  */
#define UCPD_SR_TXMSGDISC_POS               (1U)
#define UCPD_SR_TXMSGDISC_MSK               (0x1UL << UCPD_SR_TXMSGDISC_POS)      /*!< 0x00000002 */
#define UCPD_SR_TXMSGDISC                   UCPD_SR_TXMSGDISC_MSK                 /*!< Transmit message discarded interrupt  */
#define UCPD_SR_TXMSGSENT_POS               (2U)
#define UCPD_SR_TXMSGSENT_MSK               (0x1UL << UCPD_SR_TXMSGSENT_POS)      /*!< 0x00000004 */
#define UCPD_SR_TXMSGSENT                   UCPD_SR_TXMSGSENT_MSK                 /*!< Transmit message sent interrupt  */
#define UCPD_SR_TXMSGABT_POS                (3U)
#define UCPD_SR_TXMSGABT_MSK                (0x1UL << UCPD_SR_TXMSGABT_POS)       /*!< 0x00000008 */
#define UCPD_SR_TXMSGABT                    UCPD_SR_TXMSGABT_MSK                  /*!< Transmit message abort interrupt  */
#define UCPD_SR_HRSTDISC_POS                (4U)
#define UCPD_SR_HRSTDISC_MSK                (0x1UL << UCPD_SR_HRSTDISC_POS)       /*!< 0x00000010 */
#define UCPD_SR_HRSTDISC                    UCPD_SR_HRSTDISC_MSK                  /*!< HRST discarded interrupt  */
#define UCPD_SR_HRSTSENT_POS                (5U)
#define UCPD_SR_HRSTSENT_MSK                (0x1UL << UCPD_SR_HRSTSENT_POS)       /*!< 0x00000020 */
#define UCPD_SR_HRSTSENT                    UCPD_SR_HRSTSENT_MSK                  /*!< HRST sent interrupt  */
#define UCPD_SR_TXUND_POS                   (6U)
#define UCPD_SR_TXUND_MSK                   (0x1UL << UCPD_SR_TXUND_POS)          /*!< 0x00000040 */
#define UCPD_SR_TXUND                       UCPD_SR_TXUND_MSK                     /*!< Tx data underrun condition interrupt  */
#define UCPD_SR_RXNE_POS                    (8U)
#define UCPD_SR_RXNE_MSK                    (0x1UL << UCPD_SR_RXNE_POS)           /*!< 0x00000100 */
#define UCPD_SR_RXNE                        UCPD_SR_RXNE_MSK                      /*!< Receive data register not empty interrupt  */
#define UCPD_SR_RXORDDET_POS                (9U)
#define UCPD_SR_RXORDDET_MSK                (0x1UL << UCPD_SR_RXORDDET_POS)       /*!< 0x00000200 */
#define UCPD_SR_RXORDDET                    UCPD_SR_RXORDDET_MSK                  /*!< Rx ordered set (4 K-codes) detected interrupt  */
#define UCPD_SR_RXHRSTDET_POS               (10U)
#define UCPD_SR_RXHRSTDET_MSK               (0x1UL << UCPD_SR_RXHRSTDET_POS)      /*!< 0x00000400 */
#define UCPD_SR_RXHRSTDET                   UCPD_SR_RXHRSTDET_MSK                 /*!< Rx Hard Reset detect interrupt  */
#define UCPD_SR_RXOVR_POS                   (11U)
#define UCPD_SR_RXOVR_MSK                   (0x1UL << UCPD_SR_RXOVR_POS)          /*!< 0x00000800 */
#define UCPD_SR_RXOVR                       UCPD_SR_RXOVR_MSK                     /*!< Rx data overflow interrupt  */
#define UCPD_SR_RXMSGEND_POS                (12U)
#define UCPD_SR_RXMSGEND_MSK                (0x1UL << UCPD_SR_RXMSGEND_POS)       /*!< 0x00001000 */
#define UCPD_SR_RXMSGEND                    UCPD_SR_RXMSGEND_MSK                  /*!< Rx message received  */
#define UCPD_SR_RXERR_POS                   (13U)
#define UCPD_SR_RXERR_MSK                   (0x1UL << UCPD_SR_RXERR_POS)          /*!< 0x00002000 */
#define UCPD_SR_RXERR                       UCPD_SR_RXERR_MSK                     /*!< RX Error */
#define UCPD_SR_TYPECEVT1_POS               (14U)
#define UCPD_SR_TYPECEVT1_MSK               (0x1UL << UCPD_SR_TYPECEVT1_POS)      /*!< 0x00004000 */
#define UCPD_SR_TYPECEVT1                   UCPD_SR_TYPECEVT1_MSK                 /*!< Type C voltage level event on CC1  */
#define UCPD_SR_TYPECEVT2_POS               (15U)
#define UCPD_SR_TYPECEVT2_MSK               (0x1UL << UCPD_SR_TYPECEVT2_POS)      /*!< 0x00008000 */
#define UCPD_SR_TYPECEVT2                   UCPD_SR_TYPECEVT2_MSK                 /*!< Type C voltage level event on CC2  */
#define UCPD_SR_TYPEC_VSTATE_CC1_POS        (16U)
#define UCPD_SR_TYPEC_VSTATE_CC1_MSK        (0x3UL << UCPD_SR_TYPEC_VSTATE_CC1_POS) /*!< 0x00030000 */
#define UCPD_SR_TYPEC_VSTATE_CC1            UCPD_SR_TYPEC_VSTATE_CC1_MSK            /*!< Status of DC level on CC1 pin  */
#define UCPD_SR_TYPEC_VSTATE_CC1_0          (0x1UL << UCPD_SR_TYPEC_VSTATE_CC1_POS) /*!< 0x00010000 */
#define UCPD_SR_TYPEC_VSTATE_CC1_1          (0x2UL << UCPD_SR_TYPEC_VSTATE_CC1_POS) /*!< 0x00020000 */
#define UCPD_SR_TYPEC_VSTATE_CC2_POS        (18U)
#define UCPD_SR_TYPEC_VSTATE_CC2_MSK        (0x3UL << UCPD_SR_TYPEC_VSTATE_CC2_POS) /*!< 0x000C0000 */
#define UCPD_SR_TYPEC_VSTATE_CC2            UCPD_SR_TYPEC_VSTATE_CC2_MSK            /*!<Status of DC level on CC2 pin  */
#define UCPD_SR_TYPEC_VSTATE_CC2_0          (0x1UL << UCPD_SR_TYPEC_VSTATE_CC2_POS) /*!< 0x00040000 */
#define UCPD_SR_TYPEC_VSTATE_CC2_1          (0x2UL << UCPD_SR_TYPEC_VSTATE_CC2_POS) /*!< 0x00080000 */
#define UCPD_SR_FRSEVT_POS                  (20U)
#define UCPD_SR_FRSEVT_MSK                  (0x1UL << UCPD_SR_FRSEVT_POS)         /*!< 0x00100000 */
#define UCPD_SR_FRSEVT                      UCPD_SR_FRSEVT_MSK                    /*!< Fast Role Swap detection event  */

/********************  Bits definition for UCPD_ICR register  *******************/
#define UCPD_ICR_TXMSGDISCCF_POS            (1U)
#define UCPD_ICR_TXMSGDISCCF_MSK            (0x1UL << UCPD_ICR_TXMSGDISCCF_POS)   /*!< 0x00000002 */
#define UCPD_ICR_TXMSGDISCCF                UCPD_ICR_TXMSGDISCCF_MSK              /*!< Tx message discarded flag (TXMSGDISC) clear  */
#define UCPD_ICR_TXMSGSENTCF_POS            (2U)
#define UCPD_ICR_TXMSGSENTCF_MSK            (0x1UL << UCPD_ICR_TXMSGSENTCF_POS)   /*!< 0x00000004 */
#define UCPD_ICR_TXMSGSENTCF                UCPD_ICR_TXMSGSENTCF_MSK              /*!< Tx message sent flag (TXMSGSENT) clear  */
#define UCPD_ICR_TXMSGABTCF_POS             (3U)
#define UCPD_ICR_TXMSGABTCF_MSK             (0x1UL << UCPD_ICR_TXMSGABTCF_POS)    /*!< 0x00000008 */
#define UCPD_ICR_TXMSGABTCF                 UCPD_ICR_TXMSGABTCF_MSK               /*!< Tx message abort flag (TXMSGABT) clear  */
#define UCPD_ICR_HRSTDISCCF_POS             (4U)
#define UCPD_ICR_HRSTDISCCF_MSK             (0x1UL << UCPD_ICR_HRSTDISCCF_POS)    /*!< 0x00000010 */
#define UCPD_ICR_HRSTDISCCF                 UCPD_ICR_HRSTDISCCF_MSK               /*!< Hard reset discarded flag (HRSTDISC) clear  */
#define UCPD_ICR_HRSTSENTCF_POS             (5U)
#define UCPD_ICR_HRSTSENTCF_MSK             (0x1UL << UCPD_ICR_HRSTSENTCF_POS)    /*!< 0x00000020 */
#define UCPD_ICR_HRSTSENTCF                 UCPD_ICR_HRSTSENTCF_MSK               /*!< Hard reset sent flag (HRSTSENT) clear  */
#define UCPD_ICR_TXUNDCF_POS                (6U)
#define UCPD_ICR_TXUNDCF_MSK                (0x1UL << UCPD_ICR_TXUNDCF_POS)       /*!< 0x00000040 */
#define UCPD_ICR_TXUNDCF                    UCPD_ICR_TXUNDCF_MSK                  /*!< Tx underflow flag (TXUND) clear  */
#define UCPD_ICR_RXORDDETCF_POS             (9U)
#define UCPD_ICR_RXORDDETCF_MSK             (0x1UL << UCPD_ICR_RXORDDETCF_POS)    /*!< 0x00000200 */
#define UCPD_ICR_RXORDDETCF                 UCPD_ICR_RXORDDETCF_MSK               /*!< Rx ordered set detect flag (RXORDDET) clear  */
#define UCPD_ICR_RXHRSTDETCF_POS            (10U)
#define UCPD_ICR_RXHRSTDETCF_MSK            (0x1UL << UCPD_ICR_RXHRSTDETCF_POS)   /*!< 0x00000400 */
#define UCPD_ICR_RXHRSTDETCF                UCPD_ICR_RXHRSTDETCF_MSK              /*!< Rx Hard Reset detected flag (RXHRSTDET) clear  */
#define UCPD_ICR_RXOVRCF_POS                (11U)
#define UCPD_ICR_RXOVRCF_MSK                (0x1UL << UCPD_ICR_RXOVRCF_POS)       /*!< 0x00000800 */
#define UCPD_ICR_RXOVRCF                    UCPD_ICR_RXOVRCF_MSK                  /*!< Rx overflow flag (RXOVR) clear  */
#define UCPD_ICR_RXMSGENDCF_POS             (12U)
#define UCPD_ICR_RXMSGENDCF_MSK             (0x1UL << UCPD_ICR_RXMSGENDCF_POS)    /*!< 0x00001000 */
#define UCPD_ICR_RXMSGENDCF                 UCPD_ICR_RXMSGENDCF_MSK               /*!< Rx message received flag (RXMSGEND) clear  */
#define UCPD_ICR_TYPECEVT1CF_POS            (14U)
#define UCPD_ICR_TYPECEVT1CF_MSK            (0x1UL << UCPD_ICR_TYPECEVT1CF_POS)   /*!< 0x00004000 */
#define UCPD_ICR_TYPECEVT1CF                UCPD_ICR_TYPECEVT1CF_MSK              /*!< TypeC event (CC1) flag (TYPECEVT1) clear  */
#define UCPD_ICR_TYPECEVT2CF_POS            (15U)
#define UCPD_ICR_TYPECEVT2CF_MSK            (0x1UL << UCPD_ICR_TYPECEVT2CF_POS)   /*!< 0x00008000 */
#define UCPD_ICR_TYPECEVT2CF                UCPD_ICR_TYPECEVT2CF_MSK              /*!< TypeC event (CC2) flag (TYPECEVT2) clear  */
#define UCPD_ICR_FRSEVTCF_POS               (20U)
#define UCPD_ICR_FRSEVTCF_MSK               (0x1UL << UCPD_ICR_FRSEVTCF_POS)      /*!< 0x00100000 */
#define UCPD_ICR_FRSEVTCF                   UCPD_ICR_FRSEVTCF_MSK                 /*!< Fast Role Swap event flag clear  */

/********************  Bits definition for UCPD_TXORDSET register  **************/
#define UCPD_TX_ORDSET_TXORDSET_POS         (0U)
#define UCPD_TX_ORDSET_TXORDSET_MSK         (0xFFFFFUL << UCPD_TX_ORDSET_TXORDSET_POS) /*!< 0x000FFFFF */
#define UCPD_TX_ORDSET_TXORDSET             UCPD_TX_ORDSET_TXORDSET_MSK                /*!< Tx Ordered Set */

/********************  Bits definition for UCPD_TXPAYSZ register  ****************/
#define UCPD_TX_PAYSZ_TXPAYSZ_POS           (0U)
#define UCPD_TX_PAYSZ_TXPAYSZ_MSK           (0x3FFUL << UCPD_TX_PAYSZ_TXPAYSZ_POS) /*!< 0x000003FF */
#define UCPD_TX_PAYSZ_TXPAYSZ               UCPD_TX_PAYSZ_TXPAYSZ_MSK              /*!< Tx payload size in bytes  */

/********************  Bits definition for UCPD_TXDR register  *******************/
#define UCPD_TXDR_TXDATA_POS                (0U)
#define UCPD_TXDR_TXDATA_MSK                 (0xFFUL << UCPD_TXDR_TXDATA_POS)      /*!< 0x000000FF */
#define UCPD_TXDR_TXDATA                    UCPD_TXDR_TXDATA_MSK                   /*!< Tx Data Register */

/********************  Bits definition for UCPD_RXORDSET register  **************/
#define UCPD_RX_ORDSET_RXORDSET_POS         (0U)
#define UCPD_RX_ORDSET_RXORDSET_MSK         (0x7UL << UCPD_RX_ORDSET_RXORDSET_POS)  /*!< 0x00000007 */
#define UCPD_RX_ORDSET_RXORDSET             UCPD_RX_ORDSET_RXORDSET_MSK             /*!< Rx Ordered Set Code detected  */
#define UCPD_RX_ORDSET_RXORDSET_0           (0x1UL << UCPD_RX_ORDSET_RXORDSET_POS)  /*!< 0x00000001 */
#define UCPD_RX_ORDSET_RXORDSET_1           (0x2UL << UCPD_RX_ORDSET_RXORDSET_POS)  /*!< 0x00000002 */
#define UCPD_RX_ORDSET_RXORDSET_2           (0x4UL << UCPD_RX_ORDSET_RXORDSET_POS)  /*!< 0x00000004 */
#define UCPD_RX_ORDSET_RXSOP3OF4_POS        (3U)
#define UCPD_RX_ORDSET_RXSOP3OF4_MSK        (0x1UL << UCPD_RX_ORDSET_RXSOP3OF4_POS) /*!< 0x00000008 */
#define UCPD_RX_ORDSET_RXSOP3OF4            UCPD_RX_ORDSET_RXSOP3OF4_MSK            /*!< Rx Ordered Set Debug indication */
#define UCPD_RX_ORDSET_RXSOPKINVALID_POS    (4U)
#define UCPD_RX_ORDSET_RXSOPKINVALID_MSK    (0x7UL << UCPD_RX_ORDSET_RXSOPKINVALID_POS) /*!< 0x00000070 */
#define UCPD_RX_ORDSET_RXSOPKINVALID        UCPD_RX_ORDSET_RXSOPKINVALID_MSK            /*!< Rx Ordered Set corrupted K-Codes (Debug) */

/********************  Bits definition for UCPD_RXPAYSZ register  ****************/
#define UCPD_RX_PAYSZ_RXPAYSZ_POS           (0U)
#define UCPD_RX_PAYSZ_RXPAYSZ_MSK           (0x3FFUL << UCPD_RX_PAYSZ_RXPAYSZ_POS) /*!< 0x000003FF */
#define UCPD_RX_PAYSZ_RXPAYSZ               UCPD_RX_PAYSZ_RXPAYSZ_MSK              /*!< Rx payload size in bytes  */

