ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
/********************  Bits definition for UCPD_RXDR register  *******************/
#define UCPD_RXDR_RXDATA_POS                (0U)
#define UCPD_RXDR_RXDATA_MSK                (0xFFUL << UCPD_RXDR_RXDATA_POS)      /*!< 0x000000FF */
#define UCPD_RXDR_RXDATA                    UCPD_RXDR_RXDATA_MSK                  /*!< 8-bit receive data  */

/********************  Bits definition for UCPD_RXORDEXT1 register  **************/
#define UCPD_RX_ORDEXT1_RXSOPX1_POS         (0U)
#define UCPD_RX_ORDEXT1_RXSOPX1_MSK         (0xFFFFFUL << UCPD_RX_ORDEXT1_RXSOPX1_POS) /*!< 0x000FFFFF */
#define UCPD_RX_ORDEXT1_RXSOPX1             UCPD_RX_ORDEXT1_RXSOPX1_MSK                /*!< RX Ordered Set Extension Register 1 */

/********************  Bits definition for UCPD_RXORDEXT2 register  **************/
#define UCPD_RX_ORDEXT2_RXSOPX2_POS         (0U)
#define UCPD_RX_ORDEXT2_RXSOPX2_MSK         (0xFFFFFUL << UCPD_RX_ORDEXT2_RXSOPX2_POS) /*!< 0x000FFFFF */
#define UCPD_RX_ORDEXT2_RXSOPX2             UCPD_RX_ORDEXT2_RXSOPX2_MSK                /*!< RX Ordered Set Extension Register 1 */





/*******************************************************************************
 *                 Register Abstraction
  Core Register contain:
  - Core Register
  - Core NVIC Register
  - Core SCB Register
  - Core SysTick Register
  - Core MPU Register
 ******************************************************************************/
/**
  \defgroup CMSIS_core_register Defines and Type Definitions
  \brief Type definitions and defines for Cortex-M processor based devices.
*/

/**
  \ingroup    CMSIS_core_register
  \defgroup   CMSIS_CORE  Status and Control Registers
  \brief      Core Register type definitions.
  @{
 */

/**
  \brief  Union type to access the Application Program Status Register (APSR).
 */
typedef union
{
  struct
  {
    uint32 _reserved0:28;              /*!< bit:  0..27  Reserved */
    uint32 V:1;                        /*!< bit:     28  Overflow condition code flag */
    uint32 C:1;                        /*!< bit:     29  Carry condition code flag */
    uint32 Z:1;                        /*!< bit:     30  Zero condition code flag */
    uint32 N:1;                        /*!< bit:     31  Negative condition code flag */
  } b;                                   /*!< Structure used for bit  access */
  uint32 w;                            /*!< Type      used for word access */
} APSR_TYPEDEF;

/* APSR Register Definitions */
#define APSR_N_POS                         31U                                            /*!< APSR: N Position */
#define APSR_N_MSK                         (1UL << APSR_N_POS)                            /*!< APSR: N Mask */

#define APSR_Z_POS                         30U                                            /*!< APSR: Z Position */
#define APSR_Z_MSK                         (1UL << APSR_Z_POS)                            /*!< APSR: Z Mask */

#define APSR_C_POS                         29U                                            /*!< APSR: C Position */
#define APSR_C_MSK                         (1UL << APSR_C_POS)                            /*!< APSR: C Mask */

#define APSR_V_POS                         28U                                            /*!< APSR: V Position */
#define APSR_V_MSK                         (1UL << APSR_V_POS)                            /*!< APSR: V Mask */


/**
  \brief  Union type to access the Interrupt Program Status Register (IPSR).
 */
typedef union
{
  struct
  {
    uint32 ISR:9;                      /*!< bit:  0.. 8  Exception number */
    uint32 _reserved0:23;              /*!< bit:  9..31  Reserved */
  } b;                                   /*!< Structure used for bit  access */
  uint32 w;                            /*!< Type      used for word access */
} IPSR_TYPEDEF;

/* IPSR Register Definitions */
#define IPSR_ISR_POS                        0U                                            /*!< IPSR: ISR Position */
#define IPSR_ISR_MSK                       (0x1FFUL /*<< IPSR_ISR_POS*/)                  /*!< IPSR: ISR Mask */


/**
  \brief  Union type to access the Special-Purpose Program Status Registers (xPSR).
 */
typedef union
{
  struct
  {
    uint32 ISR:9;                      /*!< bit:  0.. 8  Exception number */
    uint32 _reserved0:15;              /*!< bit:  9..23  Reserved */
    uint32 T:1;                        /*!< bit:     24  Thumb bit        (read 0) */
    uint32 _reserved1:3;               /*!< bit: 25..27  Reserved */
    uint32 V:1;                        /*!< bit:     28  Overflow condition code flag */
    uint32 C:1;                        /*!< bit:     29  Carry condition code flag */
    uint32 Z:1;                        /*!< bit:     30  Zero condition code flag */
    uint32 N:1;                        /*!< bit:     31  Negative condition code flag */
  } b;                                   /*!< Structure used for bit  access */
  uint32 w;                            /*!< Type      used for word access */
} xPSR_TYPEDEF;

/* xPSR Register Definitions */
#define xPSR_N_POS                         31U                                            /*!< xPSR: N Position */
#define xPSR_N_MSK                         (1UL << xPSR_N_POS)                            /*!< xPSR: N Mask */

#define xPSR_Z_POS                         30U                                            /*!< xPSR: Z Position */
#define xPSR_Z_MSK                         (1UL << xPSR_Z_POS)                            /*!< xPSR: Z Mask */

#define xPSR_C_POS                         29U                                            /*!< xPSR: C Position */
#define xPSR_C_MSK                         (1UL << xPSR_C_POS)                            /*!< xPSR: C Mask */

#define xPSR_V_POS                         28U                                            /*!< xPSR: V Position */
#define xPSR_V_MSK                         (1UL << xPSR_V_POS)                            /*!< xPSR: V Mask */

#define xPSR_T_POS                         24U                                            /*!< xPSR: T Position */
#define xPSR_T_MSK                         (1UL << xPSR_T_POS)                            /*!< xPSR: T Mask */

#define xPSR_ISR_POS                        0U                                            /*!< xPSR: ISR Position */
#define xPSR_ISR_MSK                       (0x1FFUL /*<< xPSR_ISR_POS*/)                  /*!< xPSR: ISR Mask */


/**
  \brief  Union type to access the Control Registers (CONTROL).
 */
typedef union
{
  struct
  {
    uint32 nPRIV:1;                    /*!< bit:      0  Execution privilege in Thread mode */
    uint32 SPSEL:1;                    /*!< bit:      1  Stack to be used */
    uint32 _reserved1:30;              /*!< bit:  2..31  Reserved */
  } b;                                   /*!< Structure used for bit  access */
  uint32 w;                            /*!< Type      used for word access */
} CONTROL_TYPEDEF;

/* CONTROL Register Definitions */
#define CONTROL_SPSEL_POS                   1U                                            /*!< CONTROL: SPSEL Position */
#define CONTROL_SPSEL_MSK                  (1UL << CONTROL_SPSEL_POS)                     /*!< CONTROL: SPSEL Mask */

#define CONTROL_nPRIV_POS                   0U                                            /*!< CONTROL: nPRIV Position */
#define CONTROL_nPRIV_MSK                  (1UL /*<< CONTROL_nPRIV_POS*/)                 /*!< CONTROL: nPRIV Mask */

/*@} end of group CMSIS_CORE */


/**
  \ingroup    CMSIS_core_register
  \defgroup   CMSIS_NVIC  Nested Vectored Interrupt Controller (NVIC)
  \brief      Type definitions for the NVIC Registers
  @{
 */

/**
  \brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC).
 */
typedef struct
{
    volatile uint32 Enable[1];
    volatile uint32 RESERVED0[31];
    volatile uint32 Disable[1];
    volatile uint32 RSERVED1[31];
    volatile uint32 Set[1];
    volatile uint32 RESERVED2[31];
    volatile uint32 Clear[1];
    volatile uint32 RESERVED3[31];
    volatile uint32 RESERVED4[64];
    volatile uint32 Priority[8];
} NVIC_TYPEDEF;


#define NVIC                (*(NVIC_TYPEDEF      *)     NVIC_BASE     )   /*!< NVIC configuration struct */

#define NVIC_PRIO_BITS                      2 //! STM32G0xx uses 2 Bits for the Priority Levels
#define NVIC_INTERRUPT_PRIORITY_ARRAY       8
#define NVIC_INTERRUPT_PRIORITY_CLEAR       ((uint32)0x00000000)

#define NVIC_DISABLE_ALL_INTERRUPTS         ((uint32)0xFFFFFFFFU)
#define NVIC_CLEAR_ALL_INTERRUPTS           ((uint32)0xFFFFFFFFU)

/*@} end of group CMSIS_NVIC */


/**
  \ingroup  CMSIS_core_register
  \defgroup CMSIS_SCB     System Control Block (SCB)
  \brief    Type definitions for the System Control Block Registers
  @{
 */

/**
  \brief  Structure type to access the System Control Block (SCB).
 */
typedef struct
{
  volatile const  uint32 CPUID;                  /*!< Offset: 0x000 (R/ )  CPUID Base Register */
  volatile uint32 ICSR;                   /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register */
  volatile uint32 VTOR;                   /*!< Offset: 0x008 (R/W)  Vector Table Offset Register */
  volatile uint32 AIRCR;                  /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register */
  volatile uint32 SCR;                    /*!< Offset: 0x010 (R/W)  System Control Register */
  volatile uint32 CCR;                    /*!< Offset: 0x014 (R/W)  Configuration Control Register */
        uint32 RESERVED1;
  volatile uint32 SHP[2U];                /*!< Offset: 0x01C (R/W)  System Handlers Priority Registers. [0] is RESERVED */
  volatile uint32 SHCSR;                  /*!< Offset: 0x024 (R/W)  System Handler Control and State Register */
} SCB_TYPEDEF;

#define SCB                 (*(SCB_TYPEDEF*) SCB_BASE)   /*!< SCB configuration struct */

#define AIRC_VECTKEY_MASK               ((uint32)0x05FA0000)   // See section 2.7.4 STR750 Reference Manual


/* SCB CPUID Register Definitions */
#define SCB_CPUID_IMPLEMENTER_POS          24U                                            /*!< SCB CPUID: IMPLEMENTER Position */
#define SCB_CPUID_IMPLEMENTER_MSK          (0xFFUL << SCB_CPUID_IMPLEMENTER_POS)          /*!< SCB CPUID: IMPLEMENTER Mask */

#define SCB_CPUID_VARIANT_POS              20U                                            /*!< SCB CPUID: VARIANT Position */
#define SCB_CPUID_VARIANT_MSK              (0xFUL << SCB_CPUID_VARIANT_POS)               /*!< SCB CPUID: VARIANT Mask */

#define SCB_CPUID_ARCHITECTURE_POS         16U                                            /*!< SCB CPUID: ARCHITECTURE Position */
#define SCB_CPUID_ARCHITECTURE_MSK         (0xFUL << SCB_CPUID_ARCHITECTURE_POS)          /*!< SCB CPUID: ARCHITECTURE Mask */

#define SCB_CPUID_PARTNO_POS                4U                                            /*!< SCB CPUID: PARTNO Position */
#define SCB_CPUID_PARTNO_MSK               (0xFFFUL << SCB_CPUID_PARTNO_POS)              /*!< SCB CPUID: PARTNO Mask */

