ehcouto/Vostok_ACU/Vostok_ACU_A/source/Micros/STM32G0x/Driver/Micro/uc_STM32G0x.h
#define SYSTICK_COUNTER_DISABLE             ((uint32)0xFFFFFFFEU)
#define SYSTICK_COUNTER_ENABLE              ((uint32)0x00000001)
#define SYSTICK_COUNTER_CLEAR               ((uint32)0x00000000)


/* SYSTICK Control / Status Register Definitions */
#define SYSTICK_CTRL_COUNTFLAG_POS         16U                                            /*!< SYSTICK CTRL: COUNTFLAG Position */
#define SYSTICK_CTRL_COUNTFLAG_MSK         (1UL << SYSTICK_CTRL_COUNTFLAG_POS)            /*!< SYSTICK CTRL: COUNTFLAG Mask */

#define SYSTICK_CTRL_CLKSOURCE_POS          2U                                            /*!< SYSTICK CTRL: CLKSOURCE Position */
#define SYSTICK_CTRL_CLKSOURCE_MSK         (1UL << SYSTICK_CTRL_CLKSOURCE_POS)            /*!< SYSTICK CTRL: CLKSOURCE Mask */

#define SYSTICK_CTRL_TICKINT_POS            1U                                            /*!< SYSTICK CTRL: TICKINT Position */
#define SYSTICK_CTRL_TICKINT_MSK           (1UL << SYSTICK_CTRL_TICKINT_POS)              /*!< SYSTICK CTRL: TICKINT Mask */

#define SYSTICK_CTRL_ENABLE_POS             0U                                            /*!< SYSTICK CTRL: ENABLE Position */
#define SYSTICK_CTRL_ENABLE_MSK            (1UL /*<< SYSTICK_CTRL_ENABLE_POS*/)           /*!< SYSTICK CTRL: ENABLE Mask */

/* SYSTICK Reload Register Definitions */
#define SYSTICK_LOAD_RELOAD_POS             0U                                            /*!< SYSTICK LOAD: RELOAD Position */
#define SYSTICK_LOAD_RELOAD_MSK            (0xFFFFFFUL /*<< SYSTICK_LOAD_RELOAD_POS*/)    /*!< SYSTICK LOAD: RELOAD Mask */

/* SYSTICK Current Register Definitions */
#define SYSTICK_VAL_CURRENT_POS             0U                                            /*!< SYSTICK VAL: CURRENT Position */
#define SYSTICK_VAL_CURRENT_MSK            (0xFFFFFFUL /*<< SYSTICK_VAL_CURRENT_POS*/)    /*!< SYSTICK VAL: CURRENT Mask */

/* SYSTICK Calibration Register Definitions */
#define SYSTICK_CALIB_NOREF_POS            31U                                            /*!< SYSTICK CALIB: NOREF Position */
#define SYSTICK_CALIB_NOREF_MSK            (1UL << SYSTICK_CALIB_NOREF_POS)               /*!< SYSTICK CALIB: NOREF Mask */

#define SYSTICK_CALIB_SKEW_POS             30U                                            /*!< SYSTICK CALIB: SKEW Position */
#define SYSTICK_CALIB_SKEW_MSK             (1UL << SYSTICK_CALIB_SKEW_POS)                /*!< SYSTICK CALIB: SKEW Mask */

#define SYSTICK_CALIB_TENMS_POS             0U                                            /*!< SYSTICK CALIB: TENMS Position */
#define SYSTICK_CALIB_TENMS_MSK            (0xFFFFFFUL /*<< SYSTICK_CALIB_TENMS_POS*/)    /*!< SYSTICK CALIB: TENMS Mask */

/*@} end of group CMSIS_SYSTICK */


#endif
